Repository: MuXodious/MusicBot
Catalog: i18n/*/LC_MESSAGES/musicbot_messages.po
Languages: ja_jp, ru_ru

source: Member is not voice-enabled and cannot use this command.
ja_jp: メンバーは音声対応ではないため、このコマンドは使用できません。
ru_ru: Участник не включен голосовым путем и не может использовать эту команду.

source: You cannot use this command when not in the voice channel.
ja_jp: ボイスチャンネルでない場合、このコマンドは使用できません。
ru_ru: Вы не можете использовать эту команду, если не в голосовом канале.

source: MusicBot does not have permission to Connect in channel: `%(name)s`
ja_jp: MusicBotにチャンネルで接続する権限がありません: `%(name)s`
ru_ru: У Музыкабота нет прав подключаться в канале: `%(name)s`

source: MusicBot does not have permission to Speak in channel: `%(name)s`
ja_jp: MusicBotにチャンネルで話す権限がありません: `%(name)s`
ru_ru: У Музыкабота нет прав говорить в канале: `%(name)s`

source: MusicBot could not connect to the channel. Try again later, or restart the bot if this continues.
ja_jp: MusicBot がチャンネルに接続できませんでした。 後でもう一度試すか、続行するとボットを再起動してください。

source: MusicBot connection to voice was cancelled. This is odd. Maybe restart?
ja_jp: ボイスチャットへのMusicBot接続がキャンセルされました。これは奇妙です。再起動しますか？
ru_ru: Подключение MusicBot к голосу было отменено. Это странно. Может быть перезапустить?

source: MusicBot does not have permission to speak.
ja_jp: MusicBot には話す権限がありません。
ru_ru: У MusicBot нет разрешения на чтение.

source: MusicBot could not request to speak.
ja_jp: MusicBot は話すことができませんでした。
ru_ru: MusicBot не может просить говорить.

source: The bot is not in a voice channel. Use the summon command to bring the bot to your voice channel.
ja_jp: ボットはボイスチャンネルに入っていません。 召喚コマンドを使ってボットをボイスチャンネルに連れてきてください。

source: Something is wrong, we didn't get the VoiceClient.
ja_jp: 問題が発生しました。VoiceClientを取得できませんでした。
ru_ru: Что-то не так, мы не получили VoiceClient.

source: Skipping next song `%(title)s` as requester `%(user)s` is not in voice!
ja_jp: 次の曲をスキップする `%(title)s`リクエスターとしての`%(user)s`は声になっていません！
ru_ru: Пропуск следующей песни `%(title)s` в качестве инициатора `%(user)s` не в голосе!

source: %(mention)s - your song `%(title)s` is now playing in %(channel)s!
ja_jp: %(mention)s - あなたの曲「%(title)s」が %(channel)sで再生されました！
ru_ru: %(mention)s - ваша песня `%(title)s` теперь играет в %(channel)s!

source: Now playing in %(channel)s: `%(title)s` added by %(author)s!
ja_jp: %(channel)sで遊んでいます: `%(title)s`が %(author)s によって追加されました!
ru_ru: Теперь играя в %(channel)s: `%(title)s` добавлен %(author)s!

source: Skipping songs added by %(user)s as they are not in voice!
ja_jp: %(user)s によって追加された曲を声に出していないのでスキップしています！
ru_ru: Пропускать песни, добавленные %(user)s , так как они не в голосе!

source: Playback failed for song `%(song)s` due to an error: ``` %(error)s```
ja_jp: 曲「%(song)s」の再生に失敗しました。エラー： ``` %(error)s```
ru_ru: Сбой воспроизведения `%(song)s` из-за ошибки: ``` %(error)s```

source: [Dev Bug] Tried sending an invalid response object.
ja_jp: 無効なレスポンスオブジェクトを送信しようとしました。
ru_ru: [Dev Bug] Попытка отправить некорректный объект ответа.

source: Reset the auto playlist queue by copying it back into player memory. This command will be removed in a future version, replaced by the autoplaylist command(s).
ja_jp: プレーヤーのメモリにコピーして自動プレイリストのキューをリセットします。 このコマンドは、将来のバージョンでは削除され、自動プレイリストコマンドに置き換えられます。
ru_ru: Сбросьте очередь автоматического воспроизведения, скопировав ее обратно в память плеера. Эта команда будет удалена в будущей версии, заменена командами autoplaylist (команды).

source: Show usage and description of a command, or list all available commands.
ja_jp: コマンドの使用状況と説明を表示するか、利用可能なすべてのコマンドを一覧表示します。
ru_ru: Показать использование и описание команды или список всех доступных команд.

source: **Aliases for this command:**
ja_jp: **このコマンドのエイリアス:**
ru_ru: **Псевдонимы для этой команды:**

source: **Alias of command:** `%(command)s`
ja_jp: **コマンドのエイリアス:** `%(command)s`
ru_ru: **Псевдоним команды:** `%(command)s`

source: No such command
ja_jp: そのようなコマンドはありません
ru_ru: Нет такой команды

source: **Commands by name:** *(without prefix)* ``` %(command_list)s ``` **Command Prefix:** %(prefix)s For help with a particular command, run: %(example_command)s %(all_note)s
ja_jp: **名前によるコマンド:** *(プレフィックスなし)* ``` %(command_list)s ``` **コマンドプレフィックス:** %(prefix)s 特定のコマンドに関するヘルプについては、 run: %(example_command)s %(all_note)s
ru_ru: **Команды по имени:** *(без префикса)* ``` %(command_list)s ``` **Префикс команд:** %(prefix)s Для помощи с определенной командой, выполнить: %(example_command)s %(all_note)s

source: Block a mentioned user.
ja_jp: メンションされたユーザーをブロックします。
ru_ru: Заблокировать указанного пользователя.

source: Unblock a mentioned user.
ja_jp: メンションしたユーザーのブロックを解除します。
ru_ru: Разблокировать указанного пользователя.

source: Show the block status of a mentioned user.
ja_jp: メンションされたユーザーのブロックステータスを表示します。
ru_ru: Показать статус блока упомянутого пользователя.

source: Manage the users in the user block list. Blocked users are forbidden from using all bot commands.
ja_jp: ユーザーブロックリストのユーザーを管理します。 ブロックされたユーザーはすべてのボットコマンドを使用できません。

source: You must mention a user or provide their ID number.
ja_jp: ユーザーに言及するか、ID番号を入力してください。
ru_ru: Вы должны указать пользователя или указать его идентификационный номер.

source: Invalid sub-command given. Use `help blockuser` for usage examples.
ja_jp: 無効なサブコマンドが与えられました。使用例には `help blockuser` を使用してください。
ru_ru: Неверная субкоманда. Для примеров использования используйте `help blockuser`.

source: MusicBot could not find the user(s) you specified.
ja_jp: MusicBotは指定したユーザーを見つけることができませんでした。
ru_ru: MusicBot не может найти указанного пользователя.

source: The owner cannot be added to the block list.
ja_jp: オーナーをブロックリストに追加できません。
ru_ru: Владелец не может быть добавлен в заблокированный список.

source: User block list is currently enabled.
ja_jp: ユーザーブロックリストは現在有効です。
ru_ru: Блок списка пользователей в настоящее время включен.

source: User block list is currently disabled.
ja_jp: ユーザーのブロックリストは現在無効です。
ru_ru: Блок списка пользователей в настоящее время отключен.

source: Cannot add the users you listed, they are already added.
ja_jp: あなたがリストしたユーザーを追加することはできません、すでに追加されています。
ru_ru: Не удается добавить пользователей, которые вы указали, они уже добавлены.

source: %(number)s user(s) have been added to the block list. %(status)s
ja_jp: %(number)s ユーザーがブロックリストに追加されました。 %(status)s
ru_ru: К списку блоков добавлено %(number)s пользователей(ов). %(status)s

source: None of those users are in the blacklist.
ja_jp: それらのユーザーのいずれもブラックリストにありません。
ru_ru: Никто из этих пользователей не находится в чёрном списке.

source: User: `%(user)s` is not blocked.
ja_jp: ユーザー: `%(user)s` はブロックされていません。
ru_ru: Пользователь: `%(user)s` не заблокирован.

source: User: `%(user)s` is blocked.
ja_jp: ユーザー: `%(user)s` がブロックされました。
ru_ru: Пользователь: `%(user)s` заблокирован.

source: **Block list status:** %(status)s %(users)s
ja_jp: **ブロックリストの状態:** %(status)s %(users)s
ru_ru: **Статус блокировки:** %(status)s %(users)s

source: %(number)s user(s) have been removed from the block list. %(status)s
ja_jp: %(number)s ユーザーがブロックリストから削除されました。 %(status)s
ru_ru: %(number)s пользователь(ы) были удалены из списка блокировки. %(status)s

source: You must provide a song subject if no song is currently playing.
ja_jp: 現在再生中の曲がない場合は、曲の件名を指定する必要があります。
ru_ru: Вы должны предоставить тему песни, если песня в настоящее время не воспроизводится.

source: Invalid sub-command given. Use `help blocksong` for usage examples.
ja_jp: 無効なサブコマンドが与えられました。使用例には `help blocksong` を使用してください。
ru_ru: Неверная субкоманда. Используйте `help blocksong` для примеров использования.

source: Subject `%(subject)s` is already in the song block list.
ja_jp: Subject `%(subject)s` はすでにソングブロックリストにあります。
ru_ru: Тема `%(subject)s` уже находится в списке блоков песен.

source: Added subject `%(subject)s` to the song block list. %(status)s
ja_jp: 曲のブロックリストに件名`%(subject)s`を追加しました。 %(status)s
ru_ru: Добавлена тема `%(subject)s` в список блоков песен. %(status)s

source: The subject is not in the song block list and cannot be removed.
ja_jp: 件名はソングブロックリストにないため、削除できません。
ru_ru: Тема отсутствует в списке блоков песни и не может быть удалена.

source: Subject `%(subject)s` has been removed from the block list. %(status)s
ja_jp: 件名 `%(subject)s` はブロックリストから削除されました。 %(status)s
ru_ru: Тема `%(subject)s` удалена из списка блоков. %(status)s

source: Adds or removes the specified song or currently playing song to/from the current playlist.
ja_jp: 指定した曲を追加または削除するか、現在プレイリストに曲を再生中です。

source: Adds the entire queue to the guilds playlist.
ja_jp: ギルドプレイリストにキュー全体を追加します。
ru_ru: Добавляет очередь в плейлист гильдий

source: Set a playlist as default for this guild and reloads the guild auto playlist.
ja_jp: このギルドのデフォルトとしてプレイリストを設定し、ギルドの自動プレイリストを再ロードします。

source: Invalid sub-command given. Use `help autoplaylist` for usage examples.
ja_jp: 無効なサブコマンドが与えられました。使用例には `help autoplaylist` を使用してください。
ru_ru: Неверная субкоманда. Используйте `help autoplaylist` для примеров использования.

source: The supplied song link is invalid
ja_jp: 指定された曲のリンクは無効です
ru_ru: Недействительная ссылка на песню

source: The queue is empty. Add some songs with a play command!
ja_jp: キューが空です。再生コマンドで曲を追加してください！
ru_ru: Очередь пуста. Добавьте несколько песен с помощью команды воспроизведения!

source: All songs in the queue are already in the autoplaylist.
ja_jp: キュー内のすべての曲はすでに自動プレイリストにあります。
ru_ru: Все песни в очереди уже находятся в списке автоматов.

source: Added %(number)d songs to the autoplaylist.
ja_jp: 自動プレイリストに %(number)d 曲を追加しました。
ru_ru: %(number)d треков добавлено в список автоматов.

source: Added `%(url)s` to the autoplaylist.
ja_jp: 自動プレイリストに「%(url)s」を追加しました。
ru_ru: `%(url)s` добавлен в автомат.

source: This song is already in the autoplaylist.
ja_jp: この曲はすでに自動プレイリストにあります。
ru_ru: Эта песня уже есть в автомате.

source: Removed `%(url)s` from the autoplaylist.
ja_jp: 自動プレイリストから`%(url)s`を削除しました。
ru_ru: `%(url)sудалён из автомата.

source: This song is not yet in the autoplaylist.
ja_jp: この曲はまだ自動プレイリストに入っていません。
ru_ru: Эта песня еще не находится в автомате.

source: Loaded a fresh copy of the playlist: `%(file)s`
ja_jp: プレイリストの新しいコピーを読み込みました: `%(file)s`
ru_ru: Загружена свежая копия плейлиста: `%(file)s`

source: You must provide a playlist filename.
ja_jp: プレイリストファイル名を指定する必要があります。
ru_ru: Вы должны указать имя файла плейлиста.

source: This playlist is new, you must add songs to save it to disk!
ja_jp: このプレイリストは新規です。ディスクに保存するには曲を追加してください！
ru_ru: Этот плейлист новый, вы должны добавить песни, чтобы сохранить его на диске!

source: The playlist for this server has been updated to: `%(name)s`%(note)s
ja_jp: このサーバーのプレイリストが更新されました: `%(name)s`%(note)s
ru_ru: Плейлист для этого сервера был обновлен на: `%(name)s`%(note)s

source: Generate an invite link that can be used to add this bot to another server.
ja_jp: このボットを他のサーバーに追加するために使用できる招待リンクを生成します。
ru_ru: Сгенерировать ссылку-приглашение, которая может быть использована для добавления этого бота на другой сервер.

source: Click here to add me to a discord server: %(url)s
ja_jp: Discordサーバーに追加するにはここをクリックしてください: %(url)s
ru_ru: Нажмите здесь, чтобы добавить меня на сервер discord: %(url)s

source: Toggle karaoke mode on or off. While enabled, only karaoke members may queue songs. Groups with BypassKaraokeMode permission control which members are Karaoke members.
ja_jp: カラオケモードのオン/オフを切り替えます。有効にすると、カラオケメンバーのみが曲をキューに追加できます。 カラオケメンバーであるBypassKaraokeMode権限制御を持つグループ。
ru_ru: Включает или выключает режим караоке. Если включено, только члены караоке. Группы с правами доступа BypassKaraokeMode контролируют членов Караоке.

source: \N{OK HAND SIGN} Karaoke mode is now enabled.
ja_jp: \N{OK HAND SIGN} カラオケモードが有効になりました。

source: \N{OK HAND SIGN} Karaoke mode is now disabled.
ja_jp: \N{OK HAND SIGN} カラオケモードが無効になりました。

source: You are not allowed to request playlists
ja_jp: プレイリストをリクエストする権限がありません
ru_ru: Вам не разрешено запрашивать плейлисты

source: Playlist has too many entries (%(songs)s but max is %(max)s)
ja_jp: プレイリストのエントリが多すぎます(%(songs)s ですが、最大は %(max)s です)
ru_ru: Плейлист имеет слишком много записей (%(songs)s , но максимум %(max)s)

source: Bot was previously paused, resuming playback now.
ja_jp: Botは以前に一時停止されていました。再生を再開しています。
ru_ru: Бот был ранее приостановлен, возобновите воспроизведение сейчас.

source: Play command that shuffles playlist entries before adding them to the queue.
ja_jp: キューに追加する前にプレイリストエントリをシャッフルするコマンドを再生します。
ru_ru: Воспроизведение команды, которая перемешивает плейлисты перед добавлением их в очередь.

source: Shuffled playlist items into the queue from `%(request)s`
ja_jp: `%(request)s`からのキューにプレイリストアイテムをシャッフルしました
ru_ru: Элементы плейлиста перемещены в очередь из `%(request)s`

source: A play command that adds the song as the next to play rather than last. Read help for the play command for information on supported inputs.
ja_jp: 曲を最後に再生するのではなく、次に追加する再生コマンドです。 サポートされている入力に関する情報については、playコマンドのヘルプを参照してください。
ru_ru: Команда воспроизведения, которая добавляет песню в ряды, а не в последнюю очередь. Читать справку для команды воспроизведения для информации о поддерживаемых входах.

source: A play command which skips any current song and plays immediately. Read help for the play command for information on supported inputs.
ja_jp: サポートされている入力に関する情報については、playコマンドのヘルプを参照してください。

source: Cannot use seek if there is nothing playing.
ja_jp: 何もプレイしていない場合はシークを使用できません。
ru_ru: Невозможно использовать поиск, если нет проигрывания.

source: Cannot use seek on current track, it has an unknown duration.
ja_jp: 現在のトラックでシークを使用することはできません、それは不明な期間を持っています。
ru_ru: Невозможно использовать поиск по текущему треку, он имеет неизвестную длительность.

source: Cannot use seek without a time to position playback.
ja_jp: 再生を配置する時間がなければシークは使用できません。
ru_ru: Невозможно использовать переключение без времени для размещения воспроизведения.

source: Could not convert `%(input)s` to a valid time in seconds.
ja_jp: `%(input)s`を秒単位で有効な時間に変換できませんでした。
ru_ru: Не удалось преобразовать `%(input)s` в допустимое время в секундах.

source: Cannot seek to `%(input)s` (`%(seconds)s` seconds) in the current track with a length of `%(progress)s / %(total)s`
ja_jp: `%(input)s/%(seconds)s`の長さのトラックの`%(progress)s `（` %(total)s`秒）をシークできません
ru_ru: Не удается переключиться в `%(input)s` (`%(seconds)s` секунд) в текущем треке длиной `%(progress)s / %(total)s`

source: Seeking to time `%(input)s` (`%(seconds).2f` seconds) in the current song.
ja_jp: 現在の曲には、%(input)s`（`%(seconds).2f`秒）を求めています。
ru_ru: Переход к времени `%(input)s` (`%(seconds).2f` секунд) в текущей песне.

source: No songs are currently playing. Play something with a play command.
ja_jp: 再生中の曲はありません。再生コマンドで何か再生できます。
ru_ru: На данный момент треков нет. Воспроизводите что-то с помощью команды воспроизведения.

source: Invalid sub-command. Use the command `help repeat` for usage examples.
ja_jp: 無効なサブコマンドです。使用例には「ヘルプの繰り返し」コマンドを使用してください。
ru_ru: Неверная субкоманда. Используйте команду `help repeat` для примеров использования.

source: Playlist is now repeating.
ja_jp: プレイリストが繰り返されています。
ru_ru: Повторяется плейлист.

source: Playlist is no longer repeating.
ja_jp: プレイリストはもう繰り返しません。
ru_ru: Плейлист больше не повторяется.

source: Player will now loop the current song.
ja_jp: プレーヤーは現在の曲をループさせます。
ru_ru: Игрок теперь повторяет текущую песню.

source: Player will no longer loop the current song.
ja_jp: プレーヤーは現在の曲をループしなくなります。
ru_ru: Игрок больше не будет повторять текущую песню.

source: Player is already looping a song!
ja_jp: プレイヤーは既に曲をループしています！
ru_ru: Игрок уже зацикливает песню!

source: The player is not currently looping.
ja_jp: プレーヤーは現在ループしていません。
ru_ru: Игрок в данный момент не зацикливается.

source: Song is no longer repeating.
ja_jp: 歌はもう繰り返されません。
ru_ru: Песня больше не повторяется.

source: Song is now repeating.
ja_jp: 歌が繰り返されています。
ru_ru: Песня повторяется.

source: Move song at position FROM to position TO.
ja_jp: 位置から位置へ曲を移動します。

source: Swap existing songs in the queue using their position numbers. Use the queue command to find track position numbers.
ja_jp: 位置番号を使用してキュー内の既存の曲を入れ替えます。 トラック位置番号を検索するにはキューコマンドを使用します。
ru_ru: Поменять местами существующие песни в очереди с использованием их номеров позиций. Используйте команду очереди, чтобы найти номера позиции трека.

source: There are no songs queued. Play something with a play command.
ja_jp: 曲がキューに追加されていません。再生コマンドで何かを再生します。
ru_ru: Нет песен в очереди песен. Проигрывайте что-нибудь с помощью команды воспроизведения.

source: Song positions must be integers!
ja_jp: 曲の位置は整数でなければなりません！
ru_ru: Позиции песни должны быть целыми!

source: You gave a position outside the playlist size!
ja_jp: プレイリストのサイズ以外の位置を指定しました！
ru_ru: Вы поставили позицию за пределами плейлиста!

source: Successfully moved song from position %(from)s in queue to position %(to)s!
ja_jp: 曲をキューの %(from)s から %(to)sに移動しました！
ru_ru: Песня успешно перемещена с позиции %(from)s в очереди на позицию %(to)s!

source: This link contains a Playlist ID: `%(url)s` Do you want to queue the playlist too?
ja_jp: このリンクにはプレイリストIDが含まれています： `%(url)s` プレイリストもキューに入れますか？

source: Local media playback is not enabled.
ja_jp: ローカルメディアの再生が有効になっていません。
ru_ru: Воспроизведение локального медиа не включено.

source: Spotify URL is invalid or not currently supported.
ja_jp: SpotifyのURLが無効または現在サポートされていません。
ru_ru: URL-адрес Spotify недействителен или в настоящее время не поддерживается.

source: Detected a Spotify URL, but Spotify is not enabled.
ja_jp: Spotify の URL が検出されましたが、Spotify は有効ではありません。
ru_ru: Обнаружен URL-адрес Spotify, но Spotify не включен.

source: You have reached your enqueued song limit (%(max)s)
ja_jp: キューに登録された曲の上限に達しました (%(max)s)
ru_ru: Вы достигли лимита на добавленные песни (%(max)s)

source: Karaoke mode is enabled, please try again when its disabled!
ja_jp: カラオケモードが有効になっています。無効になったらもう一度お試しください！
ru_ru: Караоке-режим включен, попробуйте еще раз, когда он отключен!

source: Failed to extract info due to error: %(raw_error)s
ja_jp: エラーのための情報の抽出に失敗しました: %(raw_error)s
ru_ru: Не удалось извлечь информацию из-за ошибки: %(raw_error)s

source: That video cannot be played. Try using the stream command.
ja_jp: 動画を再生できません。streamコマンドを使用してみてください。
ru_ru: Это видео не может быть воспроизведено. Попробуйте использовать команду трансляции.

source: YouTube search returned no results for: %(url)s
ja_jp: YouTubeの検索結果が %(url)sにはありませんでした
ru_ru: Поиск YouTube не дал результатов по запросу: %(url)s

source: No songs were added, all songs were over max duration (%(max)s seconds)
ja_jp: 曲が追加されていません。すべての曲が最大時間（%(max)s 秒）を超えています。
ru_ru: Не было добавлено треков, все песни были больше длительности (%(max)s секунд)

source: Enqueued **%(number)s** songs to be played. Position in queue: %(position)s
ja_jp: 再生される%(number)s**曲をキューに入れました。 キュー内の位置: %(position)s
ru_ru: В очереди **%(number)s** песни будут воспроизведены. Позиция в очереди: %(position)s

source: Song duration exceeds limit (%(length)s > %(max)s)
ja_jp: 曲の再生時間が制限を超えています(%(length)s > %(max)s)
ru_ru: Длительность песни превышает предел (%(length)s > %(max)s)

source: Playing next!
ja_jp: 次にプレイ！
ru_ru: Следующая игра!

source: %(position)s - estimated time until playing: `%(eta)s`
ja_jp: %(position)s - 再生までの推定時間: `%(eta)s`
ru_ru: %(position)s - предполагаемое время до игры: `%(eta)s`

source: %(position)s - cannot estimate time until playing.
ja_jp: %(position)s - プレイするまでの時間を見積もることはできません。
ru_ru: %(position)s - невозможно оценить время до игры.

source: Streaming playlists is not yet supported.
ja_jp: ストリーミングプレイリストはまだサポートされていません。
ru_ru: Потоковые плейлисты еще не поддерживаются.

source: Now streaming track `%(track)s`
ja_jp: トラックをストリーミング中 `%(track)s`
ru_ru: Теперь стриминг `%(track)s`

source: Search with service for a number of results with the search query.
ja_jp: 検索クエリで多数の結果をサービスで検索します。

source: Search YouTube for query but get a custom number of results. Note: the double-quotes are required in this case.
ja_jp: YouTubeでクエリを検索しますが、カスタムの結果数を取得します。 注意: この場合はダブルクォートが必要です。

source: You have reached your playlist item limit (%(max)s)
ja_jp: プレイリストアイテムの上限に達しました (%(max)s)
ru_ru: Вы достигли предела в плейлисте (%(max)s)

source: Please specify a search query. Use `help search` for more information.
ja_jp: 検索クエリを指定してください。詳細は `ヘルプ検索` を使用してください。
ru_ru: Пожалуйста, укажите поисковый запрос. Используйте `help search` для получения дополнительной информации.

source: You cannot search for more than %(max)s videos
ja_jp: %(max)s 以上の動画を検索することはできません
ru_ru: Вы не можете искать более чем %(max)s видео

source: Searching for videos...
ja_jp: 動画を検索しています...
ru_ru: Поиск видео...

source: Search failed due to an error: %(error)s
ja_jp: エラーのため検索に失敗しました: %(error)s
ru_ru: Поиск не удался из-за ошибки: %(error)s

source: No videos found.
ja_jp: 動画が見つかりません。
ru_ru: Видео не найдено.

source: To select a song, type the corresponding number.
ja_jp: 曲を選択するには、対応する番号を入力します。
ru_ru: Для выбора песни введите соответствующее число.

source: Search results from %(service)s:
ja_jp: %(service)s からの検索結果 :
ru_ru: Результаты поиска от %(service)s:

source: **0**. Cancel
ja_jp: **0** . キャンセル
ru_ru: **0**. Отмена

source: Pick a song
ja_jp: 曲を選択
ru_ru: Выберите песню

source: Added song [%(track)s](%(url)s) to the queue.
ja_jp: 曲[%(track)s](%(url)s) をキューに追加しました。
ru_ru: Добавлена песня [%(track)s](%(url)s) в очередь.

source: Result %(number)s of %(total)s: %(url)s
ja_jp: 結果 %(number)s of %(total)s: %(url)s
ru_ru: Результат %(number)s из %(total)s: %(url)s

source: Alright, coming right up!
ja_jp: よし、すぐに来るぞ！
ru_ru: Хорошо, приближайся!

source: Show information on what is currently playing.
ja_jp: 現在プレイ中の情報を表示します。
ru_ru: Показать информацию о том, что сейчас играет.

source: Now playing
ja_jp: 再生中
ru_ru: Играет сейчас

source: Currently streaming:
ja_jp: 現在ストリーミング中:
ru_ru: Сейчас стриминг:

source: Currently playing:
ja_jp: 現在プレイ中:
ru_ru: Сейчас играет:

source: Added By:
ja_jp: 追加者:
ru_ru: Добавлено через:

source: Progress:
ja_jp: 進行状況:
ru_ru: Прогресс:

source: There are no songs queued! Queue something with a play command.
ja_jp: 曲がキューに追加されていません! playコマンドで何かをキューに追加します。
ru_ru: Нет песен в очереди! Очередь что-то с помощью команды воспроизведения.

source: Tell MusicBot to join the channel you're in.
ja_jp: あなたのチャンネルに参加するようMusicBotに伝えてください。
ru_ru: Расскажите MusicBot, чтобы войти в канал, в который вы находитесь.

source: You are not connected to voice. Try joining a voice channel!
ja_jp: 音声に接続されていません。音声チャンネルに参加してみてください！
ru_ru: Вы не подключены к голосу. Попробуйте подключиться к голосовому каналу!

source: Connected to `%(channel)s`
ja_jp: `%(channel)s に接続しました`
ru_ru: Подключено к `%(channel)s`

source: Makes MusicBot follow a user when they change channels in a server.
ja_jp: MusicBotがサーバー内のチャンネルを変更したときにユーザーに従うようにします。

source: No longer following user `%(user)s`
ja_jp: もうユーザーをフォローしていません `%(user)s`
ru_ru: Больше не следует за пользователем `%(user)s`

source: Now following user `%(user)s` between voice channels.
ja_jp: ボイスチャンネル間のユーザー`%(user)s`をフォローしました。
ru_ru: Теперь следите за пользователем `%(user)s` между голосовыми каналами.

source: MusicBot cannot follow a user that is not a member of the server.
ja_jp: MusicBot はサーバーのメンバーではないユーザーをフォローできません。
ru_ru: MusicBot не может следить за пользователем, не являющимся членом сервера.

source: Will follow user `%(user)s` between voice channels.
ja_jp: ボイスチャンネル間のユーザー`%(user)s`に従います。
ru_ru: Будет следовать за пользователем `%(user)s` между голосовыми каналами.

source: Pause playback if a track is currently playing.
ja_jp: トラックが再生中の場合、再生を一時停止します。
ru_ru: Приостановить воспроизведение, если трек воспроизводится.

source: Paused music in `%(channel)s`
ja_jp: 音楽を一時停止しました`%(channel)s`
ru_ru: Пауза в `%(channel)s`

source: Player is not playing.
ja_jp: プレイヤーがプレイしていません。
ru_ru: Плеер не играет.

source: Resumes playback if the player was previously paused.
ja_jp: プレーヤーが以前に一時停止していた場合、再生を再開します。
ru_ru: Возобновляет воспроизведение, если плеер был ранее приостановлен.

source: Resumed music in `%(channel)s`
ja_jp: 音楽を%(channel)s で再開しました
ru_ru: Возобновленная музыка в `%(channel)s`
