Repository: MuXodious/MusicBot
Catalog: i18n/*/LC_MESSAGES/musicbot_messages.po
Languages: ja_jp, ru_ru

source: Sets the long delay period before deleting messages. This period is used by interactive or long-winded messages, like search and help.
ja_jp: メッセージを削除する前の長い遅延期間を設定します。 この期間は、検索やヘルプなどのインタラクティブまたは長巻きのメッセージで使用されます。

source: Allow MusicBot to save the song queue, so queued songs will survive restarts.
ja_jp: MusicBotが曲のキューを保存できるようにします。キューに入った曲は再起動できます。
ru_ru: Разрешить MusicBot сохранять очередь песен, так что песни в очереди будут перезапущены.

source: Enable MusicBot to download the next song in the queue while a song is playing. Currently this option does not apply to auto playlist or songs added to an empty queue.
ja_jp: MusicBotを有効にすると、曲の再生中に次の曲をキューにダウンロードできます。 現在、このオプションは、空のキューに追加された自動プレイリストや曲には適用されません。
ru_ru: Включите MusicBot, чтобы загрузить следующую песню в очереди во время воспроизведения. В настоящее время эта опция не применяется к автоматическому плейлисту или трекам, добавленным в пустую очередь.

source: If enabled, status messages will report info on paused players.
ja_jp: 有効にすると、ステータスメッセージは一時停止中のプレイヤーに情報を報告します。
ru_ru: Если включено, сообщения о состоянии будут сообщать о приостановленных игроках.

source: If enabled, MusicBot will save the track title to: data/[Server ID]/current.txt
ja_jp: 有効にすると、MusicBotはトラックタイトルをdata/[Server ID]/current.txt に保存します。
ru_ru: Если включено, MusicBot сохранит заголовок трека в: data/[Server ID]/current.txt

source: Allow the member who requested the song to skip it, bypassing votes.
ja_jp: 投票を無視して曲をスキップするように要求したメンバーを許可します。
ru_ru: Позволить участнику, который попросил пропустить песню, обходить голоса.

source: Tries to use ffmpeg to get volume normalizing options for use in playback. This option can cause delay between playing songs, as the whole track must be processed.
ja_jp: ffmpegを使用して、再生時に使用するボリューム正規化オプションを取得しようとします。 トラック全体を処理する必要があるため、このオプションは曲を再生する間の遅延を引き起こす可能性があります。
ru_ru: Пытается использовать ffmpeg для нормализации громкости для использования в воспроизведении. Эта опция может привести к задержке между воспроизведением песни, так как трек должен обрабатываться.

source: Allow MusicBot to format its messages as embeds.
ja_jp: MusicBot がメッセージを埋め込み形式にすることを許可します。
ru_ru: Разрешить MusicBot форматировать свои сообщения как вставки.

source: The number of entries to show per-page when using q command to list the queue.
ja_jp: キューを一覧表示するために q コマンドを使用するときに、ページごとに表示するエントリ数です。
ru_ru: Количество записей для показа на страницу при использовании команды q в списке очереди.

source: Enable MusicBot to automatically remove unplayable entries from the auto playlist.
ja_jp: 自動再生リストから再生できないエントリを自動的に削除するには、MusicBotを有効にします。
ru_ru: Включите MusicBot, чтобы автоматически удалить невоспроизводимые записи из автоплейлиста.

source: Display MusicBot config settings in the logs at startup.
ja_jp: 起動時にログに MusicBot の設定を表示します。
ru_ru: Отображать настройки MusicBot в журналах при запуске.

source: Enable users with the InstaSkip permission to bypass skip voting and force skips.
ja_jp: InstaSkip権限を持つユーザーを有効にして、スキップ投票とスキップをバイパスします。
ru_ru: Разрешить пользователям с правом InstaSkip пропускать пропуск голосования и пропускать пропуска.

source: If enabled, MusicBot will leave servers if the owner is not in their member list.
ja_jp: 有効にすると、オーナーがメンバーリストに登録されていない場合、MusicBotはサーバーから退出します。
ru_ru: Если включено, MusicBot оставит серверы, если владелец не находится в их списке участников.

source: If enabled, MusicBot will allow commands to have multiple names using data in: config/aliases.json
ja_jp: 有効にすると、MusicBotはデータを使用して複数の名前を持つコマンドを許可します。config/aliases.json
ru_ru: Если включено, MusicBot позволит командам иметь несколько имён используя данные: config/aliases.json

source: Replace MusicBot name/version in embed footer with custom text. Only applied when UseEmbeds is enabled and it is not blank.
ja_jp: 埋め込みフッターのMusicBot名/バージョンをカスタムテキストに置き換えます。 UseEmbedsが有効で空白でない場合にのみ適用されます。

source: Completely remove the footer from embeds.
ja_jp: 埋め込みからフッターを完全に削除します。
ru_ru: Полностью удалить нижний колонтитул с вставки.

source: MusicBot will automatically deafen itself when entering a voice channel.
ja_jp: MusicBot は音声チャンネルに入ると自動的に聴覚障害を発生します。
ru_ru: Музыкальный робот автоматически отключается при входе в голосовой канал.

source: Set a period of time to wait before leaving an inactive voice channel. You can set this to a number of seconds or phrase like: 4 hours
ja_jp: 非アクティブなボイスチャンネルを離れる前に待機する期間を設定します。 次のような秒数またはフレーズに設定できます: 4時間
ru_ru: Установить период времени ожидания перед выходом из неактивного голосового канала. Вы можете установить это количество секунд или фразы: 4 часа

source: If enabled, MusicBot will leave the channel immediately when the song queue is empty.
ja_jp: 有効にすると、MusicBotは曲のキューが空の場合、すぐにチャンネルから退出します。
ru_ru: Если включено, MusicBot сразу же покинет канал, когда очередь песен пуста.

source: When paused or no longer playing, wait for this amount of time then leave voice. You can set this to a number of seconds of phrase like: 15 minutes Set it to 0 to disable leaving in this way.
ja_jp: 一時停止または再生を停止した場合、この時間を待ってから音声を離れます。 次のようなフレーズの秒数に設定できます: 15 minutes この方法で残りを無効にするには、0に設定します。
ru_ru: При паузе или больше не играть, подождите это время, затем оставьте голос. Вы можете установить это количество секунд фразы, например, 15 минут Установите 0, чтобы отключить оставление таким образом.

source: If enabled, users must indicate search result choices by sending a message instead of using reactions.
ja_jp: 有効にした場合、ユーザーはリアクションを使用する代わりにメッセージを送信することによって検索結果の選択を示す必要があります。
ru_ru: Если этот параметр включен, пользователи должны указывать выбор результатов поиска, отправляя сообщение вместо реакции.

source: Sets the default number of search results to fetch when using the search command without a specific number.
ja_jp: 検索コマンドを特定の番号なしで使用する場合に取得する検索結果のデフォルトの数を設定します。
ru_ru: Устанавливает количество результатов поиска по умолчанию при использовании команды поиска без определенного числа.

source: Allow MusicBot to save a per-server command prefix, and enables the setprefix command.
ja_jp: MusicBot がサーバー毎のコマンドプレフィックスを保存できるようにし、setprefix コマンドを有効にします。
ru_ru: Разрешить MusicBot сохранять префикс для каждого сервера и включать команду setprefix.

source: If enabled and multiple members are adding songs, MusicBot will organize playback for one song per member.
ja_jp: 有効にして複数のメンバーが曲を追加している場合、MusicBotはメンバーごとに1曲の再生を整理します。
ru_ru: Если включено, и несколько членов добавляют песни, MusicBot организует воспроизведение для одной песни на одного участника.

source: Enable saving all songs played by MusicBot to a global playlist file: %(filename)s This will contain all songs from all servers.
ja_jp: MusicBotで再生されたすべての曲をグローバルプレイリストファイルに保存することを有効にします: %(filename)s すべてのサーバーのすべての曲が含まれます。
ru_ru: Включить сохранение всех треков, исполняемых MusicBot в глобальный файл плейлиста: %(filename)s Это будет содержать все песни со всех серверов.

source: Allow MusicBot to automatically unpause when play commands are used.
ja_jp: 再生コマンドを使用すると、MusicBotが自動的に一時停止を解除できるようになります。
ru_ru: Разрешить Музыкаботу автоматически освобождать от паузы при использовании воспроизведения команд.

source: Experimental, HTTP/HTTPS proxy settings to use with ytdlp media downloader. The value set here is passed to `ytdlp --proxy` and aiohttp header checking. Leave blank to disable.
ja_jp: ytdlp メディアダウンローダーで使用する、HTTP/HTTPS プロキシ設定を実験的に行います。 ここで設定された値は `ytdlp --proxy` と aiohttp ヘッダーチェックに渡されます。 無効にするには空白のままにします。
ru_ru: Экспериментальные настройки HTTP/HTTPS прокси для использования с ytdlp медиа-загрузчиком. Значение, установленное здесь, передано `ytdlp --proxy` и aiohttp проверка заголовка. Оставьте пустым для отключения.

source: Toggle the user block list feature, without emptying the block list.
ja_jp: ブロックリストを空にせずに、ユーザーのブロックリスト機能を切り替えます。
ru_ru: Вкл/Выкл функцию блокировки списка, не очищая список блоков.

source: An optional file path to a text file listing Discord User IDs, one per line.
ja_jp: DiscordユーザーIDを一行に1つリストするテキストファイルへのオプションのファイルパスです。
ru_ru: Необязательный путь к файлу с текстовым файлом, в котором перечислены ID пользователя Discord по одному в строке.

source: Enable the song block list feature, without emptying the block list.
ja_jp: ブロックリストを空にせずに、ソングブロックリスト機能を有効にします。
ru_ru: Включить функцию списка блоков песни, не очищая список блоков.

source: An optional file path to a text file that lists URLs, words, or phrases one per line. Any song title or URL that contains any line in the list will be blocked.
ja_jp: URL、単語、またはフレーズを一行に一覧表示するテキストファイルへのオプションのファイルパス。 リスト内の任意の行を含む曲名やURLはブロックされます。
ru_ru: Необязательный путь к текстовому файлу, в котором перечислены URL, слова или фразы по одному на строке. Название или URL песни, содержащие любую строку в списке, будут заблокированы.

source: An optional path to a directory containing auto playlist files. Each file should contain a list of playable URLs or terms, one track per line.
ja_jp: 自動プレイリストファイルを含むディレクトリへのオプションのパス。 各ファイルには、プレイ可能な URL または用語のリストが含まれている必要があります。
ru_ru: Необязательный путь к папке, содержащей файлы автоматического воспроизведения. Каждый файл должен содержать список доступных для воспроизведения URL или терминов, по одному треку в строке.

source: An optional directory path where MusicBot will store long and short-term cache for playback.
ja_jp: MusicBotが長く短いキャッシュを保存するオプションのディレクトリパスです。
ru_ru: Необязательный путь к папке, где MusicBot будет хранить длинный и краткосрочный кэш для воспроизведения.

source: Error while validating config options. Problem: AudioCachePath config option could not be set due to an error: %(raw_error)s Solution: Double check the setting is a valid, accessible directory path.
ja_jp: 設定オプションの検証中にエラーが発生しました。 問題: AudioCachePath 設定オプションはエラーが原因で設定できませんでした: %(raw_error)s ソリューション: 設定が有効であることを再確認してください。 アクセス可能なディレクトリパス
ru_ru: Ошибка при проверке параметров конфигурации. Проблема: Опция конфигурации AudioCachePath не может быть установлена из-за ошибки: %(raw_error)s Решение: Двойная проверка правильности, доступный путь к каталогу.

source: Error locating config. Problem: Could not find or create a config file due to an error: %(raw_error)s Solution: Verify the config folder and files exist and can be read by MusicBot.
ja_jp: 設定の場所を特定できませんでした。 問題: エラーが原因で設定ファイルを見つけることができませんでした: %(raw_error)s ソリューション: 設定フォルダとファイルが存在することを確認し、MusicBotによって読み込まれます。
ru_ru: Ошибка поиска конфигурации. Проблема: Не удалось найти или создать файл конфигурации из-за ошибки: %(raw_error)s Решение: Проверьте папку конфигурации и файлы существуют и могут быть прочитаны MusicBot.

source: HEAD seems to have no headers...
ja_jp: ヘッダがないみたいだな。
ru_ru: HEAD не имеет заголовков...

source: Song info extraction returned no data.
ja_jp: 曲情報の抽出はデータを返しませんでした。
ru_ru: Извлечение информации о треке не дало никаких данных.

source: Cannot continue extraction, event loop is closed.
ja_jp: 抽出を続行できません。イベントループは閉じられています。
ru_ru: Невозможно продолжить извлечение. Цикл события закрыт.

source: Spotify URL is invalid or not supported.
ja_jp: SpotifyのURLが無効かサポートされていません。
ru_ru: URL-адрес Spotify недействителен или не поддерживается.

source: Cannot stream an invalid URL.
ja_jp: 無効なURLをストリーミングできません。
ru_ru: Невозможно провести некорректный URL-адрес.

source: The local media file could not be found.
ja_jp: ローカルメディアファイルが見つかりません。
ru_ru: Локальный медиа-файл не найден.

source: Cannot download Spotify links, processing error with type: %(type)s
ja_jp: Spotifyのリンクをダウンロードできません。 %(type)s
ru_ru: Не удается загрузить ссылки Spotify, ошибка обработки типа %(type)s

source: Download did not complete due to an error: %(raw_error)s
ja_jp: エラーが発生したため、ダウンロードが完了しませんでした: %(raw_error)s
ru_ru: Загрузка не завершена из-за ошибки: %(raw_error)s

source: Download failed due to a yt-dlp error: %(raw_error)s
ja_jp: yt-dlpエラーのためダウンロードに失敗しました: %(raw_error)s
ru_ru: Загрузка не удалась из-за ошибки yt-dlp: %(raw_error)s

source: Download failed due to an unhandled exception: %(raw_error)s
ja_jp: 未処理の例外のためダウンロードに失敗しました: %(raw_error)s
ru_ru: Загрузка не удалась из-за необработанного исключения: %(raw_error)s

source: Failed to extract data for the requested media.
ja_jp: 要求されたメディアのデータの抽出に失敗しました。
ru_ru: Не удалось извлечь данные для запрошенного носителя.

source: List of command names denied from use, separated by spaces. Will not work if CommandWhitelist is set!
ja_jp: 空白で区切られた使用から拒否されたコマンド名のリスト。 コマンドホワイトリストが設定されている場合は動作しません！
ru_ru: Список названий команд, разделенных пробелами. Не будет работать, если установлен CommandWhitelist!

source: When enabled, CommandBlacklist and CommandWhitelist are used together. Only commands in the whitelist are allowed, however sub-commands may be denied by the blacklist.
ja_jp: 有効にすると、CommandBlacklistとCommandWhitelistが一緒に使用されます。 ホワイトリスト内のコマンドのみが許可されますが、サブコマンドはブラックリストによって拒否される可能性があります。

source: List of command names that can only be used while in the same voice channel as MusicBot. Some commands will always require the user to be in voice, regardless of this list. Command names should be separated by spaces.
ja_jp: MusicBotと同じ音声チャンネルでのみ使用できるコマンド名のリスト。 いくつかのコマンドは、このリストにかかわらず、常にユーザーが音声になっている必要があります。 コマンド名はスペースで区切られている必要があります。
ru_ru: Список имен команд, которые можно использовать только в голосовом канале с MusicBot. Некоторые команды всегда требуют, чтобы пользователь был в голосе, независимо от этого списка. имена команд должны быть разделены пробелами.

source: List of Discord server role IDs that are granted this permission group. This option is ignored if UserList is set.
ja_jp: この権限グループに付与されたDiscordサーバーのロールIDの一覧。 UserListが設定されている場合、このオプションは無視されます。

source: List of Discord member IDs that are granted permissions in this group. This option overrides GrantToRoles.
ja_jp: このグループの権限を付与されたDiscordメンバーIDの一覧。 このオプションはGrantToRolesを上書きします。
ru_ru: Список ID участников Discord, которым предоставлены права доступа в эту группу. Эта опция переопределяет Гранты Роли.

source: Maximum number of songs a user is allowed to queue. A value of 0 means unlimited.
ja_jp: ユーザーがキューに登録できる曲の最大数。 0の値は無制限を意味します。

source: Maximum length of a song in seconds. A value of 0 means unlimited. This permission may not be enforced if song duration is not available.
ja_jp: 曲の最大長を秒単位で指定します。0 の値は無制限を意味します。 曲の継続時間が利用できない場合、この権限は強制されないことがあります。
ru_ru: Максимальная длина песни в секундах. Значение 0 означает неограниченное. Это разрешение не может быть исполнено, если продолжительность песни недоступна.

source: Maximum number of songs a playlist is allowed to have when queued. A value of 0 means unlimited.
ja_jp: Aformat@@1 0の値は無制限を意味します。

source: The maximum number of items that can be returned in a search.
ja_jp: 検索で返されるアイテムの最大数。
ru_ru: Максимальное количество элементов, которые могут быть возвращены при поиске.

source: Allow users to queue playlists, or multiple songs at once.
ja_jp: ユーザーが一度にプレイリストまたは複数の曲をキューに入れることを許可します。
ru_ru: Разрешить пользователям добавлять в очередь плейлисты или несколько песен сразу.

source: Allow users to skip without voting, if LegacySkip config option is enabled.
ja_jp: LegacySkip config オプションが有効になっている場合、ユーザーは投票せずにスキップできます。
ru_ru: Разрешить пользователям пропускать без голосования, если включена опция LegacySkip.

source: Allows the user to skip a looped song.
ja_jp: ループ曲をスキップすることをユーザーに許可します。
ru_ru: Позволяет пользователю пропустить циклическую песню.

source: Allows the user to remove any song from the queue. Does not remove or skip currently playing songs.
ja_jp: ユーザーがキューから任意の曲を削除することを許可します。 現在再生中の曲を削除またはスキップしません。

source: Skip songs added by users who are not in voice when their song is played.
ja_jp: 曲が再生されたときに音声に入っていないユーザーが追加した曲をスキップします。
ru_ru: Пропускать песни, добавленные пользователями, которые не являются голосовыми при воспроизведении их песни.

source: Allows the user to add songs to the queue when Karaoke Mode is enabled.
ja_jp: カラオケモードが有効な場合、ユーザーがキューに曲を追加できるようにします。
ru_ru: Позволяет пользователю добавлять песни в очередь, когда включен режим Караоке.

source: Auto summon to user voice channel when using play commands, if bot isn't in voice already. The summon command must still be allowed for this group!
ja_jp: Botがすでに音声に入っていない場合、再生コマンドを使用して音声チャンネルをユーザーに自動的に召喚します。 このグループの召喚コマンドはまだ許可されていなければなりません！
ru_ru: Автоматический вызов голосового канала пользователя при использовании команд воспроизведения, если бот уже не в голосе. Команда вызова все еще должна быть разрешена для этой группы!

source: You do not have permission to play the requested media. The yt-dlp extractor `%(extractor)s` is not permitted in your group.
ja_jp: リクエストされたメディアを再生する権限がありません。 yt-dlp extractor `%(extractor)s` はあなたのグループでは許可されていません。

source: Could not extract information
ja_jp: 情報を抽出できませんでした
ru_ru: Не удалось извлечь информацию

source: This is a playlist.
ja_jp: これはプレイリストです。
ru_ru: Это плейлист.

source: Invalid content type `%(type)s` for URL: %(url)s
ja_jp: 無効なコンテンツタイプ`%(type)s`の URL: %(url)s
ru_ru: Недопустимый тип содержимого `%(type)s` для URL: %(url)s

source: no duration data
ja_jp: 持続時間データがありません
ru_ru: нет длительности данных

source: no duration data in current entry
ja_jp: 現在のエントリに期間データがありません
ru_ru: нет данных о продолжительности в текущей записи

source: Invalid track_data, must be of type `track` got `%(type)s`
ja_jp: track_dataが無効です。%(type)s `が得られた`track`型でなければなりません。
ru_ru: Недопустимые track_data, должны быть типа `track` получен `%(type)s`

source: Response status is not OK: [%(status)s] %(reason)s
ja_jp: 応答ステータスが正しくありません: [%(status)s] %(reason)s
ru_ru: Нет статуса ответа: [%(status)s] %(reason)s

source: Response JSON did not decode to a dict!
ja_jp: Response JSON decode to a dict!
ru_ru: Ответ JSON не декодировал немного!

source: Could not make GET to URL: %(url)s Reason: %(raw_error)s
ja_jp: URLにGETできませんでした: %(url)s 理由: %(raw_error)s
ru_ru: Не удалось сделать GET по URL: %(url)s Причина: %(raw_error)s

source: Could not make POST to URL: %(url)s Reason: %(raw_error)s
ja_jp: URLへのPOSTを作成できませんでした: %(url)s 理由: %(raw_error)s
ru_ru: Не удалось сделать POST по URL: %(url)s Причина: %(raw_error)s

source: Failed to get a guest token from Spotify, please try specifying client ID and client secret
ja_jp: Spotifyからゲスト トークンを取得できませんでした。クライアント IDとクライアント シークレットを指定してみてください
ru_ru: Не удалось получить токен гостя из Spotify, попробуйте указать ID клиента и секретный ключ клиента

source: API response did not contain the expected data. Missing key: %(raw_error)s
ja_jp: API応答に期待されるデータが含まれていませんでした。欠落キー: %(raw_error)s
ru_ru: Ответ API не содержит ожидаемых данных. Отсутствует ключ: %(raw_error)s

source: API response contained unexpected data. %(raw_error)s
ja_jp: API応答に予期しないデータが含まれていました。 %(raw_error)s
ru_ru: Ответ API содержит неожиданные данные. %(raw_error)s

source: Requested a token from Spotify, did not end up getting one
ja_jp: Spotifyからトークンをリクエストしました。トークンを取得できませんでした
ru_ru: Запрашиваемый токен из Spotify, не получается

source: API response status is not OK: [%(status)s] %(reason)s
ja_jp: API レスポンスの状態が正しくありません: [%(status)s] %(reason)s
ru_ru: Неправильный статус ответа от API: [%(status)s] %(reason)s

source: Only the owner can use this command.
ja_jp: このコマンドを使用できるのはオーナーのみです。
ru_ru: Только владелец может использовать эту команду.

source: Only dev users can use this command.
ja_jp: このコマンドは開発者のみが使用できます。
ru_ru: Только пользователи dev могут использовать эту команду.

source: Now playing automatically added entry `%(title)s` in %(channel)s!
ru_ru: Теперь проигрыватель автоматически добавил запись `%(title)s` в %(channel)s!

source: Failed Discord API Login! Problem: MusicBot could not log into Discord API. Your Token may be incorrect or there may be an API outage. Solution: Make sure you have the correct Token set in your config. Check API status at the official site: discordstatus.com
ru_ru: Ошибка входа в Discord API! Проблема: MusicBot не смог войти в Discord API. Ваш токен может быть неправильным или может возникнуть ошибка API. Решение: Убедитесь, что в конфигурации установлен правильный токен. Проверка статуса API на официальном сайте: discordstatus.com

source: The requested song `%(subject)s` is blocked by the song block list.
ru_ru: Запрошенная песня `%(subject)s` заблокирована списком блоков песен.

source: `%(alias)s` alias of `%(command)s %(args)s`
ru_ru: ` Алиас%(alias)s`%(command)s %(args)s`

source: The list above shows only commands permitted for your use. For a list of all commands, run: %(example_all)s
ru_ru: Вышеприведенный список показывает только команды, разрешенные для вашего использования. Для списка всех команд, запустите: %(example_all)s

source: Manage a block list applied to song requests and extracted song data. A subject may be a song URL or a word or phrase found in the track title. If subject is omitted, any currently playing track URL will be added instead. The song block list matches loosely, but is case-sensitive. This means adding 'Pie' will match 'cherry Pie' but not 'piecrust' in checks.
ru_ru: Управление списком блоков, применяемым к запросам треков и данным извлеченных треков. Темой может быть URL-адрес песни или слово или фраза в названии трека. Если тема опущена, вместо нее будет добавлен любой URL-адрес трека. Список блоков песни совсем не совпадает, но чувствителен к регистру. Это означает, что добавление 'Pie' будет совпадать с 'вишневым пирогом', но не 'piecrust' в проверках.

source: Add a song to be played in the queue. If no song is playing or paused, playback will be started. You may supply a URL to a video or audio file or the URL of a service supported by yt-dlp. Playlist links will be extracted into multiple links and added to the queue. If you enter a non-URL, the input will be used as search criteria on YouTube and the first result played. MusicBot also supports Spotify URIs and URLs, but audio is fetched from YouTube regardless.
ru_ru: Добавьте песню для воспроизведения в очереди. Если песня не воспроизводится или приостановлена, будет запущено воспроизведение. Вы можете предоставить URL-адрес для видео или аудио файла или URL-адреса сервиса, поддерживаемого yt-dlp. Ссылки на плейлист будут извлечены из нескольких ссылок и добавлены в очередь. Если вы введете не-URL, ввод будет использоваться в качестве критериев поиска на YouTube и первый результат воспроизведен. MusicBot также поддерживает Spotify URIs и URL, но звук загружается с YouTube regardless.

source: Restarts the current song at the given time. If time starts with + or - seek will be relative to current playback time. Time should be given in seconds, fractional seconds are accepted. Due to codec specifics in ffmpeg, this may not be accurate.
ru_ru: Перезапускает текущую песню в заданное время. Если время начинается с + или - поиск будет относительно текущего времени воспроизведения. Время должно быть указано в секундах, дробные секунды принимаются. Из-за специфики кодеков в ffmpeg это может быть неточным.

source: Seeking is not supported for streams.
ru_ru: Поиск не поддерживается для потоков.

source: Add a media URL to the queue as a Stream. The URL may be actual streaming media, like Twitch, Youtube, or a shoutcast like service. You can also use non-streamed media to play it without downloading it. Note: FFmpeg may drop the stream randomly or if connection hiccups happen.
ru_ru: Добавить медиа URL в очередь как поток. URL может быть реальными потоковыми медиа, такими как Twitch, Youtube, или такой сервис. Вы также можете использовать непотоковый носитель для воспроизведения без его загрузки. Примечание: FFmpeg может случайным образом отбрасывать поток или если произойдет ошибка подключения.
