Repository: MuXodious/MusicBot
Catalog: i18n/*/LC_MESSAGES/musicbot_logs.po
Languages: fr_fr

source: The permission `%(option)s` is not available.
fr_fr: La permission `%(option)s` n'est pas disponible.

source: Cannot add group `%(group)s` it already exists.
fr_fr: Impossible d'ajouter le groupe `%(group)s` il existe déjà.

source: Cannot remove built-in group.
fr_fr: Impossible de supprimer le groupe intégré.

source: The owner group is not editable.
fr_fr: Le groupe propriétaire n'est pas modifiable.

source: Failed to save the group: `%(group)s`
fr_fr: Impossible d'enregistrer le groupe: `%(group)s`

source: Doing set on %(option)s with value: %(value)s
fr_fr: Faire sur %(option)s avec la valeur : %(value)s

source: Permission `%(option)s` was not updated!
fr_fr: Permission `%(option)s` n'a pas été mise à jour !

source: Failed to change username. Did you change names too many times? Remember name changes are limited to twice per hour.
fr_fr: Impossible de changer le nom d'utilisateur. Avez-vous changé de nom trop de fois ? Rappelez-vous que les changements de nom sont limités à deux fois par heure.

source: Failed to change username due to error: %(raw_error)s
fr_fr: Impossible de modifier le nom d'utilisateur en raison d'une erreur : %(raw_error)s

source: Unable to change nickname: no permission.
fr_fr: Impossible de changer le pseudo : pas de permission.

source: Failed to set nickname due to error: %(raw_error)s
fr_fr: Impossible de définir le pseudo en raison d'une erreur : %(raw_error)s

source: Custom emoji must be from this server to use as a prefix.
fr_fr: Les émojis personnalisés doivent provenir de ce serveur pour être utilisés comme préfixes.

source: Prefix per server is not enabled! Use the config command to update the prefix instead.
fr_fr: Le préfixe par serveur n'est pas activé ! Utilisez la commande de configuration pour mettre à jour le préfixe à la place.

source: This command can only be used in guilds.
fr_fr: Cette commande ne peut être utilisée que dans les guildes.

source: Invalid sub-command given. Use the help command for more information.
fr_fr: Sous-commande invalide. Utilisez la commande d'aide pour plus d'informations.

source: Cannot set language to `%(locale)s` it is not available.
fr_fr: Impossible de définir la langue à `%(locale)s` il n'est pas disponible.

source: You must provide a URL or attach a file.
fr_fr: Vous devez fournir une URL ou joindre un fichier.

source: Unable to change avatar due to error: %(raw_error)s
fr_fr: Impossible de changer d'avatar en raison d'une erreur : %(raw_error)s

source: MusicBot found a %s with no guild! This could be a problem.
fr_fr: MusicBot a trouvé une %s sans guilde! Cela pourrait être un problème.

source: Not currently connected to server `%(guild)s`
fr_fr: Pas actuellement connecté au serveur `%(guild)s`

source: Invalid option given, use one of: soft, full, upgrade, uppip, or upgit
fr_fr: Option non valide, utilisez une de : soft, full, upgrade, uppip ou upgit

source: You must provide an ID or name.
fr_fr: Vous devez fournir un ID ou un nom.

source: No guild was found with the ID or name `%(input)s`
fr_fr: Aucune guilde n'a été trouvée avec l'ID ou le nom `%(input)s`

source: Activating debug breakpoint ID: %(uuid)s
fr_fr: Activation de l'ID du point d'arrêt de débogage : %(uuid)s

source: Could not import `objgraph`, is it installed?
fr_fr: Impossible d'importer `objgraph`, est-il installé ?

source: Debug code ran with eval().
fr_fr: Le code de débogage a été exécuté avec eval().

source: Debug code ran with exec().
fr_fr: Le code de débogage a été exécuté avec exec().

source: Debug code failed to execute.
fr_fr: L'exécution du code de débogage a échoué.

source: Failed to execute debug code: %(py_code)s Exception: ``` %(ex_name)s: %(ex_text)s```
fr_fr: Impossible d'exécuter le code de débogage : %(py_code)s Exception : ``` %(ex_name)s: %(ex_text)s```

source: Sub-command must be one of: %(options)s
fr_fr: La sous-commande doit être une des : %(options)s

source: Could not locate git executable.
fr_fr: Impossible de localiser l'exécutable git.

source: Failed while checking for updates via git command.
fr_fr: Échec de la vérification des mises à jour via la commande git.

source: Package missing meta in pip report.
fr_fr: Méta manquante dans le rapport pip.

source: Failed to get pip update status due to some error.
fr_fr: Impossible d'obtenir le statut de mise à jour de pip en raison d'une erreur.

source: Got a strange voice client entry.
fr_fr: Vous avez reçu une étrange entrée du client vocal.

source: Cookies already enabled.
fr_fr: Cookies déjà activés.

source: Cookies must be uploaded to be enabled. (Missing cookies file.)
fr_fr: Les cookies doivent être téléchargés pour être activés. (Fichier de cookies)

source: Could not enable cookies due to error: %(raw_error)s
fr_fr: Impossible d'activer les cookies en raison d'une erreur : %(raw_error)s

source: Could not rename cookies file due to error: %(raw_error)s Cookies temporarily disabled and will be re-enabled on next restart.
fr_fr: Impossible de renommer le fichier des cookies en raison d'une erreur : %(raw_error)s Cookies temporairement désactivés et seront réactivés au prochain redémarrage.

source: No attached uploads were found, try again while uploading a cookie file.
fr_fr: Aucun téléchargement en pièce jointe n'a été trouvé, essayez à nouveau en téléchargeant un fichier de cookies.

source: Could not remove old, disabled cookies file: %(raw_error)s
fr_fr: Impossible de supprimer le fichier ancien, les cookies désactivés : %(raw_error)s

source: Error downloading the cookies file from discord: %(raw_error)s
fr_fr: Erreur lors du téléchargement du fichier des cookies depuis le discord: %(raw_error)s

source: Could not save cookies to disk: %(raw_error)s
fr_fr: Impossible d'enregistrer les cookies sur le disque : %(raw_error)s

source: Got a message with no channel, somehow: %s
fr_fr: A reçu un message sans canal, d'une manière ou d'une autre : %s

source: Ignoring command from myself (%s)
fr_fr: Commande ignorée de moi-même (%s)

source: Ignoring command from other bot (%s)
fr_fr: Commande ignorée par un autre bot (%s)

source: Ignoring command from channel of type: %s
fr_fr: Commande ignorée du canal de type : %s

source: User in block list: %(id)s/%(name)s tried command: %(command)s
fr_fr: Utilisateur dans la liste de blocage : %(id)s/%(name)s a essayé la commande : %(command)s

source: Message from %(id)s/%(name)s: %(message)s
fr_fr: Message de %(id)s/%(name)s: %(message)s

source: This command is not allowed for your permissions group: %(group)s
fr_fr: Cette commande n'est pas autorisée pour votre groupe de permissions : %(group)s

source: This command requires you to be in a Voice channel.
fr_fr: Cette commande nécessite d'être dans un canal vocal.

source: Invalid command usage, missing values for params: %(params)r
fr_fr: Utilisation de la commande invalide, valeurs manquantes pour les paramètres : %(params)r

source: Error in %(command)s: %(err_name)s: %(err_text)s
fr_fr: Erreur dans %(command)s: %(err_name)s: %(err_text)s

source: Exception while handling command: %(command)s
fr_fr: Exception lors de la gestion de la commande : %(command)s

source: Cannot generate help for missing command: %s
fr_fr: Impossible de générer de l'aide pour la commande manquante : %s

source: Missing help data for command: %s
fr_fr: Il manque des données d'aide pour la commande : %s

source: Leaving voice channel %s in %s due to inactivity.
fr_fr: Quitter le canal vocal %s en %s en raison de l'inactivité.

source: MusicBot has become connected.
fr_fr: MusicBot est devenu connecté.

source: MusicBot has become disconnected.
fr_fr: MusicBot est déconnecté.

source: Got a Socket Event: %s
fr_fr: A eu un événement de socket: %s

source: VoiceState updated before on_ready finished
fr_fr: VoiceState mis à jour avant que le_ready ne soit terminé

source: Ignoring %s in %s as it is a bound voice channel.
fr_fr: %s ignoré dans %s car il s'agit d'un salon vocal lié.

source: %s has been detected as empty. Handling timeouts.
fr_fr: %s a été détecté comme vide. Délai de manutention expiré.

source: A user joined %s, cancelling timer.
fr_fr: Un utilisateur a rejoint %s, annulation du délai.

source: The bot got moved and the voice channel %s is empty. Handling timeouts.
fr_fr: Le bot a été déplacé et le canal vocal %s est vide. Délai de manutention.

source: The bot got moved and the voice channel %s is not empty.
fr_fr: Le bot a été déplacé et le canal vocal %s n'est pas vide.

source: No longer following user %s
fr_fr: Plus utilisateur suivant %s

source: Following user `%(user)s` to channel: %(channel)s
fr_fr: Utilisateur suivant `%(user)s` pour le salon : %(channel)s

source: VoiceState disconnect before.channel is None.
fr_fr: VoiceState déconnexion before.channel est Aucune.

source: Disconnected from voice by Discord API in: %(guild)s/%(channel)s (Code: %(code)s) [S:%(state)s]
fr_fr: Déconnecté de la voix par l'API Discord dans: %(guild)s/%(channel)s (Code : %(code)s) [S:%(state)s]

source: Cannot use auto-join channel with type: %(type)s in guild: %(guild)s
fr_fr: Impossible d'utiliser le canal de connexion automatique avec le type : %(type)s dans la guilde : %(guild)s

source: Cannot find the auto-joined channel, was it deleted? Guild: %s
fr_fr: Impossible de trouver le canal auto-joint, a-t-il été supprimé? Guilde: %s

source: Reconnecting to auto-joined guild on channel: %s
fr_fr: Reconnexion à la guilde automatiquement rejoint sur le canal : %s

source: Cannot auto join channel: %s
fr_fr: Impossible de rejoindre automatiquement le canal : %s

source: Bot has been added to guild: %s
fr_fr: Le bot a été ajouté à la guilde : %s

source: Left guild '%s' due to bot owner not found.
fr_fr: A quitté la guilde '%s' en raison du propriétaire du bot introuvable.

source: Creating data folder for guild %s
fr_fr: Création du dossier de données pour la guilde %s

source: Bot has been removed from guild: %s
fr_fr: Le bot a été retiré de la guilde : %s

source: Updated guild list:
fr_fr: Liste de guilde mise à jour :

source: Guild "%s" has become available.
fr_fr: La guilde «%s» est devenue disponible.

source: Resuming player in "%s" due to availability.
fr_fr: Reprise du joueur dans «%s» en raison de la disponibilité.

source: Guild "%s" has become unavailable.
fr_fr: La guilde «%s» est devenue indisponible.

source: Pausing player in "%s" due to unavailability.
fr_fr: Pauser le joueur dans «%s» en raison de l'indisponibilité.

source: Guild update for: %s
fr_fr: Mise à jour de guilde pour : %s

source: Guild attribute %(attr)s is now: %(new)s -- Was: %(old)s
fr_fr: L'attribut de guilde %(attr)s est maintenant : %(new)s -- Était: %(old)s

source: Channel update for: %(channel)s -- %(changes)s
fr_fr: Mise à jour du canal pour: %(channel)s -- %(changes)s

source: Creating %s
fr_fr: Création de %s

source: Loading config from: %s
fr_fr: Chargement de la configuration depuis : %s

source: Error while reading config. Problem: One or more required config option sections are missing. The missing sections are: %(sections)s Solution: Repair your config options file. Each [Section] must appear only once, with no other text on the same line. Each section must have at least one option. Use the example options as a template or copy it from the repository.
fr_fr: Erreur lors de la lecture de la configuration. Problème : Une ou plusieurs sections d'options de configuration requises sont manquantes. Les sections manquantes sont : %(sections)s Solution : Réparez votre fichier d'options de configuration. Chaque [Section] ne doit apparaître qu'une seule fois, sans autre texte sur la même ligne. Chaque section doit avoir au moins une option. Utilisez les options d'exemple comme modèle ou copiez-les à partir du référentiel.

source: Cannot store more than %s log files. Option LogsMaxKept will be limited instead.
fr_fr: Impossible de stocker plus de fichiers journaux %s . L'option LogsMaxKept sera limitée à la place.

source: Config option LogsDateFormat is empty and this will break log file rotation. Using default instead.
fr_fr: L'option de configuration LogsDateFormat est vide et cela cassera la rotation des fichiers journaux. Utiliser par défaut à la place.

source: Error while validating config options. Problem: Config option AudioCachePath is not a directory. Solution: Make sure the path you configured is a path to a folder / directory.
fr_fr: Erreur lors de la validation des options de configuration. Problème : option de configuration AudioCachePath n'est pas un répertoire. Solution : Assurez-vous que le chemin que vous avez configuré est un chemin vers un dossier / répertoire.

source: An exception was thrown while validating AudioCachePath.
fr_fr: Une exception a été levée lors de la validation de AudioCachePath.

source: Error while validating config options. Problem: AudioCachePath config option could not be set due to an error: %(raw_error)s Solution: Double check the setting is a valid, accessible directory path.
fr_fr: Erreur lors de la validation des options de configuration. Problčme : L'option de configuration AudioCachePath n'a pas pu ętre définie ŕ cause d'une erreur : %(raw_error)s Solution : Double vérifier que la configuration est valide, chemin d'accès au répertoire.

source: Audio Cache will be stored in: %s
fr_fr: Le cache audio sera stocké dans : %s

source: Error while reading config options. Problem: No bot Token was specified in the config options or environment. Solution: Set the Token config option or set environment variable %(env_var)s with an App token.
fr_fr: Erreur lors de la lecture des options de configuration. Problème : Aucun jeton de bot n'a été spécifié dans les options ou l'environnement de configuration. Solution : Définissez l'option de configuration du jeton ou définissez la variable d'environnement %(env_var)s avec un jeton d'application.

source: StatusMessage config option is too long, it will be limited to 128 characters.
fr_fr: L'option de configuration StatusMessage est trop longue, elle sera limitée à 128 caractères.

source: The default playback speed must be between 0.5 and 100.0. The option value of %.3f will be limited instead.
fr_fr: La vitesse de lecture par défaut doit être comprise entre 0.5 et 100.0. La valeur d'option %.3f sera limitée à la place.

source: Validating options with service data...
fr_fr: Validation des options avec les données du service...

source: Acquired owner ID via API
fr_fr: ID de propriétaire acquis via l'API

source: Error while fetching 'OwnerID' automatically. Problem: Discord App info is not available. This could be a temporary API outage or a bug. Solution: Manually set the 'OwnerID' config option or try again later.
fr_fr: Erreur lors de la récupération automatique de « OwnerID ». Problème : Les informations de l'application Discord ne sont pas disponibles. Il peut s'agir d'une panne temporaire de l'API ou d'un bug. Solution : Définissez manuellement l'option de configuration « OwnerID » ou réessayez plus tard.

source: MusicBot does not have a user instance, cannot proceed.
fr_fr: MusicBot n'a pas d'instance d'utilisateur, impossible de continuer.

source: Error validating config options. Problem: The 'OwnerID' config is the same as your Bot / App ID. Solution: Do not use the Bot or App ID in the 'OwnerID' field.
fr_fr: Erreur lors de la validation des options de configuration. Problème: La configuration 'OwnerID' est la même que votre Bot / App ID. Solution : N'utilisez pas le Bot ou l'ID de l'application dans le champ 'OwnerID'.

source: Config options file not found. Checking for alternatives...
fr_fr: Fichier d'options de configuration introuvable. Vérification des alternatives...

source: Renaming %(ini_file)s to %(option_file)s, you should probably turn file extensions on.
fr_fr: Renommer %(ini_file)s en %(option_file)s, vous devriez probablement activer les extensions de fichiers.

source: Copying existing example options file: %(example_file)s
fr_fr: Copie du fichier d'options d'exemple existant : %(example_file)s

source: Something went wrong while trying to find a config option file.
fr_fr: Une erreur s'est produite lors de la recherche d'un fichier d'options de configuration.

source: Error locating config. Problem: Could not find or create a config file due to an error: %(raw_error)s Solution: Verify the config folder and files exist and can be read by MusicBot.
fr_fr: Erreur lors de la localisation de la configuration. Problème : Impossible de trouver ou de créer un fichier de configuration en raison d'une erreur : %(raw_error)s Solution : Vérifiez que le dossier de configuration et les fichiers existent et peuvent être lus par MusicBot.

source: Error loading config. Problem: MusicBot could not read config file due to an error: %(raw_error)s Solution: Make sure the file is accessible and error free. Copy the example file from the repo if all else fails.
fr_fr: Erreur lors du chargement de la configuration. Problčme : MusicBot n'a pas pu lire le fichier de configuration en raison d'une erreur : %(raw_error)s Solution : Assurez-vous que le fichier est accessible et sans erreur. Copiez le fichier d'exemple du dépôt si tout le reste échoue.

source: Dev Bug! Config option has getter that is not available.
fr_fr: L'option Dev Bug ! L'option de configuration a getter qui n'est pas disponible.

source: Dev Bug! Config option has invalid type, getter and default must be the same type.
fr_fr: Bug Dev ! L'option de configuration a un type non valide, getter et default doit être le même type.

source: Option was missing previously.
fr_fr: L'option était manquante précédemment.

source: Config section not in parsed config! Missing: %s
fr_fr: La section de configuration n'est pas dans la configuration analysée ! Manquant : %s

source: Saved config option: %(config)s = %(value)s
fr_fr: Option de configuration enregistrée : %(config)s = %(value)s

source: Failed to save config: %s
fr_fr: Impossible d'enregistrer la configuration : %s

source: Option names are not unique between INI sections! Resolver is disabled.
fr_fr: Les noms d'options ne sont pas uniques entre les sections INI ! Le résolveur est désactivé.

source: Failed to save default INI file at: %s
fr_fr: Impossible d'enregistrer le fichier INI par défaut à: %s

source: Error loading config value. Problem: The owner ID in [%(section)s] > %(option)s is not valid. Solution: Set %(option)s to a numerical ID or set it to `auto` or `0` for automatic owner binding.
fr_fr: Erreur lors du chargement de la valeur de la configuration. Problème : L'ID du propriétaire dans [%(section)s] > %(option)s n'est pas valide. Solution : Définissez %(option)s sur un ID numérique ou mettez-le à `auto` ou `0` pour relier automatiquement le propriétaire.

source: Error loading config value. Problem: The config option [%(section)s] > %(option)s is not a valid file location. Solution: Check the path setting and make sure the file exists and is accessible to MusicBot.
fr_fr: Erreur lors du chargement de la valeur de la configuration. Problème : L'option de configuration [%(section)s] > %(option)s n'est pas un emplacement de fichier valide. Solution : Vérifiez le paramétrage du chemin et assurez-vous que le fichier existe et est accessible à MusicBot.

source: Error loading config value. Problem: One of the IDs in option [%(section)s] > %(option)s is invalid. Solution: Ensure all IDs are numerical, and separated only by spaces or commas.
fr_fr: Erreur lors du chargement de la valeur de la configuration. Problème : Un des identifiants dans l'option [%(section)s] > %(option)s est invalide. Solution : S'assurer que tous les identifiants sont numériques, et séparés uniquement par des espaces ou des virgules.

source: Invalid DebugLevel option "%(value)s" given, falling back to level: %(fallback)s
fr_fr: L'option «%(value)s» du DebugLevel n'est pas valide, elle revient au niveau: %(fallback)s

source: Option [%(section)s] > %(option)s has invalid config value '%(value)s' using default instead.
fr_fr: L'option [%(section)s] > %(option)s a une valeur de configuration invalide '%(value)s' en utilisant la valeur par défaut.

source: Option [%(section)s] > %(option)s has a value greater than 100 %% (%(value)s) and will be set to %(fallback)s instead.
fr_fr: L'option [%(section)s] > %(option)s a une valeur supérieure à 100 %% (%(value)s) et sera définie à %(fallback)s à la place.

source: Renaming INI file entry [%(old_s)s] > %(old_o)s to [%(new_s)s] > %(new_o)s
fr_fr: Renommer l'entrée du fichier INI [%(old_s)s] > %(old_o)s en [%(new_s)s] > %(new_o)s

source: Upgrading config file with renamed options...
fr_fr: Mise à jour du fichier de configuration avec les options renommées...

source: Failed to upgrade config. You'll need to upgrade it manually.
fr_fr: Échec de la mise à jour de la configuration. Vous devrez la mettre à jour manuellement.

source: Block list file not found: %s
fr_fr: Fichier de liste de blocage non trouvé : %s

source: Could not load block list from file: %s
fr_fr: Impossible de charger la liste de blocage du fichier : %s

source: Could not update the block list file: %s
fr_fr: Impossible de mettre à jour le fichier de la liste de blocage : %s

source: Loaded User Block list with %s entries.
fr_fr: Liste de blocage des utilisateurs chargée avec les entrées %s.

source: We found a legacy blacklist file, it will be renamed to: %s
fr_fr: Nous avons trouvé un fichier de liste noire hérité, il sera renommé en : %s

source: Loaded a Song Block list with %s entries.
fr_fr: Une liste de blocs de chansons avec des entrées %s a été chargée.

source: Cannot load data for guild with ID 0. This is likely a bug in the code!
fr_fr: Impossible de charger les données de la guilde avec l'ID 0. C'est probablement un bug dans le code!

source: No file for guild %(id)s/%(name)s
fr_fr: Aucun fichier pour la guilde %(id)s/%(name)s

source: Loading guild data for guild with ID: %(id)s/%(name)s
fr_fr: Chargement des données de guilde pour la guilde avec ID: %(id)s/%(name)s

source: An OS error prevented reading guild data file: %s
fr_fr: Une erreur du système d'exploitation a empêché la lecture du fichier de données de guilde : %s

source: Guild %(id)s/%(name)s has custom command prefix: %(prefix)s
fr_fr: La guilde %(id)s/%(name)s a un préfixe de commande personnalisé : %(prefix)s

source: Cannot save data for guild with ID 0. This is likely a bug in the code!
fr_fr: Impossible d'enregistrer des données pour la guilde avec l'ID 0. C'est probablement un bug dans le code!

source: Could not save guild specific data due to OS Error.
fr_fr: Impossible d'enregistrer les données spécifiques à la guilde en raison d'une erreur d'exploitation.

source: Failed to serialize guild specific data due to invalid data.
fr_fr: Impossible de sérialiser les données spécifiques à la guilde en raison de données non valides.

source: Forcing YTDLP to use User Agent: %s
fr_fr: Forcer YTDLP à utiliser l'agent utilisateur : %s

source: MusicBot will use cookies for yt-dlp from: %s
fr_fr: MusicBot utilisera des cookies pour yt-dlp depuis: %s

source: Yt-dlp will use your configured proxy server.
fr_fr: Yt-dlp utilisera votre serveur proxy configuré.

source: HEAD seems to have no headers...
fr_fr: HEAD ne semble pas avoir d'en-têtes...

source: Checking media headers failed due to timeout.
fr_fr: La vérification des en-têtes des médias a échoué en raison du délai d'expiration.

source: Failed HEAD request for: %s
fr_fr: Échec de la requête HEAD pour : %s

source: HEAD Request exception:
fr_fr: Exception de requête HEAD :

source: Sanitized YTDL Extraction Info (not JSON): %s
fr_fr: Infos d'extraction YTDL Sanitized (pas JSON) : %s

source: Sanitized YTDL Extraction Info (not JSON): %s
fr_fr: Infos d'extraction YTDL Sanitized (pas JSON) : %s
