Repository: MuXodious/MusicBot
Catalog: i18n/*/LC_MESSAGES/musicbot_logs.po
Languages: fr_fr

source: API response status is not OK: [%(status)s] %(reason)s
fr_fr: Le statut de réponse de l'API n'est pas correct : [%(status)s] %(reason)s

source: Failed to get Spotify Guest Token.
fr_fr: Impossible d'obtenir le jeton d'invité Spotify.

source: Failed to get Guest Token due to: %(raw_error)s
fr_fr: Impossible d'obtenir le jeton d'invité en raison de: %(raw_error)s

source: Only the owner can use this command.
fr_fr: Seul le propriétaire peut utiliser cette commande.

source: Only dev users can use this command.
fr_fr: Seuls les utilisateurs de dev peuvent utiliser cette commande.

source: Cannot count members when voice_channel is None.
fr_fr: Impossible de compter les membres quand voice_channel est None.

source: Could not find git executable.
fr_fr: Impossible de trouver l'exécutable git.

source: Attempting to upgrade with `git pull` on current path.
fr_fr: Tentative de mise à jour avec `git pull` sur le chemin courant.

source: Result of git pull: %s
fr_fr: Résultat du tirage git : %s

source: Upgrade failed, you need to run `git pull` manually.
fr_fr: La mise à jour a échoué, vous devez exécuter `git pull` manuellement.

source: Cannot execute pip.
fr_fr: Impossible d'exécuter le pip.

source: Error using -m method
fr_fr: Erreur en utilisant la méthode -m

source: PIP failed while calling sub-process.
fr_fr: Le PIP a échoué lors de l'appel du sous-processus.

source: PIP failed due to Permission Error.
fr_fr: Le PIP a échoué en raison d'une erreur de permission.

source: PIP failed due to missing Python executable? (%s)
fr_fr: Le PIP a échoué en raison de l'exécutable Python manquant ? (%s)

source: PIP failed due to OSError.
fr_fr: Le PIP a échoué en raison d'une erreur d'OS.

source: Could not decode pip update report JSON.
fr_fr: Impossible de décoder le rapport de mise à jour de pip JSON.

source: Cannot locate or execute python -m pip
fr_fr: Impossible de localiser ou d'exécuter python -m pip

source: Attempting to upgrade with `%s` on current path...
fr_fr: Tentative de mise à jour avec `%s` sur le chemin courant...

source: Result of pip upgrade: %s
fr_fr: Résultat de l'amélioration de pip : %s

source: Result exit code from pip upgrade: %s
fr_fr: Résultat du code de sortie de la mise à jour de pip : %s

source: Upgrade failed to execute or we could not understand the output
fr_fr: La mise à jour n'a pas réussi à s'exécuter ou nous n'avons pas pu comprendre la sortie

source: You may need to run `%s` manually.
fr_fr: Vous devrez peut-être exécuter `%smanuellement.

source: Press enter to continue . . .
fr_fr: Appuyez sur Entrée pour continuer . . . .

source: Starting sanity checks
fr_fr: Démarrage des contrôles de santé

source: Required checks passed.
fr_fr: Les contrôles requis ont été effectués.

source: Skipped checking for updates.
fr_fr: Vérification des mises à jour ignorée.

source: Optional checks passed.
fr_fr: Vérifications optionnelles réussies.

source: Could not locate py.exe
fr_fr: Impossible de localiser py.exe

source: Python 3 found. Launching bot...
fr_fr: Python 3 trouvé. Lancement du bot...

source: Ensuring we're in the right environment
fr_fr: Veiller à ce que nous soyons dans le bon environnement

source: Failed environment check, %s
fr_fr: Échec de la vérification de l'environnement, %s

source: Detected FFmpeg is installed at: %s
fr_fr: FFmpeg détecté est installé à: %s

source: Adding local bins/ folder environment PATH for bundled ffmpeg...
fr_fr: Ajout du PATH d'environnement de bins/dossier local pour ffmpeg groupé...

source: MusicBot could not locate FFmpeg binary in your environment. Please install FFmpeg so it is available in your environment PATH variable.
fr_fr: MusicBot n'a pas pu localiser le binaire FFmpeg dans votre environnement. Veuillez installer FFmpeg pour qu'il soit disponible dans votre variable PATH d'environnement.

source: On Windows, you can add a pre-compiled EXE to the MusicBot `bin` folder, or you can install FFmpeg system-wide using WinGet or by running the install.bat file.
fr_fr: Sous Windows, vous pouvez ajouter une EXE pré-compilée au dossier `bin` de MusicBot, ou vous pouvez installer FFmpeg sur tout le système en utilisant WinGet ou en exécutant l'installation. dans le fichier.

source: On MacOS, you may be able to install FFmpeg via homebrew. Otherwise, check the official FFmpeg site for build or install steps.
fr_fr: Sur MacOS, vous pourriez être en mesure d'installer FFmpeg via homebrew. Sinon, vérifiez le site officiel FFmpeg pour les étapes de compilation ou d'installation.

source: On Linux, many distros make FFmpeg available via system package managers. Check for ffmpeg with your system package manager or build from sources.
fr_fr: Sous Linux, de nombreuses distributions rendent FFmpeg disponible via les gestionnaires de paquets du système. Vérifiez la présence de ffmpeg avec votre gestionnaire de paquets système ou construisez à partir des sources.

source: Less than %sMB of free space remains on this device
fr_fr: Il reste moins de %sMB d'espace libre sur cet appareil

source: Checking for updates to MusicBot or dependencies...
fr_fr: Vérification des mises à jour de MusicBot ou des dépendances...

source: No MusicBot updates available via `git` command.
fr_fr: Aucune mise à jour de MusicBot disponible via la commande `git`.

source: Could not check for updates using `git` commands. You should check manually.
fr_fr: Impossible de vérifier les mises à jour en utilisant les commandes `git`. Vous devriez vérifier manuellement.

source: The following packages can be updated:
fr_fr: Les paquets suivants peuvent être mis à jour :

source: %s to version: %s
fr_fr: %s à la version : %s

source: No dependency updates available via `pip` command.
fr_fr: Aucune mise à jour des dépendances disponible via la commande `pip`.

source: Could not check for updates using `pip` commands. You should check manually.
fr_fr: Impossible de vérifier les mises à jour en utilisant les commandes `pip`. Vous devriez vérifier manuellement.

source: You can run a guided update by using the command: %s ./update.py
fr_fr: Vous pouvez lancer une mise à jour guidée en utilisant la commande : %s ./update.py

source: Value is above the maximum limit.
fr_fr: La valeur est supérieure à la limite maximale.

source: Value must not be negative.
fr_fr: La valeur ne doit pas être négative.

source: Value for Max Logs Kept must be a number from 0 to %s
fr_fr: La valeur pour Max Logs Kept doit être un nombre de 0 à %s

source: Log level '%s' is not available.
fr_fr: Le niveau de log '%s' n'est pas disponible.

source: Log Level must be one of: %s
fr_fr: Le niveau de log doit être le : %s

source: Launch a music playing discord bot built using discord.py, youtubeDL, and ffmpeg.
fr_fr: Lancez un bot discord construit en utilisant discord.py, youtubeDL, et ffmpeg.

source: Available via Github:
fr_fr: Disponible via Github:

source: For more help and support with this bot, join our discord:
fr_fr: Pour plus d'aide et de support avec ce bot, rejoignez notre discord:

source: This software is provided under the MIT License.
fr_fr: Ce logiciel est fourni sous la licence MIT.

source: See the `LICENSE` text file for complete details.
fr_fr: Voir le fichier texte `LICENSE` pour plus de détails.

source: Override the default / system detected language for all text in MusicBot.
fr_fr: Remplacer la langue par défaut / système détectée pour tous les textes de MusicBot.

source: Use this language for all server-side log messages from MusicBot.
fr_fr: Utilisez cette langue pour tous les messages de log côté serveur de MusicBot.

source: Use this language for all messages sent to discord from MusicBot. This does not prevent per-guild language selection.
fr_fr: Utilisez cette langue pour tous les messages envoyés à la discorde de MusicBot. Cela n'empêche pas la sélection de langue par guilde.

source: Print the MusicBot version information and exit.
fr_fr: Imprimez les informations de version de MusicBot et quittez.

source: Skip all optional startup checks, including the update check.
fr_fr: Ignorer toutes les vérifications optionnelles de démarrage, y compris la vérification de mise à jour.

source: Skip only the disk space check at startup.
fr_fr: Ignorer seulement l'espace disque au démarrage.

source: Skip only the update check at startup.
fr_fr: Ignorer uniquement la vérification des mises à jour au démarrage.

source: Disable MusicBot from trying to install dependencies when it cannot import them.
fr_fr: Désactivez MusicBot d'essayer d'installer des dépendances quand il ne peut pas les importer.

source: Specify how many log files to keep, between 0 and %s inclusive. (Default: %s)
fr_fr: Spécifiez le nombre de fichiers journaux à conserver, compris entre 0 et %s inclusivement. (par défaut : %s)

source: Override the log level settings set in config. Must be one of: %s
fr_fr: Remplacer les paramètres de niveau de journal définis dans la configuration. Doit être l'un des : %s

source: Override the default date format used when rotating log files. This should contain values compatible with strftime(). (Default: '%s')
fr_fr: Remplacer le format de date par défaut utilisé lors de la rotation des fichiers journaux. Cela doit contenir des valeurs compatibles avec strftime(). (par défaut: '%s')

source: Opened a new MusicBot instance. This terminal can be safely closed!
fr_fr: Ouvert une nouvelle instance de MusicBot. Ce terminal peut être fermé en toute sécurité!

source: Loading MusicBot version: %s
fr_fr: Chargement de la version de MusicBot : %s

source: Log opened: %s
fr_fr: Journal ouvert : %s

source: Changing working directory to: %s
fr_fr: Changement du répertoire de travail en : %s

source: Cannot start the bot! You started `run.py` in the wrong directory and we could not locate `musicbot` and `.git` folders to verify a new directory location.
fr_fr: Impossible de démarrer le bot ! Vous avez démarré `run.py` dans le mauvais répertoire et nous n'avons pas pu localiser `musicbot` et `. it` dossiers pour vérifier un nouvel emplacement de répertoire.

source: For best results, start `run.py` from the same folder you cloned MusicBot into. If you did not use git to clone the repository, you are strongly urged to.
fr_fr: Pour de meilleurs résultats, lancez `run.py` depuis le même dossier dans lequel vous avez cloné MusicBot. Si vous n'avez pas utilisé git pour cloner le dépôt, il vous est fortement recommandé de le faire.

source: Certificate error is not a verification error, not trying certifi and exiting.
fr_fr: L'erreur de certificat n'est pas une erreur de vérification, n'essayant pas de certifi et quittant.

source: Here is the exact error, it could be a bug.
fr_fr: Voici l'erreur exacte, elle pourrait être un bug.

source: To easily add a certificate to Windows trust store, you can open the failing site in Microsoft Edge or IE...
fr_fr: Pour ajouter facilement un certificat au magasin de confiance Windows, vous pouvez ouvrir le site défaillant dans Microsoft Edge ou IE...

source: Could not get Issuer Certificate from default trust store, trying certifi instead.
fr_fr: Impossible d'obtenir le certificat d'émetteur à partir du magasin de confiance par défaut, en essayant de certifi à la place.

source: Syntax error (modification detected, did you edit the code?)
fr_fr: Erreur de syntaxe (modification détectée, avez-vous modifié le code?)

source: Syntax error (this is a bug, not your fault)
fr_fr: Erreur de syntaxe (c'est un bug, pas votre faute)

source: Cannot start MusicBot due to an error! Problem: There was an error importing MusicBot or a dependency package. Solution: You need to manually install pip packages for MusicBot or launch without `--no-install-deps` and MusicBot will try to install them for you.
fr_fr: Impossible de démarrer MusicBot à cause d'une erreur ! Problème: Une erreur s'est produite lors de l'importation de MusicBot ou d'un paquet de dépendances. Solution : Vous devez installer manuellement des paquets pip pour MusicBot ou lancer sans `--no-install-deps` et MusicBot essayera de les installer pour vous.

source: Attempting to install MusicBot dependency packages automatically...
fr_fr: Tentative d'installation automatique des paquets de dépendances MusicBot...

source: MusicBot dependencies may not be installed! Problem: The pip install process ended with a possible error. Some or all of the the dependencies may be missing. Solution: You must manually install dependency packages. Open a CMD prompt / terminal to the MusicBot directory. You can try using the update scripts install packages. Or try this manual command: %(py_bin)s -m pip install -U -r ./requirements.txt You can also ask for help in MusicBot's support discord: https://discord.gg/bots
fr_fr: Les dépendances MusicBot peuvent ne pas être installées ! Problème: Le processus d'installation de pip s'est terminé par une erreur possible. Une partie ou la totalité des dépendances peuvent être manquantes. Solution : Vous devez installer manuellement des paquets de dépendances. Ouvrez une invite CMD / terminal dans le répertoire MusicBot. Vous pouvez essayer d'utiliser les paquets d'installation de scripts de mise à jour. Ou essayez la commande manuelle %(py_bin)s -m pip install -U -r . requirements.txt Vous pouvez également demander de l'aide dans le discord-support de MusicBot: https://discord.gg/bots.

source: OK, lets hope installing dependencies worked!
fr_fr: OK, laissons espérer que l'installation des dépendances a fonctionné !

source: MusicBot got an ImportError after trying to install packages. MusicBot must exit...
fr_fr: MusicBot a obtenu une erreur d'importation après avoir essayé d'installer des paquets. MusicBot doit quitter...

source: The exception which caused the above error:
fr_fr: L'exception qui a causé l'erreur ci-dessus :

source: MusicBot is doing a soft restart...
fr_fr: MusicBot fait un redémarrage doux...

source: MusicBot is doing a full process restart...
fr_fr: MusicBot effectue un redémarrage complet du processus...

source: Error starting bot
fr_fr: Erreur lors du démarrage du bot

source: Closing event loop.
fr_fr: Fermeture de la boucle d'événements.

source: Restarting in %s seconds...
fr_fr: Redémarrage dans %s secondes...

source: All done.
fr_fr: Terminé.

source: OK, we're closing!
fr_fr: OK, nous sommes en train de fermer!
