Repository: MuXodious/MusicBot
Catalog: i18n/*/LC_MESSAGES/musicbot_logs.po
Languages: fr_fr

source: Song info extraction returned no data.
fr_fr: L'extraction des informations de la chanson n'a renvoyé aucune donnée.

source: Called extract_info with: '%(subject)s', %(args)s, %(kws)s
fr_fr: Extraction appelée avec : '%(subject)s', %(args)s, %(kws)s

source: Cannot run extraction, loop is closed. (This is normal on shutdowns.)
fr_fr: Impossible d'exécuter l'extraction, la boucle est fermée. (C'est normal lors des arrêts.)

source: Cannot continue extraction, event loop is closed.
fr_fr: Impossible de poursuivre l'extraction, la boucle d'événement est fermée.

source: Spotify URL is invalid or not supported.
fr_fr: L'URL Spotify n'est pas valide ou n'est pas prise en charge.

source: Download Error with stream URL
fr_fr: Erreur de téléchargement avec l'URL du flux

source: Assuming content is a direct stream
fr_fr: En supposant que le contenu est un flux direct

source: Cannot stream an invalid URL.
fr_fr: Impossible de diffuser une URL non valide.

source: Caught NoSupportingHandlers, trying again after replacing colon with space.
fr_fr: NoSupportingHandlers attrapés, en essayant à nouveau après avoir remplacé deux points par de l'espace.

source: Called safe_extract_info with: %(args)s, %(kws)s
fr_fr: Appelé safe_extract_info avec : %(args)s, %(kws)s

source: The local media file could not be found.
fr_fr: Le fichier média local est introuvable.

source: Missing __input_subject from YtdlpResponseDict
fr_fr: __input_subject manquant de YtdlpResponseDict

source: Entries is not a list in YtdlpResponseDict, set process=True to avoid this.
fr_fr: Les entrées ne sont pas une liste dans YtdlpResponseDict, set process=True pour éviter cela.

source: Warning, duration error for: %(url)s
fr_fr: Attention, erreur de durée pour : %(url)s

source: module 'pymediainfo' not found, will fall back to ffprobe.
fr_fr: module 'pymediainfo' non trouvé, va revenir à ffprobe.

source: Created future for %r
fr_fr: Futur créé pour %r

source: Completed futures for %(entry)r with %(callback)r
fr_fr: Termes terminés pour %(entry)r avec %(callback)r

source: Unhandled exception in _for_each_future callback.
fr_fr: Exception non gérée dans _for_each_future callback.

source: Starting asyncio subprocess (%(process)s) with command: %(run)s
fr_fr: Démarrage du sous-processus asyncio (%(process)s) avec la commande : %(run)s

source: Extraction did not provide a duration for this entry. MusicBot cannot estimate queue times until it is downloaded. Entry name: %s
fr_fr: L'extraction n'a pas fourni de durée pour cette entrée. MusicBot ne peut pas estimer les temps d'attente tant qu'il n'est pas téléchargé. Entrée : %s

source: Entry data is missing version number, cannot deserialize.
fr_fr: Le numéro de version de l'entrée est manquant, impossible de désérialiser.

source: Entry data has the wrong version number, cannot deserialize.
fr_fr: Les données de saisie ont le mauvais numéro de version, impossible de désérialiser.

source: Deserialized URLPlaylistEntry cannot find channel with ID: %s
fr_fr: L'URLPlaylistEntry désérialisé ne peut pas trouver de canal avec l'ID : %s

source: Deserialized URLPlaylistEntry has the wrong channel type: %s
fr_fr: L'URLPlaylistEntry désérialisé a le mauvais type de canal : %s

source: Deserialized URLPlaylistEntry cannot find author with ID: %s
fr_fr: L'URLPlaylistEntry désérialisé ne peut pas trouver l'auteur avec l'ID : %s

source: Deserialized URLPlaylistEntry has an author ID but no channel for lookup!
fr_fr: L'URLPlaylistEntry désérialisé a un ID d'auteur mais aucun canal de recherche !

source: Could not load %s
fr_fr: Impossible de charger %s

source: Cannot download Spotify links, processing error with type: %(type)s
fr_fr: Impossible de télécharger les liens Spotify, erreur de traitement avec le type : %(type)s

source: Getting ready for entry: %r
fr_fr: Préparation de l'entrée : %r

source: Download cached with different extension...
fr_fr: Téléchargement mis en cache avec une extension différente...

source: Local size different from remote size. Re-downloading...
fr_fr: La taille locale est différente de la taille de la télécommande. Re-téléchargement...

source: Download already cached at: %s
fr_fr: Téléchargement déjà mis en cache à: %s

source: MusicBot could not get duration data for this entry. Queue time estimation may be unavailable until this track is cleared. Entry file: %s
fr_fr: MusicBot n'a pas pu obtenir les données de durée pour cette entrée. L'estimation du temps d'attente peut être indisponible jusqu'à ce que cette piste soit effacée. Fichier d'entrée: %s

source: Got duration of %(time)s seconds for file: %(file)s
fr_fr: Durée de %(time)s secondes pour le fichier : %(file)s

source: There as a problem with working out EQ, likely caused by a strange installation of FFmpeg. This has not impacted the ability for the bot to work, but will mean your tracks will not be equalized.
fr_fr: Il y a un problème avec le fonctionnement de l'EQ, probablement causé par une installation étrange de FFmpeg. Cela n'a pas affecté la capacité du bot à travailler, mais cela signifie que vos pistes ne seront pas égalées.

source: Exception while checking entry data.
fr_fr: Exception lors de la vérification des données d'entrée.

source: Trying to get duration via pymediainfo for: %s
fr_fr: Essai d'obtenir la durée via pymediainfo pour: %s

source: Failed to get duration via pymediainfo.
fr_fr: Impossible d'obtenir la durée via pymediainfo.

source: Trying to get duration via ffprobe for: %s
fr_fr: Essai d'obtenir la durée via ffprobe pour: %s

source: Could not locate ffprobe in your path!
fr_fr: Impossible de localiser ffprobe dans votre chemin !

source: ffprobe returned something that could not be used.
fr_fr: ffprobe a renvoyé quelque chose qui n'a pas pu être utilisé.

source: ffprobe could not be executed for some reason.
fr_fr: ffprobe n'a pas pu être exécuté pour une raison quelconque.

source: Calculating mean volume of: %s
fr_fr: Calcul du volume moyen de : %s

source: Could not locate ffmpeg on your path!
fr_fr: Impossible de localiser ffmpeg sur votre chemin !

source: Could not parse 'I' in normalize json.
fr_fr: Impossible d'analyser 'I' dans normaliser json.

source: Could not parse 'LRA' in normalize json.
fr_fr: Impossible d'analyser 'LRA' en normalise json.

source: Could not parse 'TP' in normalize json.
fr_fr: Impossible d'analyser 'TP' dans normaliser json.

source: Could not parse 'thresh' in normalize json.
fr_fr: Impossible d'analyser 'thresh' dans normalise json.

source: Could not parse 'offset' in normalize json.
fr_fr: Impossible d'analyser 'offset' dans normalise json.

source: Download started: %r
fr_fr: Téléchargement démarré: %r

source: Download attempt %s of 3...
fr_fr: Tentative de téléchargement %s de 3...

source: Download incomplete, retrying in %(time).1f seconds. Reason: %(raw_error)s
fr_fr: Téléchargement incomplet, nouvel essai dans %(time).1f secondes. Raison : %(raw_error)s

source: Download failed, not retrying! Reason: %(raw_error)s
fr_fr: Le téléchargement a échoué, ne pas réessayer ! Raison : %(raw_error)s

source: Download did not complete due to an error: %(raw_error)s
fr_fr: Le téléchargement n'a pas été terminé en raison d'une erreur : %(raw_error)s

source: Download failed due to a yt-dlp error: %(raw_error)s
fr_fr: Le téléchargement a échoué à cause d'une erreur yt-dlp : %(raw_error)s

source: Extraction encountered an unhandled exception.
fr_fr: L'extraction a rencontré une exception non gérée.

source: Download failed due to an unhandled exception: %(raw_error)s
fr_fr: Le téléchargement a échoué en raison d'une exception non gérée : %(raw_error)s

source: Download failed: %r
fr_fr: Échec du téléchargement : %r

source: Failed to extract data for the requested media.
fr_fr: Impossible d'extraire les données pour les médias demandés.

source: Download complete: %r
fr_fr: Téléchargement terminé : %r

source: Deserialized StreamPlaylistEntry cannot find channel with ID: %s
fr_fr: StreamPlaylistEntry désérialisé ne peut pas trouver de canal avec l'ID : %s

source: Deserialized StreamPlaylistEntry has the wrong channel type: %s
fr_fr: StreamPlaylistEntry désérialisé a le mauvais type de canal : %s

source: Deserialized StreamPlaylistEntry cannot find author with ID: %s
fr_fr: StreamPlaylistEntry désérialisé ne peut pas trouver l'auteur avec l'ID : %s

source: Deserialized StreamPlaylistEntry has an author ID but no channel for lookup!
fr_fr: StreamPlaylistEntry désérialisé a un ID d'auteur mais aucun canal à rechercher !

source: Deserialized LocalFilePlaylistEntry cannot find channel with ID: %s
fr_fr: Le canal LocalFilePlaylistEntry désérialisé ne peut pas être trouvé avec l'ID : %s

source: Deserialized LocalFilePlaylistEntry has the wrong channel type: %s
fr_fr: LocalFilePlaylistEntry désérialisé a le mauvais type de canal : %s

source: Deserialized LocalFilePlaylistEntry cannot find author with ID: %s
fr_fr: LocalFilePlaylistEntry désérialisé ne peut pas trouver l'auteur avec l'ID : %s

source: Deserialized LocalFilePlaylistEntry has an author ID but no channel for lookup!
fr_fr: LocalFilePlaylistEntry désérialisé a un ID de l'auteur mais aucun canal de recherche !

source: Got duration of %(seconds)s seconds for file: %(file)s
fr_fr: Durée de %(seconds)s secondes pour le fichier : %(file)s

source: Failed to delete cache file: %s
fr_fr: Impossible de supprimer le fichier de cache : %s

source: Audio cache directory has been removed.
fr_fr: Le répertoire de cache audio a été supprimé.

source: Audio cache directory could not be removed or renamed.
fr_fr: Le répertoire de cache audio n'a pas pu être supprimé ou renommé.

source: Audio cache directory could not be removed.
fr_fr: Le répertoire de cache audio n'a pas pu être supprimé.

source: Audio cache has no limits set, nothing to delete.
fr_fr: Le cache audio n'a pas de limites définies, rien à supprimer.

source: Audio cache deleted %(number)s file(s), total of %(size)s removed.
fr_fr: Le cache audio a supprimé le(s) fichier(s) %(number)s (s), total de %(size)s supprimé(s).

source: Audio cached retained %(number)s file(s) from autoplaylist, total of %(size)s retained.
fr_fr: L'audio mis en cache a retenu le(s) fichier(s) %(number)s de la liste de lecture automatique, total de %(size)s retenu.

source: Audio cache is now %(size)s over %(number)s file(s).
fr_fr: Le cache audio est maintenant %(size)s sur %(number)s fichier(s).

source: Audio cache directory is missing, nothing to delete.
fr_fr: Le répertoire de cache audio est manquant, rien à supprimer.

source: Audio cache file is from autoplaylist but marked as busted, ignoring it.
fr_fr: Le fichier de cache audio provient de la liste de lecture automatique, mais marqué comme busé, l'ignorant.

source: Cache level requires cleanup. %s
fr_fr: Le niveau de cache nécessite un nettoyage. %s

source: Auto playlist has no cache map, moving on.
fr_fr: La liste de lecture automatique n'a pas de carte de cache.

source: Loaded auto playlist cache map with %s entries.
fr_fr: Carte de cache de la liste de lecture automatique chargée avec les entrées %s.

source: Failed to load auto playlist cache map.
fr_fr: Impossible de charger le cache de la liste de lecture automatique.

source: Saved auto playlist cache map with %s entries.
fr_fr: La carte du cache de la liste de lecture automatique avec les entrées %s a été enregistrée.

source: Failed to save auto playlist cache map.
fr_fr: Impossible d'enregistrer la carte du cache de la liste de lecture automatique.

source: Auto playlist cache map conflict on Key: %(file)s Old: %(old)s New: %(new)s
fr_fr: Conflit de la carte de la liste de lecture automatique sur Clef : %(file)s Ancien: %(old)s Nouveau: %(new)s

source: Lang Argument Error: %s
fr_fr: Erreur Argument de Langue : %s

source: Failed to load log translations for any of: [%s] in: %s
fr_fr: Impossible de charger les traductions du journal pour n'importe quelle de: [%s] dans: %s

source: Failed to load discord translations for any of: [%s] guild: %s in: %s
fr_fr: Impossible de charger les traductions de discord pour n'importe quelle de: [%s] guilde: %s dans: %s

source: Loading JSON file: %s
fr_fr: Chargement du fichier JSON : %s

source: Error parsing %s as JSON
fr_fr: Erreur lors de l'analyse de %s en JSON

source: Could not grab data from JSON key: %s
fr_fr: Impossible de récupérer les données de la clé JSON : %s

source: Skipping logger setup, already set up
fr_fr: Ignorer la configuration du logger, déjà configuré

source: Log level was previously set via override to: %s
fr_fr: Le niveau du journal a été précédemment défini en remplaçant à: %s

source: Changing log level to: %s
fr_fr: Changement du niveau du journal à : %s

source: MusicBot loggers have been called to shut down.
fr_fr: Les enregistreurs MusicBot ont été appelés à s'arrêter.

source: Permissions file not found, copying from: %s
fr_fr: Fichier de permissions introuvable, copie de: %s

source: Error copying example permissions file: %s
fr_fr: Erreur lors de la copie du fichier d'exemple des permissions : %s

source: Config 'OwnerID' is set auto, will set correctly later.
fr_fr: La configuration 'OwnerID' est réglée automatiquement, elle sera correctement configurée plus tard.

source: Validating permissions...
fr_fr: Validation des permissions...

source: Setting auto 'OwnerID' for owner permissions group.
fr_fr: Réglage auto 'OwnerID' pour le groupe de permissions propriétaires.

source: Updating group in permissions file: %s
fr_fr: Mise à jour du groupe dans le fichier des permissions : %s

source: Deleting group from permissions file: %s
fr_fr: Suppression du groupe du fichier des permissions : %s

source: Adding new group to permissions file: %s
fr_fr: Ajout d'un nouveau groupe au fichier des permissions : %s

source: Saving permissions file now.
fr_fr: Enregistrement du fichier des permissions maintenant.

source: ConfigUpdater could not parse the permissions file!
fr_fr: ConfigUpdater n'a pas pu analyser le fichier des permissions !

source: You have a duplicate section, fix your Permissions file!
fr_fr: Vous avez une section en double, corrigez votre fichier de permissions!

source: Failed to save permissions group: %s
fr_fr: Impossible d'enregistrer le groupe de permissions : %s

source: Dev Bug! Permission has getter that is not available.
fr_fr: Bug Dev ! Permission a un getter qui n'est pas disponible.

source: Dev Bug! Permission has invalid type, getter and default must be the same type.
fr_fr: Bug Dev ! La permission a un type non valide, getter et default doit être le même type.

source: Max search items can't be larger than 100. Setting to 100.
fr_fr: Le maximum d'éléments de recherche ne peut pas être supérieur à 100. Réglage à 100.

source: You do not have permission to play the requested media. The yt-dlp extractor `%(extractor)s` is not permitted in your group.
fr_fr: Vous n'avez pas la permission de lire le média demandé. L'extracteur yt-dlp `%(extractor)s` n'est pas autorisé dans votre groupe.

source: Cleanup got called on the audio source: %r
fr_fr: Nettoyage appelé à la source audio : %r

source: MusicPlayer.skip() is called: %s
fr_fr: MusicPlayer.skip() est appelée : %s

source: MusicPlayer.stop() is called: %s
fr_fr: MusicPlayer.stop() est appelée : %s

source: Guild or network unavailable, cannot resume playback.
fr_fr: Guilde ou réseau indisponible, impossible de reprendre la lecture.

source: MusicPlayer.resume() is called: %s
fr_fr: MusicPlayer.resume() est appelée : %s

source: MusicPlayer.pause() is called: %s
fr_fr: MusicPlayer.pause() est appelée : %s

source: MusicPlayer.kill() is called: %s
fr_fr: MusicPlayer.kill() est appelé : %s

source: Playback finished, but _current_entry is None.
fr_fr: Lecture terminée, mais _current_entry est Aucune.

source: Possible Warning from kill_current_player()
fr_fr: Avertissement possible de kill_current_player()

source: MusicPlayer.play() is called: %s
fr_fr: MusicPlayer.play() est appelée : %s

source: MusicPlayer is dead, cannot play.
fr_fr: MusicPlayer est mort, impossible de jouer.

source: Guild or network unavailable, cannot start playback.
fr_fr: Guilde ou réseau indisponible, impossible de démarrer la lecture.

source: MusicPlayer was previously paused, resuming current player.
fr_fr: MusicPlayer a été mis en pause précédemment, reprenant le lecteur actuel.

source: MusicPlayer already locked for playback, this call is ignored.
fr_fr: MusicPlayer est déjà verrouillé pour la lecture, cet appel est ignoré.

source: Failed to get next entry.
fr_fr: Impossible d'obtenir l'entrée suivante.

source: Failed to process entry for playback.
fr_fr: Impossible de traiter l'entrée pour la lecture.

source: Creating player with options: ffmpeg %(before)s -i %(input)s %(after)s
fr_fr: Création d'un joueur avec des options : ffmpeg %(before)s -i %(input)s %(after)s

source: Playing %(source)r using %(client)r
fr_fr: Jouer à %(source)r en utilisant %(client)r

source: Skipping deletion of '%s', found song in queue
fr_fr: Suppression de '%s', chanson trouvée dans la file d'attente

source: Deleting file: %s
fr_fr: Suppression du fichier : %s

source: File deleted: %s
fr_fr: Fichier supprimé : %s

source: Cannot delete file, it is currently in use.
fr_fr: Impossible de supprimer le fichier, il est actuellement utilisé.

source: Cannot delete file due to a permission error.
fr_fr: Impossible de supprimer le fichier en raison d'une erreur d'autorisation.

source: Cannot delete file, it was not found.
fr_fr: Impossible de supprimer le fichier, il est introuvable.

source: Error while trying to delete file.
fr_fr: Erreur lors de la tentative de suppression du fichier.

source: Could not delete file, giving up and moving on
fr_fr: Impossible de supprimer le fichier, d'abandonner et de déplacer le

source: Deserialize returned an object that is not a MusicPlayer: %s
fr_fr: Désérialiser a renvoyé un objet qui n'est pas un MusicPlayer : %s

source: Failed to deserialize player
fr_fr: Impossible de désérialiser le joueur

source: Data from ffmpeg: %s
fr_fr: Données de ffmpeg : %s

source: Error from ffmpeg: %s
fr_fr: Erreur de ffmpeg : %s

source: Warning from ffmpeg: %s
fr_fr: Avertissement de ffmpeg : %s

source: Unknown error decoding message from ffmpeg
fr_fr: Erreur inconnue lors du décodage du message de ffmpeg

source: Decoded data from ffmpeg: %s
fr_fr: Données décodées de ffmpeg : %s

source: Adding stream entry for URL: %(url)s
fr_fr: Ajout de l'entrée de flux pour l'URL : %(url)s

source: Could not extract information
fr_fr: Impossible d'extraire les informations

source: This is a playlist.
fr_fr: Ceci est une liste de lecture.

source: Entry info appears to be a stream, adding stream entry...
fr_fr: Les informations d'entrée semblent être un flux, ajoutant une entrée de flux...

source: Invalid content type `%(type)s` for URL: %(url)s
fr_fr: Type de contenu invalide `%(type)s` pour l'URL : %(url)s

source: Got text/html for content-type, this might be a stream.
fr_fr: Texte reçu/html pour le type de contenu, il peut s'agir d'un flux.

source: Questionable content-type "%(type)s" for url: %(url)s
fr_fr: Type de contenu questionnable «%(type)s» pour url: %(url)s

source: Adding URLPlaylistEntry for: %(subject)s
fr_fr: Ajout d'URLPlaylistEntry pour: %(subject)s

source: Adding LocalFilePlaylistEntry for: %(subject)s
fr_fr: Ajout de LocalFilePlaylistEntry pour : %(subject)s

source: Ignored video from compound playlist link with ID: %s
fr_fr: Vidéo ignorée à partir du lien de la playlist composée avec ID: %s

source: Not allowing entry that is in song block list: %(title)s URL: %(url)s
fr_fr: Ne permet pas l'entrée qui se trouve dans la liste de blocs de chansons : URL %(title)s : %(url)s

source: Ignoring song in entries by '%s', duration longer than permitted maximum.
fr_fr: Ignorer la chanson dans les entrées par '%s', durée plus longue que la durée maximale autorisée.

source: Not adding YouTube video because it is marked private or deleted: %s
fr_fr: Ne pas ajouter de vidéo YouTube car elle est marquée comme privée ou supprimée : %s

source: Could not add item
fr_fr: Impossible d'ajouter l'élément

source: Item: %s
fr_fr: Objet : %s

source: Skipped %s bad entries
fr_fr: A ignoré les entrées incorrectes %s

source: Reorder looping over entries.
fr_fr: Réorganiser la boucle sur les entrées.

source: Pre-downloading next track: %r
fr_fr: Pré-téléchargement de la piste suivante : %r

source: no duration data
fr_fr: aucune donnée de durée

source: no duration data in current entry
fr_fr: aucune donnée de durée dans l'entrée actuelle

source: Invalid track_data, must be of type `track` got `%(type)s`
fr_fr: Les track_data non valides, doivent être de type `track` obtenu `%(type)s`

source: Ignored non-track entry in playlist with type: %s
fr_fr: Entrée non-trackée ignorée dans la playlist avec le type : %s

source: Spotify Album total tacks: %(total)s Next URL: %(url)s
fr_fr: Total de l'album Spotify : %(total)s URL suivante : %(url)s

source: Getting Spotify Album Next URL: %s
fr_fr: Récupération de l'URL suivante de l'album Spotify : %s

source: Spotify Album Object may not be complete, expected %(total)s tracks but got %(number)s
fr_fr: L'objet Album Spotify peut ne pas être complet, les pistes %(total)s attendues mais %(number)s obtenu

source: Spotify Album has more tracks than initial total.
fr_fr: Spotify Album a plus de pistes que le total initial.

source: Spotify Playlist total tacks: %(total)s Next URL: %(url)s
fr_fr: Total de la playlist Spotify : %(total)s URL suivante : %(url)s

source: Getting Spotify Playlist Next URL: %s
fr_fr: Récupération de la liste de lecture Spotify URL suivante : %s

source: Spotify Playlist Object may not be complete, expected %(total)s tracks but got %(number)s
fr_fr: L'objet Spotify Playlist peut ne pas être complet, les pistes %(total)s attendues mais %(number)s

source: Spotify Playlist has more tracks than initial total.
fr_fr: Spotify Playlist a plus de pistes que le total initial.

source: Spotify Playlist contained %s usable tracks.
fr_fr: Spotify Playlist contenait %s pistes utilisables.

source: Response status is not OK: [%(status)s] %(reason)s
fr_fr: Le statut de la réponse n'est pas correct : [%(status)s] %(reason)s

source: Response JSON did not decode to a dict!
fr_fr: La réponse JSON n'a pas décodé un dictionnaire !

source: Failed making GET request to url: %s
fr_fr: Impossible de faire la requête GET à l'url: %s

source: Could not make GET to URL: %(url)s Reason: %(raw_error)s
fr_fr: Impossible de rendre GET à l'URL : %(url)s Raison : %(raw_error)s

source: Failed making POST request to url: %s
fr_fr: Impossible de faire la requête POST à l'url: %s

source: Could not make POST to URL: %(url)s Reason: %(raw_error)s
fr_fr: Impossible de faire POST à l'URL : %(url)s Raison : %(raw_error)s

source: Failed to get a guest token from Spotify, please try specifying client ID and client secret
fr_fr: Impossible d'obtenir un jeton d'invité de Spotify, veuillez essayer de spécifier l'ID client et le secret du client

source: Created a new Guest Mode access token.
fr_fr: Créé un nouveau jeton d'accès en mode invité.

source: API response did not contain the expected data. Missing key: %(raw_error)s
fr_fr: La réponse de l'API ne contient pas les données attendues. Clé manquante: %(raw_error)s

source: API response contained unexpected data. %(raw_error)s
fr_fr: La réponse de l'API contenait des données inattendues. %(raw_error)s

source: Requested a token from Spotify, did not end up getting one
fr_fr: Demandé un jeton de Spotify, n'a pas fini par en obtenir un

source: Created a new Client Mode access token.
fr_fr: Créé un nouveau jeton d'accès au mode client.
