Repository: MuXodious/MusicBot
Catalog: i18n/*/LC_MESSAGES/musicbot_messages.po
Languages: ja_jp, ru_ru

source: Failed to change username. Did you change names too many times? Remember name changes are limited to twice per hour.
ja_jp: ユーザー名の変更に失敗しました。名前の変更回数が多すぎましたか？ 名前の変更は1時間に2回に制限されています。
ru_ru: Не удалось изменить имя пользователя. Вы изменили имена слишком много раз? Запомнить, что изменения имени ограничены дважды в час.

source: Failed to change username due to error: %(raw_error)s
ja_jp: エラーのためユーザー名を変更できませんでした: %(raw_error)s
ru_ru: Не удалось изменить имя пользователя из-за ошибки: %(raw_error)s

source: Set the bot's username to `%(name)s`
ja_jp: ボットのユーザー名を `%(name)s` に設定します。
ru_ru: Установить имя бота в `%(name)s`

source: Change the MusicBot's nickname.
ja_jp: MusicBotのニックネームを変更します。
ru_ru: Изменить псевдоним MusicBot.

source: Unable to change nickname: no permission.
ja_jp: ニックネームを変更できません: 権限がありません。
ru_ru: Невозможно изменить никнейм: нет разрешения.

source: Failed to set nickname due to error: %(raw_error)s
ja_jp: エラーのためニックネームを設定できませんでした: %(raw_error)s
ru_ru: Не удалось задать псевдоним из-за ошибки: %(raw_error)s

source: Set the bot's nickname to `%(nick)s`
ja_jp: ボットのニックネームを `%(nick)s` に設定しました
ru_ru: Установите ник бота в `%(nick)s`

source: Set a per-server command prefix.
ja_jp: サーバー毎のコマンドプレフィックスを設定します。
ru_ru: Установите префикс команд для каждого сервера.

source: Clear the per-server command prefix.
ja_jp: サーバー毎のコマンドプレフィックスをクリアします。
ru_ru: Очистить префикс команды для каждого сервера.

source: Override the default command prefix in the server. The option EnablePrefixPerGuild must be enabled first.
ja_jp: サーバーのデフォルトのコマンドプレフィックスを上書きします。 オプションEnablePrefixPerGuildが最初に有効になっている必要があります。
ru_ru: Переопределить префикс команд по умолчанию на сервере. Сначала должен быть включен параметр EnablePrefixPerGuild

source: Custom emoji must be from this server to use as a prefix.
ja_jp: プレフィックスとして使用するには、このサーバーからカスタム絵文字を使用する必要があります。
ru_ru: Пользовательские эмодзи должны быть с этого сервера, чтобы использовать в качестве префикса.

source: Server command prefix is cleared.
ja_jp: サーバーのコマンドプレフィックスがクリアされました。
ru_ru: Префикс команд сервера очищен.

source: Server command prefix is now: %(prefix)s
ja_jp: サーバーのコマンドプレフィックスは現在: %(prefix)s
ru_ru: Теперь префикс команд сервера: %(prefix)s

source: Prefix per server is not enabled! Use the config command to update the prefix instead.
ja_jp: サーバーごとのプレフィックスが有効になっていません! configコマンドを使用して、代わりにプレフィックスを更新してください。
ru_ru: Префикс на сервер не включен! Используйте команду конфигурации для обновления префикса.

source: Show language codes available to use.
ja_jp: 使用可能な言語コードを表示します。
ru_ru: Показать коды языков, доступные для использования.

source: Set the desired language for this server.
ja_jp: このサーバーの言語を設定してください。

source: Reset the server language to bot's default language.
ja_jp: サーバーの言語をボットのデフォルト言語にリセットします。
ru_ru: Сброс языка сервера на язык бота по умолчанию.

source: Manage the language used for messages in the calling server.
ja_jp: 通話サーバーのメッセージに使用される言語を管理します。
ru_ru: Управление языком, используемым для сообщений на сервере.

source: This command can only be used in guilds.
ja_jp: このコマンドはギルドでのみ使用できます。
ru_ru: Эта команда может быть использована только в гильдиях.

source: Invalid sub-command given. Use the help command for more information.
ja_jp: 指定された無効なサブコマンドです。詳細についてはヘルプコマンドを使用してください。
ru_ru: Неверная субкоманда. Используйте команду справки для получения дополнительной информации.

source: **Current Language:** `%(locale)s` **Available Languages:** ``` %(languages)s```
ja_jp: **現在の言語:** `%(locale)s` **利用可能な言語:** ``` %(languages)s```
ru_ru: **Текущий язык:** `%(locale)s` **Доступные языки:** ``` %(languages)s```

source: Cannot set language to `%(locale)s` it is not available.
ja_jp: 言語を`%(locale)s`に設定できません。利用できません。
ru_ru: Не удается установить язык в `%(locale)s`, он недоступен.

source: Language for this server now set to: `%(locale)s`
ja_jp: このサーバーの言語は次のように設定されました: `%(locale)s`
ru_ru: Язык для этого сервера теперь установлен в: `%(locale)s`

source: Language for this server has been reset to: `%(locale)s`
ja_jp: このサーバーの言語がリセットされました: `%(locale)s`
ru_ru: Язык для этого сервера был сброшен: `%(locale)s`

source: Change MusicBot's avatar. Attaching a file and omitting the url parameter also works.
ja_jp: MusicBotのアバターを変更します。 ファイルを添付してURLパラメータを省略することもできます。

source: You must provide a URL or attach a file.
ja_jp: URLを入力するか、ファイルを添付する必要があります。
ru_ru: Вы должны указать URL или прикрепить файл.

source: Unable to change avatar due to error: %(raw_error)s
ja_jp: エラーのためアバターを変更できません: %(raw_error)s
ru_ru: Невозможно изменить аватар из-за ошибки: %(raw_error)s

source: Changed the bot's avatar.
ja_jp: ボットのアバターを変更しました。
ru_ru: Изменил аватар бота.

source: Force MusicBot to disconnect from the discord server.
ja_jp: MusicBotを強制的にDiscordサーバーから切断します。
ru_ru: Принудительно отключиться от сервера discord.

source: Disconnected from server `%(guild)s`
ja_jp: サーバーから切断されました`%(guild)s`
ru_ru: Отключен от сервера`%(guild)s`

source: Not currently connected to server `%(guild)s`
ja_jp: 現在サーバーに接続されていません `%(guild)s`
ru_ru: Сейчас не подключен к серверу`%(guild)s`

source: Attempt to reload without process restart. The default option.
ja_jp: プロセスを再起動せずに再読み込みしようとします。デフォルトのオプションです。
ru_ru: Попытка перезагрузки без перезапуска процесса. Параметр по умолчанию.

source: Full restart, but attempt to update pip packages before restart.
ja_jp: 完全な再起動ですが、再起動前に pip パッケージを更新しようとします。
ru_ru: Полный перезапуск, но попытаться обновить pip пакеты перед перезагрузкой.

source: Full restart, but update MusicBot source code with git first.
ja_jp: 完全に再起動しますが、最初にGitでMusicBotのソースコードをアップデートしてください。
ru_ru: Полный перезапуск, но сначала обновите исходный код MusicBot.

source: Attempt to update all dependency and source code before fully restarting.
ja_jp: 完全に再起動する前に、すべての依存関係とソースコードを更新しようとしています。
ru_ru: Попытка обновить все зависимости и исходный код перед полной перезагрузкой.

source: Invalid option given, use one of: soft, full, upgrade, uppip, or upgit
ja_jp: 無効なオプションが与えられました。ソフト、フル、アップグレード、uppip、またはupgitのいずれかを使用してください
ru_ru: Недопустимый параметр, используйте один из: мягкий, полный, обновление, uppip, или upgit

source: %(emoji)s Restarting current instance...
ja_jp: %(emoji)s 現在のインスタンスを再起動中...
ru_ru: %(emoji)s перезапуск текущего экземпляра...

source: %(emoji)s Restarting bot process...
ja_jp: %(emoji)s ボットを再起動中...
ru_ru: %(emoji)s Перезапуск бота...

source: %(emoji)s Will try to upgrade required pip packages and restart the bot...
ja_jp: %(emoji)s 必要な pip パッケージのアップグレードを試み、ボットを再起動します...
ru_ru: %(emoji)s попытается обновить необходимые pip пакеты и перезапустить бот...

source: %(emoji)s Will try to update bot code with git and restart the bot...
ja_jp: %(emoji)s git でボットコードを更新しようとし、ボットを再起動します...
ru_ru: %(emoji)s попытается обновить бот-код git и перезапустить бот...

source: %(emoji)s Will try to upgrade everything and restart the bot...
ja_jp: %(emoji)s はすべてをアップグレードしてボットを再起動します...
ru_ru: %(emoji)s попытается обновить всё и перезапустить бот...

source: Disconnect from all voice channels and close the MusicBot process.
ja_jp: すべてのボイスチャンネルから切断し、MusicBotプロセスを閉じます。
ru_ru: Отсоединитесь от всех голосовых каналов и закройте процесс MusicBot.

source: Leave the discord server given by name or server ID.
ja_jp: Discordサーバー名またはサーバーIDを指定したままにしてください。
ru_ru: Оставить сервер discord, заданный по имени или ID сервера.

source: Force MusicBot to leave the given Discord server. Names are case-sensitive, so using an ID number is more reliable.
ja_jp: MusicBotに指定したDiscordサーバーから強制的に退出させます。 名前は大文字と小文字を区別しますので、ID番号を使用する方が信頼性が高くなります。

source: You must provide an ID or name.
ja_jp: IDまたは名前を入力してください。
ru_ru: Вы должны указать ID или имя.

source: No guild was found with the ID or name `%(input)s`
ja_jp: IDまたは名前のギルドが見つかりませんでした。`%(input)s`
ru_ru: Не найдено ни одной гильдии с ID или именем `%(input)s`

source: Unknown
ja_jp: 不明
ru_ru: Неизвестен

source: Left the guild: `%(name)s` (Owner: `%(owner)s`, ID: `%(id)s`)
ja_jp: ギルドを退出: `%(name)s` (Owner: `%(owner)s`, ID: `%(id)s`)
ru_ru: Слева от гильдии: `%(name)s` (Owner: `%(owner)s`, ID: `%(id)s`)

source: This command issues a log at level CRITICAL, but does nothing else. Can be used to manually pinpoint events in the MusicBot log file.
ja_jp: このコマンドはレベルCRITICALでログを発行しますが、それ以外は何もしません。 MusicBotログファイルのイベントを手動で特定するために使用できます。
ru_ru: Эта команда выпускает журнал на уровне CRITICAL, но ничего не делает. Может использоваться для закрепления событий вручную в файле журнала MusicBot.

source: Logged breakpoint with ID: %(uuid)s
ja_jp: IDでログインしたブレークポイント: %(uuid)s
ru_ru: Логированная точка останова с ID: %(uuid)s

source: View most common types reported by objgraph.
ja_jp: Objgraphによって報告された最も一般的なタイプを表示します。

source: View limited objgraph.show_growth() output.
ja_jp: 制限付きobjgraph.show_growth() 出力を表示します。
ru_ru: Просмотр ограниченного вывода objgraph.show_growth().

source: View most common types of leaking objects.
ja_jp: 漏洩オブジェクトの最も一般的なタイプを表示します。
ru_ru: Просмотр наиболее распространенных типов утечек объектов.

source: View typestats of leaking objects.
ja_jp: 漏れたオブジェクトの型番を表示します。

source: Evaluate the given function and arguments on objgraph.
ja_jp: objgraphで与えられた関数と引数を評価します。
ru_ru: Оценить заданную функцию и аргументы на обджграфе.

source: Could not import `objgraph`, is it installed?
ja_jp: `objgraph` をインポートできませんでした。インストールされていますか？
ru_ru: Не удалось импортировать `objgraph`, он установлен?

source: Failed to execute debug code: %(py_code)s Exception: ``` %(ex_name)s: %(ex_text)s```
ja_jp: デバッグコードの実行に失敗しました: %(py_code)s 例外: ``` %(ex_name)s: %(ex_text)s```
ru_ru: Не удалось выполнить отладочный код: %(py_code)s Exception: ``` %(ex_name)s: %(ex_text)s```

source: Create 'markdown' for options, permissions, or commands from the code. The output is used to update GitHub Pages and is thus unsuitable for normal reference use.
ja_jp: コードからオプション、権限、またはコマンドの 'markdown' を作成します。 出力は GitHub Pages の更新に使用されるため、通常の参照使用には適していません。
ru_ru: Создайте «markdown» для опций, разрешений или команд из кода. Вывод используется для обновления страниц GitHub и, таким образом, не подходит для нормального использования ссылок.

source: Sub-command must be one of: %(options)s
ja_jp: サブコマンドは次のいずれかでなければなりません： %(options)s
ru_ru: Подкоманда должна быть одной из %(options)s

source: Makes default INI files.
ja_jp: デフォルトのINIファイルを作成します。
ru_ru: Делает INI-файлы по умолчанию.

source: Saved the requested INI file to disk. Go check it
ja_jp: 要求されたINIファイルをディスクに保存しました。確認してください
ru_ru: Запрошенный INI-файл сохранен на диск. Проверьте

source: Display the current bot version and check for updates to MusicBot or dependencies.
ja_jp: 現在のボットバージョンを表示し、MusicBotまたは依存関係の更新を確認します。

source: Could not locate git executable.
ja_jp: git 実行可能ファイルが見つかりませんでした。
ru_ru: Не удалось найти исполняемый файл git.

source: No updates in branch `%(branch)s` remote.
ja_jp: ブランチにアップデートはありません。`%(branch)s`リモコン。
ru_ru: В ветке `%(branch)s` нет обновлений.

source: New commits are available in `%(branch)s` branch remote.
ja_jp: 新しいコミットは、`%(branch)s`ブランチリモコンで利用できます。
ru_ru: Новые коммиты доступны в удаленной ветке `%(branch)s`.

source: Error while checking, see logs for details.
ja_jp: チェック中にエラーが発生しました。詳細はログを参照してください。
ru_ru: Ошибка при проверке, смотрите журналы для подробностей.

source: No updates for dependencies found.
ja_jp: 依存関係の更新は見つかりません。
ru_ru: Обновления для зависимостей не найдены.

source: There are updates for MusicBot available for download.
ja_jp: MusicBotのアップデートがダウンロードできます。
ru_ru: Доступны для скачивания обновления MusicBot.

source: MusicBot is totally up-to-date!
ja_jp: MusicBotは完全に最新です！
ru_ru: MusicBot полностью актуальен!

source: %(status)s **Source Code Updates:** %(git_status)s **Dependency Updates:** %(pip_status)s
ja_jp: %(status)s **ソースコードの更新:** %(git_status)s **依存性の更新:** %(pip_status)s
ru_ru: %(status)s **Обновления исходного кода:** %(git_status)s **Обновления зависимости:** %(pip_status)s

source: Displays the MusicBot uptime, or time since last start / restart.
ja_jp: MusicBotの起動時間、または前回の起動/再起動からの時間を表示します。
ru_ru: Отображает время загрузки MusicBot или время с момента последнего запуска/перезапуска.

source: %(name)s has been online for `%(time)s`
ja_jp: %(name)s は `%(time)s` のオンラインになりました
ru_ru: %(name)s был онлайн для `%(time)s`

source: Display latency information for Discord API and all connected voice clients.
ja_jp: Discord APIと接続しているすべてのボイスクライアントのレイテンシー情報を表示します。
ru_ru: Отображение информации о задержках для API Discord и всех подключенных голосовых клиентов.

source: No voice clients connected.
ja_jp: 音声クライアントが接続されていません。

source: Display API latency and Voice latency if MusicBot is connected.
ja_jp: MusicBotが接続されている場合は、APIレイテンシーと音声レイテンシーを表示します。
ru_ru: Отображение задержки API и задержки голоса при подключении MusicBot.

source: auto
ja_jp: 自動
ru_ru: авто

source: Display MusicBot version number in the chat.
ja_jp: チャットで MusicBot のバージョン番号を表示します。
ru_ru: Отображать номер версии MusicBot в чате.

source: https://github.com/Just-Some-Bots/MusicBot Current version: `%(version)s`
ja_jp: https://github.com/Just-Some-Bots/MusicBot 現在のバージョン: `%(version)s`
ru_ru: https://github.com/Just-Some-Bots/MusicBot Текущая версия: `%(version)s`

source: Update the cookies.txt file using a cookies.txt attachment.
ja_jp: cookies.txt 添付ファイルを使用して、cookies.txt ファイルを更新します。
ru_ru: Обновите файл cookies.txt, используя файл cookies.txt.

source: Enable or disable cookies.txt file without deleting it.
ja_jp: cookies.txt ファイルを削除せずに有効または無効にします。
ru_ru: Включение или отключение файла cookies.txt без его удаления.

source: Cookies already enabled.
ja_jp: クッキーは既に有効になっています。
ru_ru: Cookies уже включены.

source: Cookies must be uploaded to be enabled. (Missing cookies file.)
ja_jp: クッキーを有効にするには、アップロードする必要があります。
ru_ru: Cookies должны быть загружены для включения. (issing cookies файл.)

source: Could not enable cookies due to error: %(raw_error)s
ja_jp: エラーのためクッキーを有効にできませんでした: %(raw_error)s
ru_ru: Не удалось включить куки из-за ошибки: %(raw_error)s

source: Cookies have been enabled.
ja_jp: クッキーが有効になりました。
ru_ru: Cookies были включены.

source: Could not rename cookies file due to error: %(raw_error)s Cookies temporarily disabled and will be re-enabled on next restart.
ja_jp: エラーのためクッキーファイルの名前を変更できませんでした: %(raw_error)s クッキーは一時的に無効化され、次回の再起動時に再度有効になります。
ru_ru: Не удалось переименовать файл cookies из-за ошибки: %(raw_error)s Cookies временно отключены и будут повторно включены при следующем перезапуске.

source: Cookies have been disabled.
ja_jp: Cookieは無効になっています。
ru_ru: Cookies были отключены.

source: No attached uploads were found, try again while uploading a cookie file.
ja_jp: 添付されたアップロードが見つかりませんでした。Cookie ファイルのアップロード中に再試行してください。
ru_ru: Не найдено приложенных загрузок, попробуйте еще раз при загрузке файла cookie.

source: Error downloading the cookies file from discord: %(raw_error)s
ja_jp: discordからCookieファイルをダウンロード中にエラーが発生しました: %(raw_error)s
ru_ru: Ошибка при загрузке файла cookie с дискода: %(raw_error)s

source: Could not save cookies to disk: %(raw_error)s
ja_jp: ディスクにクッキーを保存できませんでした: %(raw_error)s
ru_ru: Не удалось сохранить куки на диске: %(raw_error)s

source: Cookies uploaded and enabled.
ja_jp: Cookieがアップロードされ有効になりました。
ru_ru: Cookies загружены и включены.

source: You cannot use this bot in private messages.
ja_jp: このボットはプライベートメッセージでは使用できません。
ru_ru: Вы не можете использовать этого бота в личных сообщениях.

source: This command is not allowed for your permissions group: %(group)s
ja_jp: このコマンドは権限グループには許可されていません： %(group)s
ru_ru: Эта команда не разрешена для вашей группы прав: %(group)s

source: This command requires you to be in a Voice channel.
ja_jp: このコマンドを使用するには、ボイスチャンネルに参加する必要があります。
ru_ru: Эта команда требует, чтобы вы были в голосовом канале.

source: **Command:** %(name)s
ja_jp: **コマンド:** %(name)s
ru_ru: **Команда:** %(name)s

source: Exception Error
ja_jp: 例外エラー
ru_ru: Ошибка исключения

source: **Example with prefix:** %(prefix)s`%(command)s ...`
ja_jp: **接頭辞付き例:** %(prefix)s`%(command)s ...`
ru_ru: **Пример с префиксом:** %(prefix)s`%(command)s ...`

source: No description given.
ja_jp: 説明がありません。
ru_ru: Нет описания.

source: No usage given.
ja_jp: 使用されていません。
ru_ru: Использование не дано.

source: **Example usage:** ```%(usage)s``` %(prefix_note)s**Description:** %(desc)s
ja_jp: **使用例:** ```%(usage)s``` %(prefix_note)s**説明:** %(desc)s
ru_ru: **Пример использования:** ```%(usage)s``` %(prefix_note)s**Описание:** %(desc)s

source: Leaving voice channel %(channel)s due to inactivity.
ja_jp: 音声チャンネル %(channel)s を離れています。
ru_ru: Выход голосового канала %(channel)s из-за неактивности.

source: Left `%(guild)s` due to bot owner not being found in it.
ja_jp: Botの所有者が見つからなかったため、%(guild)sを残しました。
ru_ru: Левый `%(guild)s` из-за отсутствия владельца бота в нем.

source: Set the log verbosity of MusicBot. Normally this should be set to INFO. It can be set to one of the following: CRITICAL, ERROR, WARNING, INFO, DEBUG, VOICEDEBUG, FFMPEG, NOISY, or EVERYTHING
ja_jp: MusicBotのログ詳細度を設定します。通常、これはINFOに設定する必要があります。 以下のいずれかに設定できます: CRITICAL, ERROR, WARNING, INFO, DEBUG, VOICEDUG, FFMPEG, NOISY,

source: Discord bot authentication token for your Bot. Visit Discord Developer Portal to create a bot App and generate your Token. Never publish your bot token!
ja_jp: BotのDiscord認証トークン Discord開発者ポータルにアクセスしてBotアプリを作成し、トークンを生成してください。 Botトークンを公開しないでください！

source: Provide your Spotify Client Secret to enable MusicBot to interact with Spotify API. This is required if you set the Spotify_ClientID option above.
ja_jp: MusicBotがSpotify APIとやり取りできるようにするには、Spotifyはクライアントシークレットを提供してください。 上記のSpotify_ClientIDオプションを設定している場合に必要です。

source: Discord Member IDs for other bots that MusicBot should not ignore. Use spaces to separate multiple IDs. All bots are ignored by default.
ja_jp: MusicBotが無視すべきでない他のボットのDiscordメンバーID。 複数のIDを区切るにはスペースを使用してください。 デフォルトではすべてのボットは無視されます。

source: Command prefix is how all MusicBot commands must be started in Discord messages. E.g., if you set this to * the play command is trigger by *play ...
ja_jp: コマンドプレフィックスは、MusicBotのすべてのコマンドをDiscordメッセージで開始する必要がある方法です。 例えば、これを * に設定すると、再生コマンドは *play によってトリガーされます。
ru_ru: Префикс команды — как должны начинаться все команды MusicBot в сообщениях Discord. E.g., если вы установите это значение * команда игры триггер при *воспроизведении ...

source: Allow responses in all channels while no specific channel is set for a server. Only used when BindToChannels is missing an ID for a server.
ja_jp: 特定のチャンネルがサーバーに設定されていない間、すべてのチャンネルでのレスポンスを許可します。 BindToChannels にサーバーの ID がない場合にのみ使用されます。
ru_ru: Разрешить ответы во всех каналах, в то время как для сервера не установлен определенный канал. Используется только когда BindToChannels отсутствует ID для сервера.

source: A list of Voice Channel IDs that MusicBot should automatically join on start up. Use spaces to separate multiple IDs.
ja_jp: MusicBotが起動時に自動的に参加するボイスチャンネルIDの一覧です。 複数のIDを区切るにはスペースを使用してください。

source: MusicBot will try to send Now Playing notices directly to the member who requested the song instead of posting in a server channel.
ja_jp: MusicBot は Now Playing の通知をサーバーチャンネルに投稿する代わりに、曲をリクエストしたメンバーに直接送信しようとします。
ru_ru: MusicBot будет пытаться отправить сейчас воспроизведение записей непосредственно участнику, который запросил песню вместо размещения в канале сервера.

source: Disable now playing messages for songs played via auto playlist.
ja_jp: 自動プレイリスト経由で再生された曲のメッセージを無効にします。
ru_ru: Отключать теперь воспроизведение сообщений о песнях, воспроизведенных с автоплейлиста.

source: Forces MusicBot to use a specific channel to send now playing messages. Only one text channel ID can be used per server.
ja_jp: MusicBot が特定のチャンネルを使用してメッセージを送信するよう強制します。 サーバーごとに使用できるテキストチャンネル ID は 1 つだけです。
ru_ru: Вынуждает MusicBot использовать определенный канал для отправки сейчас воспроизводимых сообщений. Только один идентификатор текстового канала может быть использован на сервере.

source: MusicBot will automatically delete Now Playing messages.
ja_jp: MusicBotは自動的に「再生中」メッセージを削除します。
ru_ru: Музыкабот автоматически удалит сейчас воспроизводимые сообщения.

source: Sets the default volume level MusicBot will play songs at. You can use any value from 0 to 1, or 0% to 100% volume.
ja_jp: MusicBotが曲を再生するデフォルトの音量レベルを設定します。 00から1までの任意の値、または0named@@1までのボリュームを使用できます。

source: Sets the default speed MusicBot will play songs at. Must be a value from 0.5 to 100.0 for ffmpeg to use it. A value of 1 is normal playback speed. Note: Streamed media does not support speed adjustments.
ja_jp: MusicBot が曲を再生するデフォルトの速度を設定します。format@@0 ffmpegを使用するには0.5〜100.0の値である必要があります。 1の値は通常の再生速度です。 注: ストリーミングメディアはスピード調整をサポートしていません。

source: Number of channel member votes required to skip a song. Acts as a minimum when SkipRatio would require more votes.
ja_jp: 曲をスキップするために必要なチャンネルメンバーの投票数です。 SkipRatioがより多くの票を必要とする場合、最低限の使用をします。

source: Allow MusicBot to keep downloaded media, or delete it right away.
ja_jp: MusicBot がダウンロードしたメディアを保存したり、すぐに削除したりできます。
ru_ru: Разрешить Музыкаботу сохранять загруженный носитель или удалять его прямо сейчас.

source: If SaveVideos is enabled, set a limit on how much storage space should be used.
ja_jp: SaveVideoが有効になっている場合は、使用するストレージ容量の上限を設定します。
ru_ru: Если включено SaveVideos, установите ограничение на количество памяти.

source: If SaveVideos is enabled, set a limit on how long files should be kept.
ja_jp: SaveVideoが有効になっている場合、ファイルの保持時間の制限を設定します。
ru_ru: Если SaveVideos включен, установите ограничение на время хранения файлов.

source: If SaveVideos is enabled, never purge auto playlist songs from the cache regardless of limits.
ja_jp: SaveVideoが有効になっている場合、制限に関係なく自動プレイリスト曲をキャッシュから削除することはありません。
ru_ru: Если SaveVideos включен, никогда не очищать автоплейлисты из кэша вне зависимости от ограничений.

source: Mention the user who added the song when it is played.
ja_jp: 再生時に曲を追加したユーザーに言及します。
ru_ru: Упоминает пользователя, который добавил песню во время ее воспроизведения.

source: Automatically join the owner if they are in an accessible voice channel when bot starts.
ja_jp: ボットの起動時にアクセス可能な音声チャンネルにいる場合は、所有者に自動的に参加します。
ru_ru: Автоматически присоединяйтесь к владельцу, если он находится в доступном голосовом канале при запуске бота.

source: Enable MusicBot to automatically play music from the auto playlist when the queue is empty.
ja_jp: キューが空の場合、自動プレイリストから音楽を自動再生するには、MusicBotを有効にします。
ru_ru: Включите MusicBot для автоматического воспроизведения музыки из автоплейлиста, когда очередь пуста.

source: Shuffles the auto playlist tracks before playing them.
ja_jp: 再生する前に自動プレイリストトラックをシャッフルします。
ru_ru: Перемешает автоплейлист дорожек перед их воспроизведением.

source: Enable automatic skip of auto playlist songs when a user plays a new song. This only applies to the current playing song if it was added by the auto playlist.
ja_jp: ユーザーが新しい曲を再生したときに自動プレイリストの曲を自動スキップするようにします。 自動プレイリストで追加された場合にのみ、現在再生中の曲に適用されます。
ru_ru: Включить автоматическое пропуск треков в списке автовоспроизведения, когда пользователь играет новую песню. Это применимо только к текущей песне, если она была добавлена автоматическим плейлистом.

source: Remove songs from the auto playlist if they are found in the song block list.
ja_jp: 曲のブロックリストから曲が見つかった場合は、自動プレイリストから曲を削除します。
ru_ru: Удалить песни из автоплейлиста, если они находятся в списке блоков песни.

source: Allow MusicBot to automatically delete messages it sends, after a delay. Delay period is controlled by DeleteDelayShort and DeleteDelayLong.
ja_jp: Allow MusicBot to automatically delete messages sends, after a delay. Delay period is control by DeleteDelayShort and DeleteDelayLong.

source: Auto delete valid commands after a delay.
ja_jp: 遅延後に有効なコマンドを自動的に削除します。
ru_ru: Автоматическое удаление правильных команд после задержки.

source: Sets the short period of seconds before deleting messages. This period is used by messages that require no further interaction.
ja_jp: メッセージを削除するまでの短い秒数を設定します。 この期間は、それ以上の相互作用を必要としないメッセージで使用されます。
