Repository: MuXodious/MusicBot
Catalog: i18n/*/LC_MESSAGES/musicbot_logs.po
Languages: fr_fr

source: Aliases file not found, copying example_aliases.json
fr_fr: Fichier d'alias introuvable, copiant exemple_aliases.json

source: Error while loading aliases. Problem: Your aliases files (aliases.json & example_aliases.json) are missing. Solution: Replace the alias config file(s) or copy them from: https://github.com/Just-Some-Bots/MusicBot/
fr_fr: Erreur lors du chargement. Problème : Vos fichiers d'alias (aliases.json & example_aliases.json) sont manquants. Solution : Remplacez le(s) fichier(s) de configuration d'alias ou copiez-les: https://github.com/Just-Some-Bots/MusicBot/

source: Failed to load aliases file: %s
fr_fr: Impossible de charger le fichier d'alias : %s

source: Failed to parse aliases file: %s Ensure the file contains valid JSON and restart the bot.
fr_fr: Échec de l'analyse du fichier d'alias : %s Assurez-vous que le fichier contient du JSON valide et redémarrez le bot.

source: Aliases skipped for non-existent command: %(command)s -> %(aliases)s
fr_fr: Alias ignorés pour une commande inexistante : %(command)s -> %(aliases)s

source: Alias(es) skipped for invalid alias data: %(command)s -> %(aliases)s
fr_fr: Alias(s) ignoré(s) pour les données d'alias invalides : %(command)s -> %(aliases)s

source: Alias `%(alias)s` skipped as already exists on command: %(command)s
fr_fr: Alias `%(alias)s` ignoré comme il existe déjà sur commande : %(command)s

source: Error loading auto playlist file: %s
fr_fr: Erreur lors du chargement du fichier de la liste de lecture automatique : %s

source: Removing unplayable song from playlist, %(playlist)s: %(track)s
fr_fr: Suppression de la chanson injouable de la playlist, %(playlist)s: %(track)s

source: Removing song from playlist, %(playlist)s: %(track)s
fr_fr: Suppression de la chanson de la playlist, %(playlist)s: %(track)s

source: Could not log information about the playlist URL removal.
fr_fr: Impossible d'enregistrer les informations à propos de la suppression de l'URL de la playlist.

source: Updating playlist file...
fr_fr: Mise à jour du fichier de liste de lecture...

source: Failed to save playlist file: %s
fr_fr: Impossible d'enregistrer le fichier de la playlist : %s

source: URL already in playlist %s, ignoring
fr_fr: URL déjà dans la playlist %s, ignorée

source: Adding new URL to playlist, %(playlist)s: %(track)s
fr_fr: Ajout d'une nouvelle URL à la playlist, %(playlist)s: %(track)s

source: Initializing MusicBot %s
fr_fr: Initialisation de MusicBot %s

source: Loop is closed, cannot create task for: %r
fr_fr: La boucle est fermée, impossible de créer une tâche pour : %r

source: Unhandled exception for task: %r
fr_fr: Exception non gérée pour la tâche : %r

source: Unhandled exception for task: %(task)r -- %(raw_error)s
fr_fr: Exception non gérée pour la tâche : %(task)r -- %(raw_error)s

source: Spotify did not provide us with a token. Disabling.
fr_fr: Spotify ne nous a pas fourni de jeton. Désactivation.

source: Authenticated with Spotify successfully using client ID and secret.
fr_fr: Authentifié avec Spotify avec succès en utilisant l'ID du client et le secret.

source: Could not start Spotify client. Is your client ID and secret correct? Details: %s. Continuing anyway in 5 seconds...
fr_fr: Impossible de démarrer le client Spotify. Votre identifiant client et votre secret sont-ils corrects ? Détails: %s. Continuer quand même dans 5 secondes...

source: The config did not have Spotify app credentials, attempting to use guest mode.
fr_fr: La configuration n'a pas les identifiants de l'application Spotify, en essayant d'utiliser le mode invité.

source: Authenticated with Spotify successfully using guest mode.
fr_fr: Authentifié avec Spotify avec succès en mode invité.

source: Could not start Spotify client using guest mode. Details: %s.
fr_fr: Impossible de démarrer le client Spotify en utilisant le mode invité. Détails : %s.

source: Initialized, now connecting to discord.
fr_fr: Initialisé, se connecte maintenant à discord.

source: Network ping test is disabled via config.
fr_fr: Le test de ping réseau est désactivé via la configuration.

source: Network ping test is closing down.
fr_fr: Le test de ping réseau est en train de se fermer.

source: Could not resolve ping target.
fr_fr: Impossible de résoudre la cible du ping

source: Network ping test cancelled.
fr_fr: Test de ping réseau annulé.

source: Network testing via HTTP does not have a session to borrow.
fr_fr: Le test de réseau via HTTP n'a pas de session à emprunter.

source: Could not locate `ping` executable in your environment.
fr_fr: Impossible de localiser l'exécutable `ping` dans votre environnement.

source: MusicBot could not locate a `ping` command path. Will attempt to use HTTP ping instead. MusicBot tried the following command: %s You should enable ping in your system or container environment for best results. Alternatively disable network checking via config.
fr_fr: MusicBot n'a pas pu localiser un chemin de commande `ping`. Il tentera d'utiliser le ping HTTP à la place. MusicBot a essayé la commande suivante : %s Vous devriez activer le ping dans votre environnement système ou conteneur pour de meilleurs résultats. Sinon, désactiver la vérification du réseau par le biais de la configuration.

source: MusicBot was denied permission to execute the `ping` command. Will attempt to use HTTP ping instead. MusicBot tried the following command: %s You should enable ping in your system or container environment for best results. Alternatively disable network checking via config.
fr_fr: MusicBot s'est vu refuser la permission d'exécuter la commande `ping`. Il tentera d'utiliser le ping HTTP à la place. MusicBot a essayé la commande suivante : %s Vous devriez activer le ping dans votre environnement système ou conteneur pour de meilleurs résultats. Sinon, désactiver la vérification du réseau par le biais de la configuration.

source: Your environment may not allow the `ping` system command. Will attempt to use HTTP ping instead. MusicBot tried the following command: %s You should enable ping in your system or container environment for best results. Alternatively disable network checking via config.
fr_fr: Votre environnement peut ne pas autoriser la commande `ping` du système. Il va essayer d'utiliser le ping HTTP à la place. MusicBot a essayé la commande suivante : %s Vous devriez activer le ping dans votre environnement système ou conteneur pour de meilleurs résultats. Sinon, désactiver la vérification du réseau par le biais de la configuration.

source: MusicBot detected network is available again.
fr_fr: Le réseau détecté par MusicBot est à nouveau disponible.

source: VoiceClient is not connected, waiting to resume MusicPlayer...
fr_fr: VoiceClient n'est pas connecté, en attente de reprise de MusicPlayer...

source: Resuming playback of player: (%(guild_id)s) %(player)r
fr_fr: Reprise de la lecture du joueur : (%(guild_id)s) %(player)r

source: MusicBot detected a network outage.
fr_fr: MusicBot a détecté une panne de réseau.

source: Pausing MusicPlayer due to network availability: (%(guild_id)s) %(player)r
fr_fr: Suspendre MusicPlayer en raison de la disponibilité du réseau : (%(guild_id)s) %(player)r

source: Looking for owner in guild: %(guild)s (required voice: %(required)s) and got: %(owner)s
fr_fr: Recherche du propriétaire dans la guilde : %(guild)s (voix requise : %(required)s) et obtenu : %(owner)s

source: Checking for channels to auto-join or resume...
fr_fr: Vérification des salons à rejoindre ou à reprendre automatiquement...

source: Guild not available, cannot auto join: %(id)s/%(name)s
fr_fr: Guilde non disponible, impossible de rejoindre automatiquement : %(id)s/%(name)s

source: Found resumable voice channel: %(channel)s in guild: %(guild)s
fr_fr: Canal vocal disponible : %(channel)s dans la guilde : %(guild)s

source: Will try resuming voice session instead of Auto-Joining channel: %s
fr_fr: Essaiera de reprendre la session vocale au lieu de rejoindre automatiquement le canal : %s

source: Found owner in voice channel: %s
fr_fr: Propriétaire trouvé dans le salon vocal : %s

source: Ignoring resumable channel, AutoSummon to owner in channel: %s
fr_fr: Ignorant le canal de révocation, Invocation automatique au propriétaire dans le canal : %s

source: Ignoring Auto-Join channel, AutoSummon to owner in channel: %s
fr_fr: Ignorer le canal de connexion automatique, Invoquer automatiquement au propriétaire du canal : %s

source: Already connected to channel: %(channel)s in guild: %(guild)s
fr_fr: Déjà connecté au salon : %(channel)s dans la guilde : %(guild)s

source: Attempting to join channel: %(channel)s in guild: %(guild)s
fr_fr: Tentative de rejoindre le salon : %(channel)s dans la guilde : %(guild)s

source: Discarding MusicPlayer and making a new one...
fr_fr: Discarding MusicPlayer and making a new on...

source: MusicBot will make a new MusicPlayer now...
fr_fr: MusicBot va créer un nouveau MusicPlayer...

source: Not joining %(guild)s/%(channel)s, it isn't a supported voice channel.
fr_fr: Ne pas rejoindre %(guild)s/%(channel)s, ce n'est pas un salon vocal pris en charge.

source: Finished joining configured channels.
fr_fr: Terminé de rejoindre les canaux configurés.

source: Member is not voice-enabled and cannot use this command.
fr_fr: Le membre n'est pas activé par la voix et ne peut pas utiliser cette commande.

source: You cannot use this command when not in the voice channel.
fr_fr: Vous ne pouvez pas utiliser cette commande quand vous n'êtes pas dans le salon vocal.

source: Getting bot Application Info.
fr_fr: Récupération des infos d'application du bot.

source: MusicBot does not have permission to Connect in channel: %s
fr_fr: MusicBot n'a pas la permission de se connecter au salon : %s

source: MusicBot does not have permission to Connect in channel: `%(name)s`
fr_fr: MusicBot n'a pas la permission de se connecter dans le salon : `%(name)s`

source: MusicBot does not have permission to Speak in channel: %s
fr_fr: MusicBot n'a pas la permission de parler dans le canal : %s

source: MusicBot does not have permission to Speak in channel: `%(name)s`
fr_fr: MusicBot n'a pas la permission de parler dans le salon : `%(name)s`

source: Reusing bots VoiceClient from guild: %s
fr_fr: Réutilisation des bots VoiceClient de la guilde : %s

source: Forcing disconnect on stale VoiceClient in guild: %s
fr_fr: Forcer la déconnexion sur un VoiceClient obsolète dans la guilde : %s

source: Disconnect failed or was cancelled?
fr_fr: La déconnexion a échoué ou a été annulée ?

source: MusicBot is unable to connect to the channel right now: %(channel)s
fr_fr: MusicBot ne peut pas se connecter au salon pour le moment : %(channel)s

source: MusicBot could not connect to the channel. Try again later, or restart the bot if this continues.
fr_fr: MusicBot n'a pas pu se connecter au canal. Réessayez plus tard ou redémarrez le bot si cela continue.

source: MusicBot has a VoiceClient now...
fr_fr: MusicBot a maintenant un client vocal...

source: Retrying connection after a timeout error (%(attempt)s) while trying to connect to: %(channel)s
fr_fr: Retentative de connexion après une erreur de délai (%(attempt)s) lors de la tentative de connexion à : %(channel)s

source: MusicBot VoiceClient connection attempt was cancelled. No retry.
fr_fr: La tentative de connexion de MusicBot VoiceClient a été annulée. Aucune nouvelle tentative.

source: MusicBot connection to voice was cancelled. This is odd. Maybe restart?
fr_fr: La connexion MusicBot à la voix a été annulée. C'est bizarre. Peut-être redémarrez-vous?

source: MusicBot is requesting to speak in channel: %s
fr_fr: MusicBot demande à parler dans le canal : %s

source: MusicBot does not have permission to speak.
fr_fr: MusicBot n'a pas la permission de parler.

source: MusicBot could not request to speak.
fr_fr: MusicBot n'a pas pu demander à parler.

source: Disconnecting a MusicPlayer in guild: %s
fr_fr: Déconnexion d'un MusicPlayer dans la guilde : %s

source: Disconnecting VoiceClient before we kill the MusicPlayer.
fr_fr: Déconnexion de VoiceClient avant de tuer le MusicPlayer.

source: The disconnect failed or was cancelled.
fr_fr: La déconnexion a échoué ou a été annulée.

source: MusicBot has a VoiceProtocol that is not a VoiceClient. Disconnecting anyway...
fr_fr: MusicBot a un protocole vocal qui n'est pas un client vocal. Déconnexion quand même...

source: Disconnecting a rogue VoiceClient in guild: %s
fr_fr: Déconnexion d'un client vocal immature dans la guilde : %s

source: Disconnecting a non-guild VoiceClient...
fr_fr: Déconnexion d'un client vocal non-guilde...

source: MusicBot.voice_clients list contains a non-VoiceClient object? The object is actually of type: %s
fr_fr: La liste MusicBot.voice_clients contient un objet non-VoiceClient ? L'objet est en fait de type : %s

source: We still have a MusicPlayer ref in guild (%(guild_id)s): %(player)r
fr_fr: Nous avons encore un ref MusicPlayer dans la guilde (%(guild_id)s) : %(player)r

source: Guild (%(guild)s) wants a player, optional: %(player)r
fr_fr: Guilde (%(guild)s) veut un joueur, optionnel: %(player)r

source: [BUG] MusicPlayer is missing a VoiceClient somehow. You should probably restart the bot.
fr_fr: [BUG] MusicPlayer ne dispose pas d'un VoiceClient. Vous devriez probablement redémarrer le bot.

source: MusicPlayer has a VoiceClient that is not connected.
fr_fr: MusicPlayer a un Client Voix qui n'est pas connecté.

source: MusicPlayer obj: %r
fr_fr: Lecteur musical obj: %r

source: Getting a MusicPlayer for guild: %(guild)s In Channel: %(channel)s Create: %(create)s Deserialize: %(serial)s
fr_fr: Obtenir un MusicPlayer pour la guilde : %(guild)s Dans la chaîne : %(channel)s Création : %(create)s Désérialisation : %(serial)s

source: Created player via deserialization for guild %(guild_id)s with %(number)s entries
fr_fr: Joueur créé par désérialisation pour la guilde %(guild_id)s avec des entrées %(number)s

source: The bot is not in a voice channel. Use the summon command to bring the bot to your voice channel.
fr_fr: Le bot n'est pas dans un salon vocal. Utilisez la commande d'invocation pour amener le bot dans votre canal vocal.

source: Something is wrong, we didn't get the VoiceClient.
fr_fr: Quelque chose ne va pas, nous n'avons pas obtenu le VoiceClient.

source: Running on_player_play
fr_fr: En cours d'exécution sur_player_play

source: Setting URL history guild %(guild_id)s == %(url)s
fr_fr: Définition de l'historique des URL %(guild_id)s == %(url)s

source: No thumbnail set for entry with URL: %s
fr_fr: Aucune vignette définie pour l'entrée avec l'URL : %s

source: no channel to put now playing message into
fr_fr: aucun canal dans lequel mettre le message en cours de lecture

source: ignored now-playing message as it was already posted.
fr_fr: a ignoré le message qui était déjà publié.

source: Running on_player_resume
fr_fr: En cours d'exécution sur_player_resume

source: Running on_player_pause
fr_fr: En cours de mise en pause

source: Running on_player_stop
fr_fr: Exécution sur_player_stop

source: Running on_player_finished_playing
fr_fr: Lancement sur_player_finished_playing

source: Event loop is closed, nothing else to do here.
fr_fr: La boucle événement est fermée, rien d'autre à faire ici.

source: Logout under way, ignoring this event.
fr_fr: Déconnexion en cours, ignorant cet événement.

source: VoiceClient says it is not connected, nothing else we can do here.
fr_fr: VoiceClient dit qu'il n'est pas connecté, rien d'autre que nous pouvons faire ici.

source: Player finished and queue is empty, leaving voice channel...
fr_fr: Lecteur terminé et la file d'attente est vide, laissant le canal vocal...

source: Looping over queue to expunge songs with missing author...
fr_fr: Bouclage de la file d'attente pour éliminer les chansons avec l'auteur manquant...

source: Author `%(user)s` absent, skipped (deleted) entry from queue: %(song)s
fr_fr: Auteur `%(user)s` absent, entrée ignorée (supprimée) de la file d'attente : %(song)s

source: No playable songs in the Guild autoplaylist, disabling.
fr_fr: Aucune chanson jouable dans la liste de lecture automatique de la Guilde, désactivée.

source: No content in current autoplaylist. Filling with new music...
fr_fr: Aucun contenu dans la liste de lecture automatique actuelle. Remplissage avec une nouvelle musique...

source: Looping over player autoplaylist...
fr_fr: Bouclage de la liste de lecture automatique du joueur...

source: Error while processing song "%(url)s": %(raw_error)s
fr_fr: Erreur lors du traitement de la chanson "%(url)s" : %(raw_error)s

source: Error extracting song "%(url)s": %(raw_error)s
fr_fr: Erreur lors de l'extraction de la chanson "%(url)s" : %(raw_error)s

source: MusicBot needs to stop the auto playlist extraction and bail.
fr_fr: MusicBot a besoin de mettre fin à l'extraction et au sauvetage de la liste de lecture automatique.

source: MusicBot got an unhandled exception in player finished event.
fr_fr: MusicBot a obtenu une exception non gérée dans l'événement fini du lecteur.

source: Expanding auto playlist with entries extracted from: %s
fr_fr: Étendre la liste de lecture automatique avec les entrées extraites de: %s

source: Error adding song from autoplaylist: %s
fr_fr: Erreur lors de l'ajout de la chanson de la liste de lecture automatique : %s

source: Exception data for above error:
fr_fr: Données d'exception pour l'erreur ci-dessus :

source: No playable songs in the autoplaylist, disabling.
fr_fr: Aucune musique jouable dans la liste de lecture automatique, désactivation.

source: Running on_player_entry_added
fr_fr: En cours d'exécution sur_player_entry_added

source: Automatically skipping auto-playlist entry for queued entry.
fr_fr: Ignorer automatiquement l'entrée de la liste de lecture automatique pour l'entrée en file d'attente.

source: MusicPlayer exception for entry: %r
fr_fr: Exception MusicPlayer pour l'entrée : %r

source: MusicPlayer exception.
fr_fr: Exception MusicPlayer.

source: Auto playlist track could not be played: %r
fr_fr: Impossible de lire la piste de la liste de lecture automatique : %r

source: Logout under way, ignoring status update event.
fr_fr: Déconnexion en cours, ignorant la mise à jour de l'événement.

source: Update bot status: %(status)s -- %(activity)r
fr_fr: Mettre à jour le statut du bot : %(status)s -- %(activity)r

source: Serializing queue for %s
fr_fr: Sérialisation de la file d'attente pour %s

source: Deserializing queue for %s
fr_fr: Désérialisation de la file d'attente pour %s

source: Writing current song for %s
fr_fr: Écriture de la chanson actuelle pour %s

source: Cannot send non-response object: %r
fr_fr: Impossible d'envoyer l'objet sans réponse : %r

source: [Dev Bug] Tried sending an invalid response object.
fr_fr: [Dev Bug] Tentative d'envoi d'un objet de réponse invalide.

source: sending embed to: %s
fr_fr: envoi d'intégrations à: %s

source: sending text to: %s
fr_fr: envoi de texte à: %s

source: Cannot send message to "%s", no permission
fr_fr: Impossible d'envoyer le message à "%s", aucune permission

source: Cannot send message to "%s", invalid or deleted channel
fr_fr: Impossible d'envoyer le message à "%s", canal invalide ou supprimé

source: Message is over the message size limit (%s)
fr_fr: Le message dépasse la limite de taille du message (%s)

source: Could not send private message, sending in fallback channel instead.
fr_fr: Impossible d'envoyer un message privé, en envoyant un canal de secours à la place.

source: Rate limited send message, retrying in %s seconds.
fr_fr: Noter un message d'envoi limité, nouvel essai dans %s secondes.

source: Cancelled message retry for: %s
fr_fr: Message annulé à nouveau pour : %s

source: Rate limited send message, but cannot retry!
fr_fr: Noter un message d'envoi limité, mais ne peut pas recommencer!

source: Failed to send message in fallback channel.
fr_fr: Impossible d'envoyer le message dans le canal de repli.

source: Failed to send due to an HTTP error.
fr_fr: Échec de l'envoi en raison d'une erreur HTTP.

source: Cannot delete message "%s", no permission
fr_fr: Impossible de supprimer le message "%s", aucune permission

source: Cannot delete message "%s", message not found
fr_fr: Impossible de supprimer le message "%s", message introuvable

source: Rate limited message delete, retrying in %s seconds.
fr_fr: Noter la suppression de messages limités, nouvel essai dans %s secondes.

source: Rate limited message delete, but cannot retry!
fr_fr: Noter la suppression de messages limités, mais ne peut pas recommencer !

source: Failed to delete message
fr_fr: Échec de la suppression du message

source: Got HTTPException trying to delete message: %s
fr_fr: Erreur HTTPException lors de la suppression du message : %s

source: Cannot edit message "%s", message not found
fr_fr: Impossible de modifier le message "%s", message introuvable

source: Sending message instead
fr_fr: Envoi du message à la place

source: Rate limited edit message, retrying in %s seconds.
fr_fr: Noter le message d'édition limité, nouvel essai dans %s secondes.

source: Cancelled message edit for: %s
fr_fr: Modification du message annulée pour : %s

source: Failed to edit message
fr_fr: Impossible de modifier le message

source: Got HTTPException trying to edit message %s to: %s
fr_fr: Exception HTTPException essayant d'éditer le message %s à: %s

source: Cancelled delete for message (ID: %(id)s): %(content)s
fr_fr: Suppression du message annulée (ID: %(id)s): %(content)s

source: Caught a signal from the OS: %s
fr_fr: Signal du système d'exploitation attrapé : %s

source: Disconnecting and closing down MusicBot...
fr_fr: Déconnexion et fermeture de MusicBot...

source: Exception thrown while handling interrupt signal!
fr_fr: Exception lancée lors de la gestion du signal d'interruption !

source: MusicBot is now doing shutdown steps...
fr_fr: MusicBot fait maintenant des étapes d'arrêt...

source: Failed Discord API Login! Problem: MusicBot could not log into Discord API. Your Token may be incorrect or there may be an API outage. Solution: Make sure you have the correct Token set in your config. Check API status at the official site: discordstatus.com
fr_fr: Échec de la connexion à l'API Discord ! Problème : MusicBot n'a pas pu se connecter à l'API Discord. Votre jeton est peut-être incorrect ou il peut y avoir une panne d'API. Solution : Assurez-vous que le bon jeton est défini dans votre configuration. Vérifiez l'état de l'API sur le site officiel : discordstatus.com

source: Waiting for download threads to finish up...
fr_fr: En attente de la fin du téléchargement...

source: Will wait for task: %(name)s (%(func)s)
fr_fr: Va attendre la tâche : %(name)s (%(func)s)

source: Will try to cancel task: %(name)s (%(func)s)
fr_fr: Essaiera d'annuler la tâche : %(name)s (%(func)s)

source: Awaiting pending tasks...
fr_fr: En attente de tâches...

source: Closing HTTP Connector.
fr_fr: Fermeture du connecteur HTTP.

source: Closing aiohttp session.
fr_fr: Fermeture de la session aiohttp.

source: Logout has been called.
fr_fr: La déconnexion a été appelée.

source: Exception in %(event)s: %(error)s
fr_fr: Exception dans %(event)s: %(error)s

source: Exception in %s
fr_fr: Exception dans %s

source: MusicBot resumed a session with discord.
fr_fr: MusicBot a repris une session avec discord.

source: Finish on_ready
fr_fr: Terminer le _prêt

source: Logged in, now getting MusicBot ready...
fr_fr: Connecté, maintenant que MusicBot est prêt...

source: ClientUser is somehow none, we gotta bail...
fr_fr: ClientUser est en quelque sorte aucun, nous devons sauvegarder...

source: Owner: %(id)s/%(name)s#%(desc)s
fr_fr: Propriétaire : %(id)s/%(name)s#%(desc)s

source: Guild List:
fr_fr: Liste de guilde:
