Repository: MuXodious/MusicBot
Catalog: i18n/*/LC_MESSAGES/musicbot_logs.po
Languages: fr_fr

source: Left %s due to bot owner not found
fr_fr: A quitté %s en raison du propriétaire du bot introuvable

source: Not proceeding with checks in %s servers due to unavailability
fr_fr: Ne pas procéder aux vérifications sur les serveurs %s en raison d'une indisponibilité

source: Owner could not be found on any guild (id: %s)
fr_fr: Le propriétaire n'a pas pu être trouvé sur une guilde (id : %s)

source: Owner unknown, bot is not on any guilds.
fr_fr: Propriétaire inconnu, le bot n'est sur aucune guilde.

source: To make the bot join a guild, paste this link in your browser. Note: You should be logged into your main account and have manage server permissions on the guild you want the bot to join. %s
fr_fr: Pour que le bot rejoigne une guilde, collez ce lien dans votre navigateur. Note : Vous devez être connecté à votre compte principal et avoir gérer les permissions du serveur sur la guilde que vous voulez que le bot rejoigne. %s

source: Got None for bound channel with ID: %d
fr_fr: Aucun n'a été pour le canal lié avec l'ID : %d

source: Cannot bind to non Messageable channel with ID: %d
fr_fr: Impossible de se lier à un canal non Messageable avec l'ID : %d

source: Bound to text channels:
fr_fr: Lié aux salons textuels :

source: Not bound to any text channels
fr_fr: Non lié à aucun salon textuel

source: Got None for auto join channel with ID: %d
fr_fr: Aucun n'a été trouvé pour le canal d'accès automatique avec l'ID : %d

source: Cannot auto join a Private/Non-Guild channel with ID: %d
fr_fr: Impossible de rejoindre automatiquement un canal Privé/Non-Guilde avec l'ID : %d

source: Cannot auto join to non-connectable channel with ID: %d
fr_fr: Impossible de joindre automatiquement au canal non connectable avec l'ID : %d

source: Auto joining voice channels:
fr_fr: Rejoindre automatiquement les salons vocaux:

source: Not auto joining any voice channels
fr_fr: Ne pas rejoindre automatiquement les salons vocaux

source: Event on_ready has fired %s times
fr_fr: L'événement on_ready a été déclenché %s fois

source: Getting application info.
fr_fr: Récupération des informations de l'application.

source: Ensuring data folders exist
fr_fr: S'assurer que les dossiers de données existent

source: Validating config
fr_fr: Validation de la configuration

source: Validating permissions config
fr_fr: Validation de la configuration des permissions

source: Disabled
fr_fr: Désactivé

source: Enabled
fr_fr: Activé

source: Command prefix: %s
fr_fr: Préfixe de commande : %s

source: Default volume: %d%%
fr_fr: Volume par défaut : %d%%

source: Skip threshold: %(num)d votes or %(percent).0f%%
fr_fr: Seuil de passage : %(num)d votes ou %(percent).0f%%

source: Now Playing @mentions: %s
fr_fr: Lecture en cours de @mentions: %s

source: Auto-Playlist: %(status)s (order: %(order)s)
fr_fr: Liste de lecture automatique : %(status)s (ordre : %(order)s)

source: random
fr_fr: Aléatoire

source: sequential
fr_fr: séquentielle

source: Auto-Pause: %s
fr_fr: Pause automatique : %s

source: Delete Messages: %s
fr_fr: Supprimer les messages : %s

source: Delete Invoking: %s
fr_fr: Suppression de l'appel: %s

source: Delete Now Playing: %s
fr_fr: Supprimer la lecture en cours : %s

source: Debug Mode: %s
fr_fr: Mode de débogage : %s

source: Downloaded songs will be %s
fr_fr: Les chansons téléchargées seront %s

source: Delete if unused for %d days
fr_fr: Supprimer si inutilisé pour %d jours

source: Status message: %s
fr_fr: Message de statut : %s

source: Spotify integration: %s
fr_fr: Intégration Spotify : %s

source: Timeout: %s seconds
fr_fr: Délai d'expiration : %s secondes

source: Timeout: %d seconds
fr_fr: Délai d'attente : %d secondes

source: Self Deafen: %s
fr_fr: Soi-même sourd : %s

source: Per-server command prefix: %s
fr_fr: Préfixe de commande par serveur : %s

source: Round Robin Queue: %s
fr_fr: Queue de Round Robin: %s

source: The requested song `%(subject)s` is blocked by the song block list.
fr_fr: La chanson demandée `%(subject)s` est bloquée par la liste de blocage de chansons.

source: Attempted to handle Voice Channel inactivity, but Bot is not in voice...
fr_fr: Tentative de gestion de l'inactivité du canal vocal, mais le bot n'est pas dans la voix...

source: Channel activity already waiting in guild: %s
fr_fr: L'activité du canal est déjà en attente dans la guilde : %s

source: Channel activity waiting %(time)d seconds to leave channel: %(channel)s
fr_fr: Activité du canal en attente %(time)d secondes pour quitter le canal : %(channel)s

source: Channel activity timer for %s has expired. Disconnecting.
fr_fr: La minuterie d'activité du canal %s a expiré. Déconnexion.

source: Channel activity timer canceled for: %(channel)s in %(guild)s
fr_fr: La minuterie d'activité du canal a été annulée pour: %(channel)s dans %(guild)s

source: Ignoring player inactivity in auto-joined channel: %s
fr_fr: Inactivité du joueur ignorée dans le canal auto-rejoint : %s

source: Player activity timer already waiting in guild: %s
fr_fr: La minuterie d'activité du joueur est déjà en attente dans la guilde : %s

source: Player activity timer waiting %(time)d seconds to leave channel: %(channel)s
fr_fr: Délai d'activité du joueur en attente %(time)d secondes pour quitter le canal : %(channel)s

source: Player activity timer for %s has expired. Disconnecting.
fr_fr: La minuterie d'activité du joueur pour %s a expiré. Déconnexion.

source: Player activity timer canceled for: %(channel)s in %(guild)s
fr_fr: La minuterie d'activité du joueur a été annulée pour: %(channel)s dans %(guild)s

source: Player activity timer is being reset.
fr_fr: Le minuteur d'activité du joueur est en cours de réinitialisation.

source: No such command
fr_fr: Aucune commande de ce type

source: You must mention a user or provide their ID number.
fr_fr: Vous devez mentionner un utilisateur ou fournir son numéro d'identité.

source: Invalid sub-command given. Use `help blockuser` for usage examples.
fr_fr: Sous-commande invalide. Utilisez `help blockuser` pour des exemples d'utilisation.

source: MusicBot could not find the user(s) you specified.
fr_fr: MusicBot n'a pas pu trouver les utilisateurs que vous avez spécifiés.

source: The owner cannot be added to the block list.
fr_fr: Le propriétaire ne peut pas être ajouté à la liste de blocs.

source: Not adding user to block list, already blocked: %(id)s/%(name)s
fr_fr: Impossible d'ajouter un utilisateur à la liste de blocage, déjà bloqué : %(id)s/%(name)s

source: Not removing user from block list, not listed: %(id)s/%(name)s
fr_fr: Ne pas supprimer l'utilisateur de la liste bloquée, non listé : %(id)s/%(name)s

source: Cannot add the users you listed, they are already added.
fr_fr: Impossible d'ajouter les utilisateurs que vous avez listés, ils sont déjà ajoutés.

source: You must provide a song subject if no song is currently playing.
fr_fr: Vous devez indiquer un sujet si aucune chanson n'est en cours de lecture.

source: Invalid sub-command given. Use `help blocksong` for usage examples.
fr_fr: Sous-commande invalide. Utilisez `help blocksong` pour des exemples d'utilisation.

source: Subject `%(subject)s` is already in the song block list.
fr_fr: Sujet `%(subject)s` est déjà dans la liste de blocage de chansons.

source: The subject is not in the song block list and cannot be removed.
fr_fr: Le sujet n'est pas dans la liste des chansons bloquées et ne peut pas être supprimé.

source: Invalid sub-command given. Use `help autoplaylist` for usage examples.
fr_fr: Sous-commande invalide. Utilisez `help autoplaylist` pour des exemples d'utilisation.

source: The supplied song link is invalid
fr_fr: Le lien de la chanson fournie n'est pas valide

source: The queue is empty. Add some songs with a play command!
fr_fr: La file d'attente est vide. Ajoutez des morceaux avec une commande de lecture!

source: This song is already in the autoplaylist.
fr_fr: Cette chanson est déjà dans la liste de lecture automatique.

source: This song is not yet in the autoplaylist.
fr_fr: Cette chanson n'est pas encore dans la liste de lecture automatique.

source: You must provide a playlist filename.
fr_fr: Vous devez fournir un nom de fichier de playlist.

source: You are not allowed to request playlists
fr_fr: Vous n'êtes pas autorisé à demander des playlists

source: Playlist has too many entries (%(songs)s but max is %(max)s)
fr_fr: La playlist a trop d'entrées (%(songs)s mais max est %(max)s)

source: The playlist entries will exceed your queue limit. There are %(songs)s in the list, and %(queued)s already in queue. The limit is %(max)s for your group.
fr_fr: Les entrées de la liste de lecture dépasseront votre limite de file d'attente. Il y a %(songs)s dans la liste, et %(queued)s déjà dans la file d'attente. La limite est %(max)s pour votre groupe.

source: Ignoring auto-pause due to network outage.
fr_fr: Ignorer la pause automatique en raison d'une panne de réseau.

source: MusicPlayer has no VoiceClient or has no channel data, cannot process auto-pause.
fr_fr: MusicPlayer n'a pas de client vocal ou n'a pas de données de canal, ne peut pas traiter la pause automatique.

source: Already processing auto-pause, ignoring this event.
fr_fr: Traitement de la pause automatique, ignorant cet événement.

source: %sVoiceClient not connected, waiting %s seconds to handle auto-pause in guild: %s
fr_fr: %sClient vocal non connecté, en attente de %s secondes pour gérer la pause automatique dans la guilde : %s

source: Auto-pause waiting was cancelled.
fr_fr: L'attente de pause automatique a été annulée.

source: A new MusicPlayer is being connected, ignoring old auto-pause event.
fr_fr: Un nouveau MusicPlayer est en cours de connexion, ignorant l'ancien événement de pause automatique.

source: Playing in an empty voice channel, running auto pause for guild: %s
fr_fr: Lecture dans un salon vocal vide, pause automatique pour la guilde : %s

source: Previously auto paused player is unpausing for guild: %s
fr_fr: Le joueur en pause automatique est en pause pour la guilde : %s

source: Cannot use seek if there is nothing playing.
fr_fr: Impossible d'utiliser seek s'il n'y a rien à jouer.

source: Cannot use seek on current track, it has an unknown duration.
fr_fr: Impossible d'utiliser la recherche sur la piste en cours, elle a une durée inconnue.

source: Seeking is not supported for streams.
fr_fr: La recherche n'est pas prise en charge pour les flux.

source: Cannot use seek without a time to position playback.
fr_fr: Impossible d'utiliser la recherche sans un temps pour positionner la lecture.

source: Could not convert `%(input)s` to a valid time in seconds.
fr_fr: Impossible de convertir `%(input)s` en une heure valide en secondes.

source: Cannot seek to `%(input)s` (`%(seconds)s` seconds) in the current track with a length of `%(progress)s / %(total)s`
fr_fr: Impossible de chercher à `%(input)s` (`%(seconds)s` secondes) dans la piste actuelle avec une longueur de `%(progress)s / %(total)s`

source: Invalid sub-command. Use the command `help repeat` for usage examples.
fr_fr: Sous-commande invalide. Utilisez la commande `help repeat` pour des exemples d'utilisation.

source: The player is not currently looping.
fr_fr: Le joueur n'est pas en boucle.

source: Song positions must be integers!
fr_fr: Les positions de la chanson doivent être des entiers !

source: You gave a position outside the playlist size!
fr_fr: Vous avez donné une position en dehors de la taille de la playlist !

source: Could not prompt for playlist playback, no message to add reactions to.
fr_fr: N'a pas pu demander la lecture de la playlist, aucun message à ajouter des réactions.

source: Local media playback is not enabled.
fr_fr: La lecture des médias locaux n'est pas activée.

source: Spotify URL is invalid or not currently supported.
fr_fr: L'URL Spotify n'est pas valide ou n'est pas prise en charge actuellement.

source: Detected a Spotify URL, but Spotify is not enabled.
fr_fr: Une URL Spotify a été détectée, mais Spotify n'est pas activé.

source: You have reached your enqueued song limit (%(max)s)
fr_fr: Vous avez atteint votre limite de chansons en attente (%(max)s)

source: Karaoke mode is enabled, please try again when its disabled!
fr_fr: Le mode Karaoké est activé, veuillez réessayer quand il est désactivé!

source: Issue with extract_info():
fr_fr: Problème avec extract_info() :

source: Failed to extract info due to error: %(raw_error)s
fr_fr: Échec de l'extraction des informations en raison d'une erreur : %(raw_error)s

source: That video cannot be played. Try using the stream command.
fr_fr: Cette vidéo ne peut pas être lue. Essayez d'utiliser la commande stream.

source: YouTube search returned no results for: %(url)s
fr_fr: La recherche YouTube n'a retourné aucun résultat pour : %(url)s

source: Processed %(number)d of %(total)d songs in %(time).3f seconds at %(time_per).2f s/song
fr_fr: Traité %(number)d de %(total)d chansons en %(time).3f secondes à %(time_per).2f s/chanson

source: No songs were added, all songs were over max duration (%(max)s seconds)
fr_fr: Aucune chanson n'a été ajoutée, toutes les chansons ont été supérieures à la durée maximale (%(max)s secondes)

source: Extracted an entry with 'youtube:playlist' as extractor key
fr_fr: Extrait une entrée avec 'youtube:playlist' comme clé d'extracteur

source: Song duration exceeds limit (%(length)s > %(max)s)
fr_fr: La durée de la musique dépasse la limite (%(length)s > %(max)s)

source: Added song(s) at position %s
fr_fr: Chanson(s) ajoutée à la position %s

source: Cannot estimate time until playing for position: %d
fr_fr: Impossible d'estimer le temps avant de jouer pour la position : %d

source: Failed to get info from the stream request: %s
fr_fr: Impossible d'obtenir les informations de la demande de flux: %s

source: Streaming playlists is not yet supported.
fr_fr: La diffusion de listes de lecture n'est pas encore prise en charge.

source: You have reached your playlist item limit (%(max)s)
fr_fr: Vous avez atteint la limite d'élément de votre playlist (%(max)s)

source: Please specify a search query. Use `help search` for more information.
fr_fr: Veuillez spécifier une requête de recherche. Utilisez `help search` pour plus d'informations.

source: You cannot search for more than %(max)s videos
fr_fr: Vous ne pouvez pas rechercher plus de vidéos %(max)s

source: Waiting for summon lock: %s
fr_fr: En attente d'un verrou d'invocation : %s

source: Summon lock acquired for: %s
fr_fr: Verrouillage de convocation acquis pour: %s

source: You are not connected to voice. Try joining a voice channel!
fr_fr: Vous n'êtes pas connecté à la voix. Essayez de rejoindre un salon vocal !

source: Joining %(guild)s/%(channel)s
fr_fr: Rejoindre %(guild)s/%(channel)s

source: MusicBot cannot follow a user that is not a member of the server.
fr_fr: MusicBot ne peut pas suivre un utilisateur qui n'est pas membre du serveur.

source: Player is not playing.
fr_fr: Le joueur ne joue pas.

source: Nothing in the queue to remove!
fr_fr: Rien dans la file d'attente à supprimer !

source: Nothing found in the queue from user `%(user)s`
fr_fr: Rien n'a été trouvé dans la file d'attente de l'utilisateur `%(user)s`

source: You do not have the permission to remove that entry from the queue. You must be the one who queued it or have instant skip permissions.
fr_fr: Vous n'avez pas le droit de supprimer cette entrée de la file d'attente. Vous devez être celui qui l'a mis en file d'attente ou qui a des permissions de sauter instantanément.

source: Invalid entry number. Use the queue command to find queue positions.
fr_fr: Numéro d'entrée invalide. Utilisez la commande file d'attente pour trouver les positions de la file d'attente.

source: Can't skip! The player is not playing!
fr_fr: Impossible de sauter ! Le joueur ne joue pas !

source: You do not have permission to force skip a looped song.
fr_fr: Vous n'avez pas la permission de forcer le saut d'une chanson en boucle.

source: You do not have permission to force skip.
fr_fr: Vous n'avez pas la permission de forcer le saut.

source: You do not have permission to skip a looped song.
fr_fr: Vous n'avez pas la permission de sauter une chanson en boucle.

source: `%(new_volume)s` is not a valid number
fr_fr: `%(new_volume)s` n'est pas un nombre valide

source: Unreasonable volume change provided: %(old_volume)s%(adjustment)s is %(new_volume)s. Volume can only be set from 1 to 100.
fr_fr: Changement de volume déraisonnable fourni: %(old_volume)s%(adjustment)s est %(new_volume)s. Le volume ne peut être défini que de 1 à 100.

source: Unreasonable volume provided: %(volume)s. Provide a value between 1 and 100.
fr_fr: Volume déraisonnable fourni: %(volume)s. Fournissez une valeur comprise entre 1 et 100.

source: No track is playing, cannot set speed. Use the config command to set a default playback speed.
fr_fr: Aucune piste n'est lue, impossible de définir la vitesse. Utilisez la commande de configuration pour définir une vitesse de lecture par défaut.

source: Speed cannot be applied to streamed media.
fr_fr: La vitesse ne peut pas être appliquée aux médias streamés.

source: You must provide a speed to set.
fr_fr: Vous devez fournir une vitesse à définir.

source: The speed you provided is invalid. Use a number between 0.5 and 100.
fr_fr: La vitesse que vous avez fournie n'est pas valide. Utilisez un nombre entre 0,5 et 100.

source: Invalid option for command: `%(option)s`
fr_fr: Option invalide pour la commande : `%(option)s`

source: Failed to save aliases due to error: `%(raw_error)s`
fr_fr: Échec de la sauvegarde des alias en raison d'une erreur : `%(raw_error)s`

source: You must supply an alias and a command to alias
fr_fr: Vous devez fournir un alias et une commande à alias

source: You must supply an alias name to remove.
fr_fr: Vous devez fournir un nom d'alias à supprimer.

source: The alias `%(alias)s` does not exist.
fr_fr: L'alias `%(alias)s` n'existe pas.

source: Config cannot use channel and user mentions at the same time.
fr_fr: La configuration ne peut pas utiliser les mentions du canal et de l'utilisateur en même temps.

source: Unable to reload Config due to the following error: %(raw_error)s
fr_fr: Impossible de recharger la configuration en raison de l'erreur suivante : %(raw_error)s

source: Could not resolve section name from option name. Please provide a valid section and option name.
fr_fr: Impossible de résoudre le nom de la section à partir du nom de l'option. Veuillez fournir un nom de section et d'option valide.

source: The option given is ambiguous, please provide a section name.
fr_fr: L'option donnée est ambiguë, veuillez fournir un nom de section.

source: You must provide a section name and option name for this command.
fr_fr: Vous devez fournir un nom de section et un nom d'option pour cette commande.

source: The section `%(section)s` is not available. The available sections are: %(sections)s
fr_fr: La section `%(section)s` n'est pas disponible. Les sections disponibles sont : %(sections)s

source: The option `%(option)s` is not available.
fr_fr: L'option `%(option)s` n'est pas disponible.

source: Option `%(option)s` is not editable. Cannot save to disk.
fr_fr: L'option `%(option)s` n'est pas modifiable. Impossible d'enregistrer sur le disque.

source: Failed to save the option: `%(option)s`
fr_fr: Impossible d'enregistrer l'option : `%(option)s`

source: Option `%(option)s` is not editable, value cannot be displayed.
fr_fr: L'option `%(option)s` n'est pas modifiable, la valeur ne peut pas être affichée.

source: Option `%(option)s` is not editable. Cannot update setting.
fr_fr: L'option `%(option)s` n'est pas modifiable. Impossible de mettre à jour le paramètre.

source: You must provide a section, option, and value for this sub command.
fr_fr: Vous devez fournir une section, une option et une valeur pour cette sous-commande.

source: Doing set with on %(config)s == %(value)s
fr_fr: Faire avec %(config)s == %(value)s

source: Option `%(option)s` was not updated!
fr_fr: L'option `%(option)s` n'a pas été mise à jour !

source: Option `%(option)s` is not editable. Cannot reset to default.
fr_fr: L'option `%(option)s` n'est pas modifiable. Impossible de réinitialiser à la valeur par défaut.

source: Resetting %(config)s to default %(value)s
fr_fr: Réinitialisation de %(config)s à %(value)s par défaut

source: Option `%(option)s` was not reset to default!
fr_fr: L'option `%(option)s` n'a pas été réinitialisée par défaut!

source: The option command is deprecated, use the config command instead.
fr_fr: La commande d'option est obsolète, utilisez la commande config à la place.

source: Invalid option specified, use: info, update, or clear
fr_fr: Option non valide spécifiée, utilisez: info, mise à jour ou effacement

source: **Failed** to delete cache, check logs for more info...
fr_fr: **Échec** pour supprimer la cache, vérifiez les logs pour plus d'infos...

source: Queue page argument must be a whole number.
fr_fr: L'argument de la page de file d'attente doit être un nombre entier.

source: There are no songs queued! Queue something with a play command.
fr_fr: Il n'y a pas de chansons en attente ! Mettre en file d'attente quelque chose avec une commande de lecture.

source: Requested page number is out of bounds. There are **%(total)s** pages.
fr_fr: Le numéro de page demandé est hors limites. Il y a **%(total)s** pages.

source: Skipped the current playlist entry.
fr_fr: L'entrée de la playlist actuelle a été ignorée.

source: Not enough entries to paginate the queue.
fr_fr: Pas assez d'entrées pour paginer la file d'attente.

source: Could not post queue message, no message to add reactions to.
fr_fr: Impossible de poster le message de file d'attente, aucun message à ajouter des réactions.

source: Try that again. MusicBot couldn't make or get a reference to the queue message. If the issue persists, file a bug report.
fr_fr: Essayez à nouveau. MusicBot n'a pas pu faire ou obtenir une référence au message de file d'attente. Si le problème persiste, remplissez un rapport de bogue.

source: Cannot use purge on private DM channel.
fr_fr: Impossible d'utiliser la purge sur un canal DM privé.

source: The given URL was not a valid URL.
fr_fr: L'URL donnée n'est pas une URL valide.

source: Could not extract info from input url %(raw_error)s
fr_fr: Impossible d'extraire les infos de l'url d'entrée %(raw_error)s

source: This does not seem to be a playlist.
fr_fr: Cela ne semble pas être une playlist.

source: Invalid user ID or server nickname, please double-check the ID and try again.
fr_fr: Identifiant d'utilisateur ou surnom de serveur invalide, veuillez vérifier l'ID et réessayer.

source: Could not determine the discord User. Try again.
fr_fr: Impossible de déterminer l'utilisateur de la discord. Réessayez.

source: Permissions cannot use channel and user mentions at the same time.
fr_fr: Les permissions ne peuvent pas utiliser les mentions de salon et d'utilisateurs en même temps.

source: Unable to reload Permissions due to an error: %(raw_error)s
fr_fr: Impossible de recharger les autorisations en raison d'une erreur : %(raw_error)s

source: You must provide a group or option name for this command.
fr_fr: Vous devez fournir un nom de groupe ou d'option pour cette commande.

source: You must provide a group, option, and value to set for this command.
fr_fr: Vous devez fournir un groupe, une option et une valeur à définir pour cette commande.

source: The %(option)s sub-command requires a group and permission name.
fr_fr: La sous-commande %(option)s nécessite un nom de groupe et de permission.

source: The group `%(group)s` is not available. The available groups are: %(sections)s
fr_fr: Le groupe `%(group)s` n'est pas disponible. Les groupes disponibles sont: %(sections)s
