Repository: MuXodious/MusicBot
Catalog: i18n/*/LC_MESSAGES/musicbot_messages.po
Languages: ja_jp, ru_ru

source: Remove a song from the queue, optionally at the given queue position. If the position is omitted, the song at the end of the queue is removed. Use the queue command to find position number of your track. However, positions of all songs are changed when a new song starts playing.
ru_ru: Удалить трек из очереди, по желанию можно в указанной очереди. Если позиция опущена, песня в конце очереди удаляется. Используйте команду очереди, чтобы найти номер позиции вашего трека. Тем не менее, позиции всех песен меняются после начала воспроизведения новой песни.

source: Removed entry `%(track)s` added by `%(user)s`
ru_ru: Удалена запись `%(track)s` добавлена `%(user)s`

source: The alias `%(alias)s` does not exist.
ru_ru: Псевдоним `%(alias)s` не существует.

source: **Option:** `%(config)s` %(comment)s %(default)s
ru_ru: **Опция:** `%(config)s` %(comment)s %(default)s

source: **Option:** `%(config)s` Current Value: `%(loaded)s` INI File Value: `%(ini)s`
ru_ru: **Опция:** `%(config)s` Текущее значение: `%(loaded)s` INI значение файла: `%(ini)s`

source: Option `%(config)s` was updated for this session. To save the change use `config save %(section)s %(option)s`
ru_ru: Опция `%(config)s` была обновлена для этой сессии. Для сохранения изменения используйте `config save %(section)s %(option)s`

source: Search for and remove bot messages and commands from the calling text channel. Optionally supply a number of messages to search through, 50 by default 500 max. This command may be slow if larger ranges are given.
ru_ru: Поиск и удаление сообщений и команд бота из текстового канала. При необходимости поставьте количество сообщений для поиска, 50 по умолчанию 500 макс. Эта команда может быть медленной, если указаны большие диапазоны.

source: Could not extract info from input url %(raw_error)s
ru_ru: Не удалось извлечь информацию из входного url %(raw_error)s

source: Successfully added new group: `%(group)s` You can now customize the permissions with: `setperms set %(group)s` Make sure to save the new group with: `setperms save %(group)s`
ru_ru: Успешно добавлена новая группа: `%(group)s` Теперь вы можете изменить права доступа с: `setperms set %(group)s` Убедитесь, что новая группа сохранена в: `setperms save %(group)s`

source: Successfully removed group: `%(group)s` Make sure to save this change with: `setperms save %(group)s`
ru_ru: Удалена группа: `%(group)s` Не забудьте сохранить это изменение с: `setperms save %(group)s`

source: **Permission:** `%(permission)s` Current Value: `%(loaded)s` INI File Value: `%(ini)s`
ru_ru: **Разрешение:** `%(permission)s` Текущее значение: `%(loaded)s` INI значение файла: `%(ini)s`

source: Disconnected a playerless voice client? [BUG]
ru_ru: Отсоединил голосового клиента без проигрывателя? [BUG]

source: Attempt to restart the entire MusicBot process, reloading everything.
ru_ru: Попытка перезапустить весь процесс MusicBot, перезагрузка всего.

source: Attempts to restart the MusicBot in a number of different ways. With no option supplied, a `soft` restart is implied. It can be used to remotely update a MusicBot installation, but should be used with care. If you have a service manager, we recommend using it instead of this command for restarts.
ru_ru: Попытки перезапустить MusicBot несколькими способами. Если опция не указана, то будет подразумеваться перезапуск `soft`. Он может быть использован для удаленного обновления MusicBot, но должен использоваться с осторожностью. Если у вас есть менеджер служб, мы рекомендуем использовать его вместо этой команды для перезапуска.

source: Interact with objgraph, if it is installed, to gain insight into memory usage. You can pass an arbitrary method with arguments (but no spaces!) that is a member of objgraph. Since this method evaluates arbitrary code, it is considered dangerous like the debug command.
ru_ru: Взаимодействовать с objgraph, если он установлен, для получения понимания использования памяти. Вы можете передать произвольный метод с аргументами (но без пробелов!), которые являются членами objgraph. Поскольку этот метод вычисляет произвольный код, он считается опасным, как команда отладки.

source: Update for `%(name)s` to version: `%(version)s`
ru_ru: Обновление для `%(name)s` до версии: `%(version)s`

source: **API Latency:** `%(delay).0f ms`%(voice)s
ru_ru: **Задержка API:** `%(delay).0f ms`%(voice)s

source: Provide your own Spotify Client ID to enable MusicBot to interact with Spotify API. MusicBot will try to use the web player API (guest mode) if nothing is set here. Using your own API credentials grants higher usage limits than guest mode.
ru_ru: Укажите свой собственный идентификатор клиента Spotify для включения MusicBot для взаимодействия с Spotify API. MusicBot попытается использовать API веб-плеера (гостевого режима), если здесь ничего не установлено. Использование собственных учетных данных API увеличивает лимиты использования, чем в гостевом режиме.

source: Enable using commands with @[YourBotNameHere] The CommandPrefix is still available, but can be replaced with @ mention.
ru_ru: Включить использование команд с @[YourBotNameHere] Префикс CommandPrefix все еще доступен, но может быть заменен на @ упоминание.

source: ID numbers for text channels that MusicBot should exclusively use for commands. This can contain IDs for channels in multiple servers. Use spaces to separate multiple IDs. All channels are used if this is not set.
ru_ru: Номера идентификаторов текстовых каналов, которые MusicBot должен использовать только для команд. Это может содержать идентификаторы каналов в нескольких серверах. Используйте пробелы для разделения нескольких ID. Все каналы используются, если это не установлено.

source: This percent of listeners in voice must vote for skip. If SkipsRequired is lower than the computed value, it will be used instead. You can set this from 0 to 1, or 0% to 100%.
ru_ru: Этот процент слушателей в голосе должен проголосовать за пропуск. Если SkipsRequired меньше, чем вычисляемое значение, он будет использован. Вы можете установить это значение от 0 до 1, или 0% до 100%.

source: If enabled, MusicBot will leave a voice channel when no users are listening, after waiting for a period set in LeaveInactiveVCTimeOut option. Listeners are channel members, excluding bots, who are not deafened.
ru_ru: Если этот параметр включен, MusicBot покинет голосовой канал, когда пользователи не слушают, после ожидания периода, установленного в опции LeaveInactiveVCTimeOut, Слушатели являются участниками каналов, за исключением ботов, которые не являются глухими.

source: Allow MusicBot to use timed pings to detect network outage and availability. This may be useful if you keep the bot joined to a channel or playing music 24/7. MusicBot must be restarted to enable network testing. By default this is disabled.
ru_ru: Разрешить MusicBot использовать временные пинги для обнаружения перебоев в сети и ее доступности. Это может быть полезно, если бот подключён к каналу или играет музыку 24/7. MusicBot должен быть перезапущен, чтобы включить сетевое тестирование. По умолчанию это отключено.

source: Enable saving songs played per-server to a playlist file: %(basename)s[Server ID]%(ext)s
ru_ru: Включить сохранение треков на сервере в файл плейлиста: %(basename)s[ID сервера]%(ext)s

source: Enable playback of local media files using the play command. When enabled, users can use: `play file://path/to/file.ext` to play files from the local MediaFileDirectory path.
ru_ru: Включить воспроизведение локальных медиа-файлов с помощью команды воспроизведения. При включении пользователи могут использовать: `play file://path/to/file. xt` для воспроизведения файлов из локального пути MediaFileDirectory.

source: Experimental option to set a static User-Agent header in yt-dlp. It is not typically recommended by yt-dlp to change the UA string. For examples of what you might put here, check the following two links: https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/User-Agent https://www.useragents.me/ Leave blank to use default, dynamically generated UA strings.
ru_ru: Экспериментальная опция для установки статического заголовка User-Agent в yt-dlp. Обычно yt-dlp не рекомендуется изменять строку UA. Примеры того, что вы можете разместить здесь, смотрите следующие две ссылки: https://developer. ozilla.org/en-US/docs/Web/HTTP/Headers/User-Agent https://www.useragents.me/ Оставьте пустым для использования по умолчанию, динамически сгенерированных UA строк.

source: An optional directory path where playable media files can be stored. All files and sub-directories can then be accessed by using 'file://' as a protocol. Example: file://some/folder/name/file.ext Maps to: %(path)s/some/folder/name/file.ext
ru_ru: Необязательный путь к папке, в которой могут храниться файлы воспроизведения. Все файлы и подкаталоги могут быть доступны с помощью 'file://' в качестве протокола. Пример: file://some/folder/name/file.ext Maps to: %(path)s/some/folder/name/file.ext

source: Configure automatic log file rotation at restart, and limit the number of files kept. When disabled, only one log is kept and its contents are replaced each run. Set to 0 to disable. Maximum allowed number is %(max)s.
ru_ru: Настройка автоматического вращения лог файлов при перезапуске и ограничение количества сохраненных файлов. Если отключено, каждый запуск заменяется только одним журналом и его содержимое. Установите значение 0 для отключения. Максимально допустимое значение %(max)s.

source: Configure the log file date format used when LogsMaxKept is enabled. If left blank, a warning is logged and the default will be used instead. Learn more about time format codes from the tables and data here: https://docs.python.org/3/library/datetime.html#strftime-strptime-behavior
ru_ru: Настройка формата даты в журнале, используемого при включенном LogsMaxKept. Если оставить пустым, предупреждение регистрируется и вместо него будет использоваться значение по умолчанию. Подробнее о кодах формата времени из таблиц и данных здесь: https://docs.python.org/3/library/datetime.html#strftime-strptime-behavior

source: Error loading config. Problem: MusicBot could not read config file due to an error: %(raw_error)s Solution: Make sure the file is accessible and error free. Copy the example file from the repo if all else fails.
ru_ru: Ошибка загрузки конфигурации. Проблема: MusicBot не смог прочитать конфигурационный файл из-за ошибки: %(raw_error)s Решение: Убедитесь, что файл доступен и ошибки бесплатны. Скопируйте файл примера из репозитория, если все остальное не удалось.

source: Error loading config value. Problem: The owner ID in [%(section)s] > %(option)s is not valid. Solution: Set %(option)s to a numerical ID or set it to `auto` or `0` for automatic owner binding.
ru_ru: Ошибка загрузки значения конфигурации. Проблема: ID владельца в [%(section)s] > %(option)s недопустим. Решение: Установите %(option)s на числовой ID или установите его в `auto` или `0` для автоматической привязки владельца.

source: Error loading config value. Problem: The config option [%(section)s] > %(option)s is not a valid file location. Solution: Check the path setting and make sure the file exists and is accessible to MusicBot.
ru_ru: Ошибка загрузки значения конфигурации. Проблема: Параметр конфигурации [%(section)s] > %(option)s не является допустимым местоположением файла. Решение: Проверьте настройки пути и убедитесь, что файл существует и доступен для MusicBot.

source: Error loading config value. Problem: One of the IDs in option [%(section)s] > %(option)s is invalid. Solution: Ensure all IDs are numerical, and separated only by spaces or commas.
ru_ru: Ошибка загрузки значения конфигурации. Проблема: Один из идентификаторов в опции [%(section)s] > %(option)s является недопустимым. Решение: Убедитесь, что все ID числовые и разделены только пробелами или запятыми.

source: Specify yt-dlp extractor names, separated by spaces, that are allowed to be used. When empty, hard-coded defaults are used. The defaults are displayed above, but may change between versions. To allow all extractors, add `%(allow_all)s` without quotes to the list. Services/extractors supported by yt-dlp are listed here: https://github.com/yt-dlp/yt-dlp/blob/master/supportedsites.md MusicBot also provides one custom service `spotify:musicbot` to enable or disable Spotify API extraction. NOTICE: MusicBot might not support all services available to yt-dlp!
ru_ru: Укажите имена экстракторов yt-dlp, разделенные пробелами, которые разрешены к использованию. При пустых словах используются значения по умолчанию. По умолчанию отображаются выше, но могут меняться между версиями. Чтобы разрешить все экстракторы, добавьте `%(allow_all)s` без кавычек в список. Сервисы/экстракторы поддерживаемые yt-dlp перечислены здесь: https://github.com/yt-dlp/yt-dlp/blob/master/supportedsites. d MusicBot также предоставляет один пользовательский сервис `spotify:musicbot`, чтобы включить или отключить извлечение Spotify API. ЗАМЕЧАНИЕ: MusicBot может не поддерживать все сервисы yt-dlp!
