Repository: MuXodious/MusicBot
Catalog: i18n/*/LC_MESSAGES/musicbot_messages.po
Languages: ja_jp, ru_ru

source: Resumed music queue
ja_jp: 再開された音楽キュー
ru_ru: Возобновленная очередь музыки

source: Player is not paused.
ja_jp: プレイヤーは一時停止されていません。
ru_ru: Игрок не приостанавливается.

source: Shuffle all current tracks in the queue.
ja_jp: キュー内の現在のトラックをすべてシャッフルします。
ru_ru: Перемешать все текущие треки в очереди.

source: Shuffled all songs in the queue.
ja_jp: キュー内のすべての曲をシャッフルしました。
ru_ru: Перемещает все песни в очередь.

source: Removes all songs currently in the queue.
ja_jp: 現在キュー内のすべての曲を削除します。
ru_ru: Удаляет все песни, которые сейчас находятся в очереди.

source: Cleared all songs from the queue.
ja_jp: キューからすべての曲を消去しました。
ru_ru: Все песни из очереди очищены.

source: Nothing in the queue to remove!
ja_jp: 削除するキューがありません！
ru_ru: Нечего удалять в очереди!

source: Removed `%(track)s` added by `%(user)s`
ja_jp: 削除された`%(track)s` によって追加された`%(user)s`
ru_ru: Удалено `%(track)s` добавил `%(user)s`

source: Nothing found in the queue from user `%(user)s`
ja_jp: `%(user)s`からのキューには何も見つかりませんでした。
ru_ru: В очереди у пользователя `%(user)s ничего не найдено

source: You do not have the permission to remove that entry from the queue. You must be the one who queued it or have instant skip permissions.
ja_jp: キューからそのエントリを削除する権限がありません。 キューに登録した方、または即座にスキップ権限を持っている必要があります。
ru_ru: У вас недостаточно прав для удаления этой записи из очереди. Вы должны быть тот, кто поставил его в очередь или имеет мгновенные пропуска.

source: Invalid entry number. Use the queue command to find queue positions.
ja_jp: 無効なエントリ番号です。キューの位置を見つけるには、キューコマンドを使用してください。
ru_ru: Неверный номер записи. Используйте команду очереди для поиска позиций.

source: Removed entry `%(track)s`
ja_jp: 削除された項目 `%(track)s`
ru_ru: Удалена запись `%(track)s`

source: Can't skip! The player is not playing!
ja_jp: スキップできません！プレイヤーがプレイしていません！
ru_ru: Нельзя пропустить! Игрок не играет!

source: The next song `%(track)s` is downloading, please wait.
ja_jp: 次の曲「%(track)s」がダウンロードされています。お待ちください。
ru_ru: Следующая песня `%(track)s` загружается, пожалуйста, подождите.

source: The next song will be played shortly. Please wait.
ja_jp: 次の曲はまもなく再生されます。しばらくお待ちください。
ru_ru: Следующая песня будет воспроизведена в ближайшее время. Пожалуйста, подождите.

source: Something odd is happening. You might want to restart the bot if it doesn't start working.
ja_jp: 奇妙なことが起きています。 動作し始めない場合は再起動してください。

source: Something strange is happening. You might want to restart the bot if it doesn't start working.
ja_jp: 奇妙なことが起きています。 動き始めない場合は再起動してください。

source: You do not have permission to force skip a looped song.
ja_jp: ループされた曲をスキップする権限がありません。
ru_ru: У вас недостаточно прав для принудительного пропуска циклической песни.

source: Force skipped `%(track)s`.
ja_jp: `%(track)s`を強制スキップしました。

source: You do not have permission to force skip.
ja_jp: スキップを強制する権限がありません。
ru_ru: У вас нет разрешения на принудительный пропуск.

source: You do not have permission to skip a looped song.
ja_jp: ループ曲をスキップする権限がありません。
ru_ru: У вас нет разрешения на пропуск зацикливаемой песни.

source: Your skip for `%(track)s` was acknowledged. The vote to skip has been passed.%(next_up)s
ja_jp: `%(track)s`へのスキップが確認されました。 スキップへの投票が完了しました。%(next_up)s
ru_ru: Ваш пропуск для `%(track)s` был подтвержден. Пропущен голос.%(next_up)s

source: Next song coming up!
ja_jp: 次の曲が登場！
ru_ru: Следующая песня!

source: Your skip for `%(track)s` was acknowledged. Need **%(votes)s** more vote(s) to skip this song.
ja_jp: `%(track)s`へのスキップが承認されました。 この曲をスキップするには**%(votes)s**以上の投票が必要です。

source: Current volume: `%(volume)s%%`
ja_jp: 現在のボリューム: `%(volume)s%%`
ru_ru: Текущий объем: `%(volume)s%%`

source: `%(new_volume)s` is not a valid number
ja_jp: '%(new_volume)s' は有効な数字ではありません
ru_ru: `%(new_volume)s` не является допустимым числом

source: Updated volume from **%(old)d** to **%(new)d**
ja_jp: **%(old)d**から**%(new)d **までの音量を更新しました **
ru_ru: Изменена громкость с **%(old)d** до **%(new)d**

source: Unreasonable volume change provided: %(old_volume)s%(adjustment)s is %(new_volume)s. Volume can only be set from 1 to 100.
ja_jp: 不合理なボリューム変更が提供されました: %(old_volume)s%(adjustment)s は %(new_volume)sです。 ボリュームは1から100まで設定できます。
ru_ru: Неприемлемое изменение объема предусматривается: %(old_volume)s%(adjustment)s является %(new_volume)s. Том может быть установлен только от 1 до 100.

source: Unreasonable volume provided: %(volume)s. Provide a value between 1 and 100.
ja_jp: 不合理なボリュームが提供されました: %(volume)s. 1から100までの値を入力してください。
ru_ru: Неприемлемый объём: %(volume)s. Предоставьте значение от 1 до 100.

source: No track is playing, cannot set speed. Use the config command to set a default playback speed.
ja_jp: トラックが再生されていないため、速度を設定できません。 デフォルトの再生速度を設定するにはconfigコマンドを使用してください。

source: Speed cannot be applied to streamed media.
ja_jp: ストリームメディアには速度を適用できません。
ru_ru: Скорость не может быть применена к потоковым носителям.

source: You must provide a speed to set.
ja_jp: 設定する速度を提供する必要があります。
ru_ru: Вы должны предоставить скорость для установки.

source: The speed you provided is invalid. Use a number between 0.5 and 100.
ja_jp: 指定した速度が無効です。0.5 から 100までの数字を使用してください。
ru_ru: Предоставленная вами скорость является недопустимой. Используйте число в диапазоне от 0.5 до 100.

source: Setting playback speed to `%(speed).3f` for current track.
ja_jp: 現在のトラックの再生速度を「%(speed).3f」に設定しました。
ru_ru: Установка скорости воспроизведения в `%(speed).3f` для текущего трека.

source: Add an new alias with optional arguments.
ja_jp: オプション引数を持つ新しいエイリアスを追加します。

source: Allows management of aliases from discord. To see aliases use the help command.
ja_jp: ディスコードからエイリアスを管理できます。エイリアスを表示するにはヘルプコマンドを使用します。
ru_ru: Позволяет управлять псевдонимами из discord. Чтобы увидеть псевдонимы, используйте команду помощи.

source: Invalid option for command: `%(option)s`
ja_jp: コマンドの無効なオプション: `%(option)s`
ru_ru: Недопустимый параметр для команды: `%(option)s`

source: Aliases reloaded from config file.
ja_jp: エイリアスが設定ファイルからリロードされました。
ru_ru: Псевдонимы перезагружены из файла конфигурации.

source: Aliases saved to config file.
ja_jp: エイリアスを設定ファイルに保存しました。
ru_ru: Псевдонимы сохранены в конфигурационном файле.

source: Failed to save aliases due to error: `%(raw_error)s`
ja_jp: エラーのためエイリアスを保存できませんでした: `%(raw_error)s`
ru_ru: Не удалось сохранить псевдонимы из-за ошибки: `%(raw_error)s`

source: You must supply an alias and a command to alias
ja_jp: エイリアスにエイリアスとコマンドを提供する必要があります
ru_ru: Вы должны указать псевдоним и команду для псевдонима

source: New alias added. `%(alias)s` is now an alias of `%(command)s`
ja_jp: 新しいエイリアスが追加されました。`%(alias)s`は`%(command)s`のエイリアスになりました。
ru_ru: Добавлен новый псевдоним. `%(alias)s` теперь является псевдонимом `%(command)s`

source: You must supply an alias name to remove.
ja_jp: 削除するにはエイリアス名を入力してください。
ru_ru: Вы должны указать имя псевдонима для удаления.

source: Alias `%(alias)s` was removed.
ja_jp: エイリアス`%(alias)s`は削除されました。
ru_ru: Псевдоним `%(alias)s` был удален.

source: Shows help text about any missing config options.
ja_jp: 不足している設定オプションについてヘルプテキストを表示します。

source: Lists the names of options which have been changed since loading config file.
ja_jp: 設定ファイルの読み込み時に変更されたオプションの名前を一覧表示します。

source: List the available config options and their sections.
ja_jp: 利用可能な設定オプションとそのセクションを一覧表示します。

source: Shows help text for a specific option.
ja_jp: 特定のオプションのヘルプテキストを表示します。
ru_ru: Показывает текст справки для определенного варианта.

source: Display the current value of the option.
ja_jp: オプションの現在の値を表示します。
ru_ru: Отображение текущего значения параметра.

source: Saves the current value to the options file.
ja_jp: 現在の値をオプションファイルに保存します。
ru_ru: Сохраняет текущее значение в файл параметров.

source: Validates the option and sets the config for the session, but not to file.
ja_jp: オプションを検証し、セッションの設定をファイルではなく設定します。
ru_ru: Проверяет опцию и устанавливает конфигурацию для сессии, но не для файла.

source: Reset the option to its default value.
ja_jp: オプションをデフォルト値にリセットします。
ru_ru: Сброс параметра в значение по умолчанию.

source: Manage options.ini configuration from within Discord.
ja_jp: Discord内で options.ini の設定を管理します。
ru_ru: Управление конфигурацией options.ini из Discord.

source: Config cannot use channel and user mentions at the same time.
ja_jp: 設定では、チャンネルとユーザーのメンションを同時に使用できません。
ru_ru: Конфигурация не может использовать канал и упоминания пользователя одновременно.

source: *All config options are present and accounted for!*
ja_jp: *すべての設定オプションが存在し、考慮されています！*
ru_ru: *Все настройки присутствуют и учтены для!*

source: No config options appear to be changed.
ja_jp: 設定オプションは変更されていません。
ru_ru: Похоже, что настройки конфигурации не были изменены.

source: **Changed Options:** %(changed)s
ja_jp: **変更されたオプション:** %(changed)s
ru_ru: **Измененные параметры:** %(changed)s

source: ## Available Options: **Editable Options:** %(editable)s **Manual Edit Only:** %(manual)s
ja_jp: ## 利用可能なオプション: **編集可能なオプション:** %(editable)s **Manual Edit Only:** %(manual)s
ru_ru: ## Доступные опции: **Опции для редактирования:** %(editable)s **Только для ручного редактирования:** %(manual)s

source: Config options reloaded from file successfully!
ja_jp: 設定オプションが正常にファイルから再読み込みされました！
ru_ru: Настройки конфигурации успешно перезагружены из файла!

source: Unable to reload Config due to the following error: %(raw_error)s
ja_jp: 次のエラーのため設定を再読み込みできません: %(raw_error)s
ru_ru: Не удалось перезагрузить конфигурацию из-за следующей ошибки: %(raw_error)s

source: Could not resolve section name from option name. Please provide a valid section and option name.
ja_jp: オプション名からセクション名を解決できませんでした。有効なセクション名とオプション名を入力してください。
ru_ru: Не удалось определить название секции с названием опции. Пожалуйста, укажите корректный раздел и название опции.

source: The option given is ambiguous, please provide a section name.
ja_jp: 与えられたオプションは曖昧です。セクション名を入力してください。
ru_ru: Указанная опция является неоднозначной, укажите название раздела.

source: You must provide a section name and option name for this command.
ja_jp: このコマンドのセクション名とオプション名を指定する必要があります。
ru_ru: Вы должны указать название раздела и название параметра для этой команды.

source: The section `%(section)s` is not available. The available sections are: %(sections)s
ja_jp: The section `%(section)s` is not available. The available section: %(sections)s
ru_ru: Раздел `%(section)s` недоступен. Доступные разделы: %(sections)s

source: The option `%(option)s` is not available.
ja_jp: オプション `%(option)s` は使用できません。
ru_ru: Опция `%(option)s` недоступна.

source: This option can only be set by editing the config file.
ja_jp: このオプションは設定ファイルを編集することでのみ設定できます。
ru_ru: Эта опция может быть задана только редактированием конфигурационного файла.

source: By default this option is set to: %(default)s
ja_jp: デフォルトでは、このオプションは %(default)s に設定されています
ru_ru: По умолчанию эта опция установлена на: %(default)s

source: Option `%(option)s` is not editable. Cannot save to disk.
ja_jp: オプション `%(option)s` は編集できません。ディスクに保存できません。
ru_ru: Параметр `%(option)s` не редактируется. Невозможно сохранить на диск.

source: Failed to save the option: `%(option)s`
ja_jp: オプションの保存に失敗しました: `%(option)s`
ru_ru: Не удалось сохранить опцию: `%(option)s`

source: Successfully saved the option: `%(config)s`
ja_jp: 正常にオプションを保存しました: `%(config)s`
ru_ru: Опция `%(config)s` успешно сохранена

source: Option `%(option)s` is not editable, value cannot be displayed.
ja_jp: Option `%(option)s` は編集できません。値を表示できません。
ru_ru: Параметр `%(option)s` не может быть отредактирован, значение не отображается.

source: Option `%(option)s` is not editable. Cannot update setting.
ja_jp: オプション `%(option)s` は編集できません。設定を更新できません。
ru_ru: Параметр `%(option)s` не редактируется. Не удается обновить параметр.

source: You must provide a section, option, and value for this sub command.
ja_jp: このサブコマンドのセクション、オプション、値を指定する必要があります。
ru_ru: Вы должны указать раздел, параметр и значение для этой подкоманды.

source: Option `%(option)s` was not updated!
ja_jp: Option `%(option)s` は更新されませんでした！
ru_ru: Опция `%(option)s` не была обновлена!

source: Option `%(option)s` is not editable. Cannot reset to default.
ja_jp: オプション `%(option)s` は編集できません。デフォルトにリセットできません。
ru_ru: Параметр `%(option)s` не является редактируемым. Невозможно сбросить к значению по умолчанию.

source: Option `%(option)s` was not reset to default!
ja_jp: Option `%(option)s` はデフォルトにリセットされませんでした！
ru_ru: Параметр `%(option)s` не был сброшен до значения по умолчанию!

source: Option `%(config)s` was reset to its default value `%(default)s`. To save the change use `config save %(section)s %(option)s`
ja_jp: オプション `%(config)s` はデフォルト値の `%(default)s` にリセットされました。 変更を保存するには、 `config save %(section)s %(option)s ` を使用してください
ru_ru: Параметр `%(config)s` был сброшен к значению по умолчанию `%(default)s`. Чтобы сохранить изменение используйте `config save %(section)s %(option)s`

source: Deprecated command, use the config command instead.
ja_jp: 非推奨のコマンドは、configコマンドを使用してください。
ru_ru: Устаревшая команда, используйте команду config.

source: The option command is deprecated, use the config command instead.
ja_jp: option コマンドは推奨されません。config コマンドを使用してください。
ru_ru: Команда опции является устаревшим, используйте команду config.

source: Display information about cache storage or clear cache according to configured limits. Using update option will scan the cache for external changes before displaying details.
ja_jp: 設定された制限に従ってキャッシュストレージまたはキャッシュクリアに関する情報を表示します。 updateオプションを使用すると、詳細を表示する前に外部の変更のキャッシュをスキャンします。
ru_ru: Отображение информации о кэше или очистка кэша в соответствии с заданными пределами. Использование опции обновления будет сканировать кэш для внешних изменений перед отображением деталей.

source: Invalid option specified, use: info, update, or clear
ja_jp: 無効なオプションが指定されました。情報、更新、またはクリアを使用してください。
ru_ru: Указан неверный параметр, используйте информацию: info, update, or clear

source: Disabled
ja_jp: 無効
ru_ru: Отключено

source: Enabled
ja_jp: 有効
ru_ru: Включено

source: %(time)s days
ja_jp: %(time)s 日

source: Unlimited
ja_jp: 無制限です
ru_ru: Неограниченный

source: **Video Cache:** *%(state)s* **Storage Limit:** *%(size)s* **Time Limit:** *%(time)s* **Cached Now: %(used)s in %(files)s file(s).
ja_jp: **ビデオキャッシュ:** *%(state)s* **ストレージ制限:** *%(size)s* **タイム制限:** *%(time)s* **キャッシュされた: %(used)s in %(files)s file(s).
ru_ru: **Видео кэш:** *%(state)s* **Лимит хранения:** *%(size)s* **Лимит времени:** *%(time)s* **Cached Now: %(used)s in %(files)s file(s).

source: Cache has been cleared.
ja_jp: キャッシュがクリアされました。
ru_ru: Кэш был очищен.

source: **Failed** to delete cache, check logs for more info...
ja_jp: **キャッシュの削除に失敗しました。ログの詳細を確認してください。
ru_ru: **Не удалось** удалить кэш, проверьте журналы для получения дополнительной информации...

source: No cache found to clear.
ja_jp: クリアするキャッシュが見つかりません。
ru_ru: Не найден кэш для очистки.

source: Display information about the current player queue. Optional page number shows later entries in the queue.
ja_jp: 現在のプレイヤーキューについての情報を表示します。 オプションのページ番号は、キューの後のエントリを表示します。

source: Queue page argument must be a whole number.
ja_jp: キューページ引数は整数でなければなりません。
ru_ru: Аргумент очереди страницы должен быть целым числом.

source: Requested page number is out of bounds. There are **%(total)s** pages.
ja_jp: 要求されたページ番号が範囲外です。 **%(total)s** ページがあります。

source: (unknown duration)
ja_jp: (不明な期間)
ru_ru: (время неизвестно)

source: Currently playing: `%(title)s` Added by: `%(user)s` Progress: `[%(progress)s/%(total)s]`
ja_jp: 現在プレイ中: `%(title)s` 追加: `%(user)s` 進捗: `[%(progress)s/%(total)s]`
ru_ru: В настоящее время играет: `%(title)s` Добавлено: `%(user)s` Прогресс: `[%(progress)s/%(total)s]`

source: %(progress)sThere are `%(total)s` entries in the queue. Here are the next %(per_page)s songs, starting at song #%(start)s %(tracks)s
ja_jp: %(progress)s%(total)s`エントリーがキューにあります。 次回の %(per_page)s 曲は、曲 #%(start)s %(tracks)s から始まります。
ru_ru: %(progress)sВ очереди ` записей%(total)s`. Вот следующие песни %(per_page)s , начинающиеся с #%(start)s %(tracks)s

source: Songs in queue
ja_jp: キュー内の曲
ru_ru: Песни в очереди

source: Try that again. MusicBot couldn't make or get a reference to the queue message. If the issue persists, file a bug report.
ja_jp: もう一度お試しください。MusicBotはキューメッセージへの参照を作成できませんでした。 問題が解決しない場合は、バグレポートを送信してください。

source: Invalid parameter. Please provide a number of messages to search.
ja_jp: 無効なパラメータです。検索するために、多数のメッセージを入力してください。
ru_ru: Неверный параметр. Укажите количество сообщений для поиска.

source: Cannot use purge on private DM channel.
ja_jp: プライベート DM チャンネルでパージを使用できません。
ru_ru: Нельзя использовать очистку в приватном ЛС канале.

source: Cleaned up %(number)s message(s).
ja_jp: %(number)s メッセージをクリーンアップしました。
ru_ru: Очищено %(number)s сообщение(ов).

source: Bot does not have permission to manage messages.
ja_jp: Botにメッセージを管理する権限がありません。
ru_ru: Бот не имеет разрешения на управление сообщениями.

source: Dump the individual URLs of a playlist to a file.
ja_jp: プレイリストの個々の URL をファイルにダンプします。
ru_ru: Сбросить отдельные URL плейлиста в файл.

source: The given URL was not a valid URL.
ja_jp: 指定されたURLは有効なURLではありませんでした。
ru_ru: Указанный URL не является допустимым URL.

source: This does not seem to be a playlist.
ja_jp: これはプレイリストではないようです。
ru_ru: Похоже, что это не плейлист.

source: Here is the playlist dump for: %(url)s
ja_jp: 次のプレイリストダンプがあります: %(url)s
ru_ru: Вот дамп плейлиста для: %(url)s

source: Display your Discord User ID, or the ID of a mentioned user. This command is deprecated in favor of Developer Mode in Discord clients.
ja_jp: DiscordユーザーID、またはメンションユーザーのIDを表示します。 このコマンドはDiscordクライアントの開発者モードを支持して非推奨です。

source: Your user ID is `%(id)s`
ja_jp: あなたのユーザーIDは `%(id)s`
ru_ru: Ваш идентификатор пользователя: `%(id)s`

source: The user ID for `%(username)s` is `%(id)s`
ja_jp: `%(username)s`のユーザーIDは`%(id)s`です
ru_ru: ID пользователя для `%(username)s`: `%(id)s`

source: Valid categories: %(cats)s
ja_jp: 有効なカテゴリ: %(cats)s
ru_ru: Допустимые категории: %(cats)s

source: Here are the IDs you requested:
ja_jp: 要求されたIDは次のとおりです：
ru_ru: Ниже приведены идентификаторы ваших запросов:

source: Get a list of your permissions, or the permissions of the mentioned user.
ja_jp: アクセス権の一覧、またはメンションされたユーザーの権限を取得します。
ru_ru: Получить список разрешений, или разрешения упомянутого пользователя.

source: Invalid user ID or server nickname, please double-check the ID and try again.
ja_jp: 無効なユーザーIDまたはサーバーニックネームです。IDを再確認してもう一度やり直してください。
ru_ru: Неверный ID пользователя или имя сервера, проверьте ID и повторите попытку.

source: Could not determine the discord User. Try again.
ja_jp: discordユーザーを特定できませんでした。もう一度お試しください。
ru_ru: Не удалось определить пользователя discord. Попробуйте еще раз.

source: Your command permissions in %(server)s are: ``` %(permissions)s ```
ja_jp: %(server)s のコマンドパーミッションは以下の通りです: ``` %(permissions)s ```
ru_ru: Права доступа к командам в %(server)s : ``` %(permissions)s ```

source: The command permissions for %(username)s in %(server)s are: ``` %(permissions)s ```
ja_jp: %(username)s の %(server)s のコマンドパーミッションは: ``` %(permissions)s ```
ru_ru: Разрешения команд для %(username)s в %(server)s : ``` %(permissions)s ```

source: Show loaded groups and list permission options.
ja_jp: ロードされたグループと権限オプションを表示します。

source: Reloads permissions from the permissions.ini file.
ja_jp: パーミッション.ini ファイルからパーミッションを再読み込みします。
ru_ru: Перезагружает права доступа из файла permissions.ini.

source: Add new group with defaults.
ja_jp: 新しいグループをデフォルトで追加します。

source: Remove existing group.
ja_jp: 既存のグループを削除します。
ru_ru: Удалить существующую группу.

source: Show help text for the permission option.
ja_jp: 権限オプションのヘルプテキストを表示します。
ru_ru: Показать текст справки для опции разрешения.

source: Show permission value for given group and permission.
ja_jp: 指定されたグループと権限の権限値を表示します。

source: Save permissions group to file.
ja_jp: 権限グループをファイルに保存します。
ru_ru: Сохранить группу прав доступа в файл.

source: Set permission value for the group.
ja_jp: グループの権限値を設定します。
ru_ru: Установка значения прав доступа для группы.

source: Manage permissions.ini configuration from within discord.
ja_jp: discord内からpermissions.iniの設定を管理します。
ru_ru: Управление конфигурацией permissions.ini из дистрибутива.

source: Permissions cannot use channel and user mentions at the same time.
ja_jp: 権限は同時にチャンネルとユーザーメンションを使用することはできません。
ru_ru: Права доступа не могут использовать каналы и упоминания пользователей одновременно.

source: Permissions reloaded from file successfully!
ja_jp: 権限がファイルから正常に再読み込みされました！
ru_ru: Права доступа успешно перезагружены из файла!

source: Unable to reload Permissions due to an error: %(raw_error)s
ja_jp: エラーが発生したため権限を再読み込みできません: %(raw_error)s
ru_ru: Не удается перезагрузить разрешения из-за ошибки: %(raw_error)s

source: ## Available Groups: %(groups)s ## Available Options: %(options)s
ja_jp: ## 利用可能なグループ: %(groups)s ## 利用可能なオプション: %(options)s
ru_ru: ## Доступные группы: %(groups)s ## Доступные параметры: %(options)s

source: You must provide a group or option name for this command.
ja_jp: このコマンドのグループまたはオプション名を指定する必要があります。
ru_ru: Вы должны указать название группы или опции для этой команды.

source: You must provide a group, option, and value to set for this command.
ja_jp: このコマンドに設定するには、グループ、オプション、値を指定する必要があります。
ru_ru: Вы должны указать группу, опцию и значение для этой команды.

source: The %(option)s sub-command requires a group and permission name.
ja_jp: %(option)s サブコマンドにはグループ名と権限名が必要です。
ru_ru: Субкоманда %(option)s требует имя группы и прав доступа.

source: The group `%(group)s` is not available. The available groups are: %(sections)s
ja_jp: The group `%(group)s` is not available. The available groups is : %(sections)s
ru_ru: Группа `%(group)s` недоступна. Доступные группы: %(sections)s

source: The permission `%(option)s` is not available.
ja_jp: パーミッション`%(option)s`は利用できません。
ru_ru: Разрешение `%(option)s` недоступно.

source: This permission can only be set by editing the permissions file.
ja_jp: この権限は権限ファイルを編集することでのみ設定できます。
ru_ru: Это право может быть установлено только редактированием файла разрешений.

source: By default this permission is set to: `%(value)s`
ja_jp: デフォルトでは、この権限は次に設定されています: `%(value)s`
ru_ru: По умолчанию это разрешение установлено в: `%(value)s`

source: **Permission:** `%(option)s` %(comment)s %(default)s
ja_jp: **権限:** `%(option)s` %(comment)s %(default)s
ru_ru: **Разрешение:** `%(option)s` %(comment)s %(default)s

source: Cannot add group `%(group)s` it already exists.
ja_jp: グループを追加できません`%(group)s` が既に存在します。
ru_ru: Невозможно добавить группу `%(group)s`, она уже существует.

source: Cannot remove built-in group.
ja_jp: 組み込みグループを削除できません。
ru_ru: Невозможно удалить встроенную группу.

source: The owner group is not editable.
ja_jp: オーナーグループは編集できません。
ru_ru: Группа владельцев не редактируется.

source: Failed to save the group: `%(group)s`
ja_jp: グループの保存に失敗しました: `%(group)s`
ru_ru: Не удалось сохранить группу: `%(group)s`

source: Successfully saved the group: `%(group)s`
ja_jp: グループを正常に保存しました: `%(group)s`
ru_ru: Группа успешно сохранена: `%(group)s`

source: Permission `%(option)s` was not updated!
ja_jp: パーミッション`%(option)s`は更新されませんでした！
ru_ru: Разрешение `%(option)s` не было обновлено!

source: Permission `%(permission)s` was updated for this session. To save the change use `setperms save %(section)s %(option)s`
ja_jp: パーミッション`%(permission)s` が更新されました。 変更を保存するには、 `setperms save %(section)s %(option)s ` を使います。
ru_ru: Разрешение `%(permission)sбыло обновлено для этой сессии. Чтобы сохранить изменение, используйте `setperms сохранить %(section)s %(option)s`

source: Change the bot's username on discord. Note: The API may limit name changes to twice per hour.
ja_jp: discord上のボットのユーザー名を変更します。 注意: APIは名前の変更を1時間に2回まで制限する場合があります。
